Repository: scilab/scilab
Catalog: scilab/modules/randlib/locales/*.po
Languages: fr_fr

source: %s: Wrong number of input argument: %d expected with option '%s'.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée : %d attendu(s) avec l'option '%s'.

source: %s: Wrong number of output argument: %d expected the option '%s'.
fr_fr: %s : Nombre erroné d''argument(s) de sortie : %d attendu(s) avec l'option '%s'.

source: The %s option affects only the clcg4 generator
fr_fr: L'option %s affecte seulement le générateur clcg4

source: %s: Wrong number of input arguments: %d expected with option '%s'.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d attendu(s) avec l'option '%s'.

source: %s: Wrong type for input argument #%d: Scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong number of input arguments: %d expected for '%s' with the %s generator.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d attendus pour '%s' avec le générateur %s.

source: %s: Wrong values for input argument: Vector of %d or %d values for %s expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée : Un vecteur de %d ou %d valeurs pour %s attendu.

source: %s: Wrong size for input argument #%d: %dx%d expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : %dx%d attendu.

source: %s: Wrong number of input arguments: %d or %d expected for '%s' option with the %s generator.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d ou %d attendus pour l'option '%s' avec le générateur %s.

source: %s: Wrong number of input arguments: expected %d for '%s' option with the %s or %s generator.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d attendus pour l'option '%s' avec le générateur %s ou %s.

source: %s: Wrong number of input arguments: %d expected for '%s' option with the %s generator.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d attendus pour l'option '%s' avec le générateur %s.

source: %s: Wrong number of output argument: %d expected with option '%s'.
fr_fr: %s : Nombre erroné d'argument de sortie : %d attendu avec l'option '%s'.

source: %s: The %s option affects only the %s generator
fr_fr: %s : L'option %s affecte seulement le générateur %s

source: %s: Wrong value for input argument #%d: %d, %d or %d expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : %d, %d ou %d attendu.

source: The %s option affects only the %s generator
fr_fr: L'option %s affecte seulement le générateur %s

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être entre %d et %d.

source: %s: Wrong value for input argument #%d: Must be > %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être > %d.

source: This information concerns only the clcg4 generator
fr_fr: Cette information concerne seulement le générateur clcg4

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: '%s' is unknown.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s' est inconnu.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: Positive scalar expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Un scalaire positif attendu.

source: Missing A and B for beta law
fr_fr: A et B manquants pour la loi bêta

source: %s: Wrong size for input argument: Scalar expected for %s.
fr_fr: %s : Dimension erronée de l'argument d'entrée : Un scalaire attendu pour %s.

source: Rand(...,'bet',..): A or B < %f
fr_fr: Rand(...,'bet',..): A ou B < %f

source: Missing Dfn and Dfd for F law
fr_fr: Dfn et Dfd manquants pour la loi F

source: Degrees of freedom nonpositive
fr_fr: Degrés de liberté non positif

source: %s: Wrong value for input argument #%d: Must be the number of random deviate.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être le nombre de valeurs aléatoires.

source: Missing N and P for MULtinomial law
fr_fr: N et P manquants pour la loi MULtinomiale

source: %s: Wrong size for input argument: Column vector expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée : Un vecteur colonne attendu.

source: Ncat <= 1
fr_fr: N < 0

source: Sum of P(i) > 1
fr_fr: Somme de P(i) > 1

source: Missing shape and rate for Gamma law
fr_fr: Paramètres de forme et d'intensité manquants pour la loi Gamma

source: grand(..'gam',A,R) : A <= 0.0 or R <= 0.0
fr_fr: grand(..'gam',A,R) : A <= 0.0 ou R <= 0.0

source: Missing Av and Sd for Normal law
fr_fr: Av et Sd manquants pour la loi Normale

source: Missing Low and High for Uniform Real law
fr_fr: Bornes inférieure et supérieure manquantes pour la loi réelle uniforme

source: %s: Wrong type for input argument: Scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée : Un scalaire attendu.

source: %s: Wrong type for input argument. Low < High expected.
fr_fr: %s : Type erroné de l'argument d'entrée : Borne inférieure < Borne supérieure attendu.

source: Missing Low and High for Uniform int law
fr_fr: Bornes inférieure et supérieure manquantes pour la loi uniforme entière

source: a and b must integers with (b-a+1) <= 2147483561
fr_fr: a et b doivent être entiers avec (b-a+1) <= 2147483561

source: %s: Wrong value for input argument: Number of random simulation expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée : Nombre de simulations aléatoires attendu.

source: Missing vect for random permutation
fr_fr: vect manquant pour la permutation aléatoire

source: %s: Wrong type for input argument: Matrix (full or sparse) or Hypermatrix of Reals, Complexes, Integers, Booleans, Strings or Polynomials expected.
fr_fr: %s : Type erroné de l'argument d'entrée : Une matrice (pleine ou creuse) ou une hypermatrice de réels, de complexes, d'entiers , de booléens, de chaînes de caractères ou de polynômes attendue.

source: Missing N and P for Negative Binomial law
fr_fr: N et P manquants pour la loi Binomiale négative

source: P is not in [0,1]
fr_fr: P n'est pas dans [0,1]

source: Missing N and P for Binomial law
fr_fr: N et P manquants pour la loi Binomiale

source: %s: Wrong value for input argument #%d: Must be the number of random simulation.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être le nombre de simulations aléatoires.

source: Missing Mean and Cov for Multivariate Normal law
fr_fr: Mean et Cov manquants pour la loi Normale Multivariée

source: %s: Wrong type for input argument: Column vector expected.
fr_fr: %s : Type erroné de l'argument d'entrée : Un vecteur colonne attendu.

source: %s: Wrong type for input argument: Square matrix expected.
fr_fr: %s : Type erroné de l'argument d'entrée : Une matrice carrée attendue.

source: %s: Wrong type for input arguments: Mean and Cov have incompatible dimensions
fr_fr: %s : Type erroné des arguments d'entrée : Mean et Cov ont des dimensions incompatibles

source: %s: Wrong size for input arguments: Mean and Cov are of null size.
fr_fr: %s : Dimension erronée des arguments d'entrée : Mean et Cov sont de taille nulle.

source: %s: Missing P matrix and X0 for Markov chain
fr_fr: %s : Les matrices P et X0 sont manquantes pour la chaîne de Markov

source: %s: Wrong type for input argument #%d: Square matrix or row vector expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice carrée ou un vecteur ligne attendu.

source: X0 is empty
fr_fr: X0 est vide

source: %s: X0(%d) must be in the range [1,%d[
fr_fr: %s : X0(%d) doit être dans l'intervalle [1,%d[

source: Sum of P(%d,1:%d)=%f ~= 1
fr_fr: Somme de P(%d,1:%d)=%f ~= 1

source: %s: Wrong number of input argument.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée.

source: Missing Df and Xnonc for non-central chi-square law
fr_fr: Df et Xnonc manquants pour la loi du chi carré non centrée

source: DF < 1 or XNONC < 0
fr_fr: DF < 1 ou XNONC < 0

source: Missing Dfn, Dfd and Xnonc for non-central F law
fr_fr: Dfn, Dfd et Xnonc manquants pour la loi F non centrée

source: DF < 1.0 or DF <= 0.0 or Xnonc < 0.0
fr_fr: DF < 1.0 ou DF <= 0.0 ou Xnonc < 0.0

source: Missing Df for chi-square law
fr_fr: Df manquant pour la loi du chi carré

source: Missing Av for Poisson law
fr_fr: Av manquant pour la loi de Poisson

source: Missing p for Geometric law
fr_fr: p manquant pour la loi Géométrique

source: %s: Wrong value for input argument: Must be between '%s' and %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée : Doit être entre '%s' et %d.

source: Missing Av for exponential law
fr_fr: Av manquant pour la loi exponentielle

source: %s: Wrong value for input argument %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée %s.

source: Bad seeds for clcg2, must be integers with s1 in [1, 2147483562] and s2 in [1, 2147483398]
fr_fr: Souches erronées de clcg2, doit être des entiers avec s1 dans [1, 2147483562] et s2 dans [1, 2147483398]

source: bad seeds for clcg4, must be integers with s1 in [1, 2147483646] s2 in [1, 2147483542] s3 in [1, 2147483422] s4 in [1, 2147483322]
fr_fr: Souches erronées de clcg4, doit être des entiers avec s1 dans [1, 2147483646] s2 in [1, 2147483542] s3 in [1, 2147483422] s4 in [1, 2147483322]

source: WARNING: %s
fr_fr: ATTENTION : %s

source: be aware that you may have lost synchronization between the virtual generator %d and the others. use grand("setall", s1, s2, s3, s4) if you want to recover it.
fr_fr: Vous avez peut-être perdu la synchronisation entre le générateur virtuel %d et les autres. Utilisez grand("setall", s1, s2, s3, s4) pour la retrouver.

source: Bad seed for fsultra, must be integers in [0, 2^32-1]
fr_fr: Souche erronée de fsultra, doit être un entier dans l'intervalle [0, 2^32-1]

source: The first component of the fsultra state, must be an int in [0, %d]
fr_fr: La première composante de l'état fsultra doit être un entier dans l'intervalle [0, %d]

source: The second component of the fsultra state, must be 0 or 1
fr_fr: La seconde composante de l'état fsultra doit être 0 ou 1

source: The third component of the fsultra state, must be an int in [1, 2^32-1]
fr_fr: La troisième composante de l'état fsultra doit être un entier dans l'intervalle [1, 2^32-1]

source: Bad seeds for kiss, must be integers in [0,2^32-1]
fr_fr: Souches erronées de kiss, doivent être des entiers compris dans l'intervalle [0,2^32-1]

source: Bad seed for mt, must be an int in [0, 2^32-1]
fr_fr: Souche erronée de mt, doit être un entier dans l'intervalle [0, 2^32-1]

source: The first component of the mt state mt, must be an int in [1, 624]
fr_fr: La première composante de l'état mt, doit être un entier dans l'intervalle [1, 624]

source: Bad seed for urand, must be an int in [0, 2147483647]
fr_fr: Souche erronée de urand, doit être un entier dans l'intervalle [0, 2147483647]

source: Scilab randlib interface not installed.
fr_fr: L'interface randlib de Scilab n'est pas installée.

source: Simulation of a binomial random variable
fr_fr: Simulation d'une variable aléatoire binomiale

source: Theory
fr_fr: Théorie

source: Simulation of a discrete random variable
fr_fr: Simulation d'une variable aléatoire discrète

source: Simulation of a discrete uniform random variable
fr_fr: Simulation d'une variable aléatoire uniforme discrète

source: Simulation of a Erlang random variable
fr_fr: Simulation d'une variable aléatoire selon la loi de Erlang

source: Simulation of an exponential random variable
fr_fr: Simulation d'une variable aléatoire exponentielle.

source: p must be < 1
fr_fr: p doit être < 1

source: Simulation of a geometric random variable
fr_fr: Simulation d'une variable aléatoire géométrique

source: Simulation of a hyper geometric random variable
fr_fr: Simulation d'une variable aléatoire hypergéométrique

source: Simulation of a Poisson random variable
fr_fr: Simulation d'une variable aléatoire selon la loi de Poisson

source: Random
fr_fr: Aléatoire

source: binomial random variable
fr_fr: Variable aléatoire binomiale

source: discrete random variable
fr_fr: Variable aléatoire discrète

source: discrete uniform random variable
fr_fr: Variable aléatoire uniforme discrète

source: geometric random variable
fr_fr: Variable aléatoire géométrique

source: Poisson random variable
fr_fr: Variable aléatoire de Poisson

source: Exponential random variable
fr_fr: Variable aléatoire exponentielle

source: Weibull random variable
fr_fr: Variable aléatoire de Weibull

source: Hyper geometric random variable
fr_fr: Variable aléatoire hyper géométrique

source: Erlang random variable
fr_fr: Variable aléatoire de Erlang

source: Simulation of a Weibull random variable
fr_fr: Simulation d'une variable aléatoire selon la loi de Weibull
