Repository: scilab/scilab
Catalog: scilab/modules/gui/locales_macros/*.po
Languages: fr_fr

source: %s: #%d matching nodes.
fr_fr: %s: #%d noeuds correspondants.

source: %s: #%d matching parent nodes.
fr_fr: %s: n° %d noeuds parent correspondants.

source: %s: Invalid node.
fr_fr: %s: Noeud invalide.

source: %s: Invalid parent node.
fr_fr: %s: Noeud parent invalide.

source: %s: Invalid position ''%s''.
fr_fr: %s: Position invalide ''%s''.

source: %s: No matching node.
fr_fr: %s: Pas de noeud correspondant.

source: %s: Type %s is not implemented.
fr_fr: %s : Le type %s n''est pas encore implémenté.

source: %s: Wrong input arguments: %s or %s expected.
fr_fr: %s : Mauvais arguments d''entrée : %s ou %s attendu.

source: %s: Wrong input arguments: %s, %s or %s expected.
fr_fr: %s : Mauvais arguments d''entrée : %s, %s ou %s attendu.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : Au moins %d attendus.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d à %d attendus.

source: %s: Wrong size for %s: A real expected.
fr_fr: %s : Mauvaise dimension pour %s : Un réel attendu.

source: %s: Wrong size for %s: A row vector of strings expected.
fr_fr: %s : Mauvaise dimension pour %s : Un vecteur ligne de chaîne de caractères attendu.

source: %s: Wrong size for input argument #%d: A ''Figure'' handle or a real expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un handle de type ''Figure'' ou un réel attendu.

source: %s: Wrong type for %s: A list expected.
fr_fr: %s : Mauvais type pour %s : Une liste attendue.

source: %s: Wrong type for %s: A real expected.
fr_fr: %s : Mauvais type pour %s : Un réel attendu.

source: %s: Wrong type for %s: A row vector of strings expected.
fr_fr: %s : Mauvais type pour %s : Un vecteur ligne de chaîne de caractères attendu.

source: %s: Wrong type for %s: A string expected.
fr_fr: %s : Mauvais type pour %s : Une chaîne de caractères attendue.

source: %s: Wrong type for ''%s'' property: A string expected.
fr_fr: %s : Mauvais type pour la propriété ''%s'' : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d or #%d: String expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d ou %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A graphic handle or a real expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un handle graphique ou un réel attendu.

source: %s: Wrong type for input argument #%d: A list expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une liste attendue.

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un réel est attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: A two-item list expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une liste à deux éléments attendue.

source: %s: Wrong type for input argument #%d: Boolean expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Booléen attendu.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l''argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String or Tree expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Chaîne de caractères ou arbre attendu.

source: %s: Wrong type for input argument #%d: Tree expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Arbre attendu.

source: %s: Wrong type for input argument #%d: Tree or String expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Arbre ou chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: must be ''label'', ''icon'' or ''callback''.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: doit être ''label'', ''icon'' ou ''callback''.

source: %s: Wrong type for input arguments from #%d: Tree expected.
fr_fr: %s: Mauvais type pour les arguments d''entrée du n° %d: Arbre attendu.

source: %s: Wrong value for ''%s'' property: %d, %d or %d expected.
fr_fr: %s : Mauvaise valeur pour la propriété ''%s'' : %d, %d ou %d attendu.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : ''%s'', ''%s'' ou ''%s'' attendu.

source: %s: can not add a menu in console in this mode: %s.
fr_fr: %s: ne peux pas ajouter de menu dans la console dans ce mode: %s.

source: %s: can not add a menu in this mode: %s.
fr_fr: %s: ne peux pas ajouter de menu dans ce mode: %s.

source: %s: function not available in NWNI mode.
fr_fr: %s : fonction non disponible en mode NWNI.

source: &Edit
fr_fr: &Edition

source: &File
fr_fr: &Fichier

source: &Tools
fr_fr: &Outils

source: <Enter color name here>
fr_fr: <Entrer le nom de la couleur ici>

source: About Scilab...
fr_fr: A propos de Scilab...

source: Acknowledgements
fr_fr: Remerciements

source: Add color in listbox
fr_fr: Ajouter une couleur dans listbox

source: Answer given for %s has incorrect type %s.
fr_fr: La réponse donnée pour %s a un type incorrect %s.

source: Answer given for %s has invalid dimension: waiting for dimension %s.
fr_fr: La réponse donnée pour %s n''a pas la bonne dimension : dimension attendue %s.

source: Answer given for %s is incorrect see error message in scilab window.
fr_fr: La réponse donnée pour %s est incorrecte, voir le message d''erreur dans la fenêtre scilab.

source: Authors: Scilab Consortium / INRIA / ENPC / Contributors
fr_fr: Auteurs : Consortium Scilab / INRIA / ENPC / Contributeurs

source: Close
fr_fr: Fermer

source: Colors list edition
fr_fr: Edition de la liste de couleurs

source: Control Plot3d
fr_fr: Contrôles Plot3d

source: Display selection
fr_fr: Afficher la sélection

source: Do you really want to quit Scilab?
fr_fr: Voulez-vous réellement quitter Scilab ?

source: Error
fr_fr: Erreur

source: Exit figure
fr_fr: Sortir de la figure

source: File
fr_fr: Fichier

source: GUI
fr_fr: Interface graphique

source: Launch plot2d
fr_fr: Lancer plot2d

source: Launch plot3d
fr_fr: Lancer plot3d

source: Menu ''%s'' is %s.
fr_fr: Menu ''%s'' est %s.

source: No
fr_fr: Non

source: No color selected.
fr_fr: Aucune couleur sélectionnée.

source: Please enter a color name first.
fr_fr: Entrer un nom de couleur d''abord SVP

source: Popupmenu selection
fr_fr: Sélection popupmenu

source: Quit Scilab
fr_fr: Quitter Scilab

source: Quit demonstration
fr_fr: Quitter la démonstration

source: Scilab 5.0 and future versions are released under the terms of the CeCILL license.
fr_fr: Scilab 5.0 et les futures versions sont diffusées sous les termes de la licence CeCILL.

source: Scilab Contributors...
fr_fr: Contributeurs de Scilab

source: Scilab Graphics
fr_fr: Graphiques Scilab

source: Selected colors
fr_fr: Couleurs sélectionnées

source: Selected colors are: %s.
fr_fr: Les couleurs sélectionnées sont: %s.

source: Selected menu
fr_fr: Menu sélectionné

source: Slider demo
fr_fr: Démo Slider

source: Slider value:
fr_fr: Valeur du slider:

source: Some Scilab modules are released under the GPLv2 license.
fr_fr: Certains modules de Scilab sont distribués sous licence GPLv2.

source: Sub-menu 1
fr_fr: Sous-menu 1

source: Sub-menu 2
fr_fr: Sous-menu 2

source: Sub-menu 2-1
fr_fr: Sous-menu 2-1

source: Sub-menu 2-2
fr_fr: Sous-menu 2-2

source: Uicontrols demo
fr_fr: Démo Uicontrol

source: Uicontrols demo with LaTeX
fr_fr: Démonstration Uicontrol avec LaTeX

source: Yes
fr_fr: Oui

source: You clicked on menu ''%s''.
fr_fr: Vous avez cliqué sur le menu ''%s''.

source: You selected ''%s''.
fr_fr: Vous avez sélectionné ''%s''.

source: blue
fr_fr: bleu

source: checked
fr_fr: coché

source: createPopupItems: found an empty cascading menu.
fr_fr: createPopupItems : un menu déroulant vide a été trouvé.

source: green
fr_fr: vert

source: red
fr_fr: rouge

source: unchecked
fr_fr: non coché

source: yellow
fr_fr: jaune
