Repository: scilab/scilab
Catalog: scilab/modules/shell/locales/*.po
Languages: pl_pl

source: %s: Not implemented in this mode.
pl_pl: %s: Nie zrealizowane w tym trybie.

source: %s: This feature has not been implemented in this mode.
pl_pl: %s: Ta funkcja nie została zrealizowana w tym trybie.

source: %s: This feature has not been implemented.
pl_pl: %s: Ta funkcja nie została zrealizowana.

source: %s: Wrong number of output argument(s).
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego).

source: %s: Wrong size for input argument #%d: A string expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wartości typu string.

source: %s: Wrong type for input argument #%d: A string expected.
pl_pl: %s: Zły typ parametru wejściowego %d: Oczekiwano wartości typu string.

source: %s: Wrong type for input argument #%d: Matrix expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano macierzy.

source: %s: Wrong value for input argument #%d.
pl_pl: %s: Zła wartość parametru wejściowego #%d.

source: File or Directory
pl_pl: Plik lub Katalog

source: Graphics handle field
pl_pl: Okno graficzne

source: Scilab Command
pl_pl: Polecenie programu Scilab

source: Scilab Function
pl_pl: Funkcia programu Scilab

source: Scilab Macro
pl_pl: Polecenie Makro programu Scilab

source: Scilab Variable
pl_pl: Zmienna programu Scilab

source: Type '%s' or '%s' to return to standard level prompt.
pl_pl: Naciśnij '%s' lub '%s' by powrócić do standardowego poziomu wiersza.

source: [Continue display? n (no) to stop, any other key to continue]
pl_pl: [Kontynuować wyświetlanie? n (nie) aby zatrzymać, inny klawisz aby kontynuować]
