Repository: scilab/scilab
Catalog: scilab/modules/core/locales/*/core.po
Languages: pt_br, ru_ru

source: Error: Not a valid gateway file %s (should start with <GATEWAY> and contain <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)
pt_br: Erro: Não é um arquivo de portão válido %s (deveria começar com <GATEWAY> e conter <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)

source: Error: Not a valid gateway file %s (encoding not 'utf-8') Encoding '%s' found
pt_br: Erro: Não é um arquivo de portão válido %s (a codificação nãoe é 'utf-8'). A codificação '%s' foi encontrada

source: List full.
pt_br: Lista cheia.

source: Unexpected opcode, please report into the Scilab bug tracker.
pt_br: Código de operador inesperado, por favor, reporte ao rastreador de bugs do Scilab.

source: Functions compiled with very old versions are no more handled.
pt_br: As funções compiladas com versões muito velhas não serão mais manipuladas.

source: Can't go to directory %s.
pt_br: Não se consegue ir ao diretório %s.

source: Invalid buffer.
pt_br: Buffer inválido.

source: Unknown error.
pt_br: Erro desconhecido.

source: Can't get current directory.
pt_br: Não se consegue obter o diretório corrente.
ru_ru: Не удалось получить текущий каталог.

source: No space to allocate Scilab stack.
pt_br: Não há espaço para alocar a pilha do Scilab.
ru_ru: Недостаточно места для размещения стека Scilab.

source: %s: argument %d should be a list of size at least %d.
pt_br: %s: O argumento %d deveria ser uma lista com tamanho a partir de %d.
ru_ru: %s: аргумент %d должен быть списком с размером как минимум %d.

source: %s: Wrong type for argument %d: Real matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de reais.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица вещественных чисел.

source: %s: Wrong size for argument %d: (%d,%d) expected.
pt_br: %s: Tamanho errado para o argumento %d: Esperava-se (%d,%d).
ru_ru: %s: Неверный размер аргумента %d: Ожидался размер (%d,%d).

source: %s: Wrong type for argument %d (List element: %d): Real or complex matrix expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de reais ou complexos.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась матрица вещественных или комплексных чисел.

source: %s: Wrong type for argument %d: Real or complex matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de reais ou complexos.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица вещественных или комплексных чисел.

source: %s: Wrong type for argument %d: List of size at least %d expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma lista com tamanho a partir de %d.
ru_ru: %s: Неверный тип аргумента %d: Ожидался список размером как минимум %d.

source: %s: Wrong type for argument %d (List element: %d): Int matrix expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de inteiros.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась целочисленная матрица.

source: %s: Wrong size for argument %d: At least %d expected.
pt_br: %s: Tamanho errado para o argumento %d: Esperava-se pelo menos %d.
ru_ru: %s: Неверный размер аргумента %d: Ожидалось как минимум %d.

source: %s: Wrong type for argument %d (List element: %d): Boolean matrix expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de booleanos
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась матрица логических значений.

source: %s: Wrong type for argument %d: Boolean matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de booleanos.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица логических значений.

source: %s: Wrong type for argument %d (List element: %d): Sparse matrix expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz esparsa.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась разреженная матрица.

source: %s: Wrong type for argument %d: Sparse matrix expected.
pt_br: %s: Tipo errado para o argumento de entrada %d: Esperava-se uma matriz esparsa.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась разреженная матрица.

source: %s: Wrong type for argument %d (List element: %d): Vector expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se um vetor.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидался вектор.

source: %s: Wrong type for argument %d: Vector expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um vetor
ru_ru: %s: Неверный тип аргумента %d: Ожидался вектор.

source: %s: Wrong type for argument %d: Real vector expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um vetor de reais.
ru_ru: %s: Неверный тип аргумента %d: Ожидался вещественный вектор.

source: %s: Wrong size for argument %d: %d expected.
pt_br: %s: Tamanho errado para o argumento %d: Esperava-se %d.
ru_ru: %s: Неверный размер аргумента %d: Ожидался размер %d.

source: %s: Wrong type for argument %d (List element: %d): Scalar expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se um escalar.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась скалярная величина.

source: %s: Wrong type for argument %d: Scalar, '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um escalar, '%s' ou '%s'.
ru_ru: %s: Неверный тип аргумента %d: Ожадалась скалярная величина, '%s' или '%s'.

source: %s: Wrong type for argument %d (List element: %d): Matrix of strings expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de strings
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась матрица или строки.

source: %s: Wrong type for argument %d: Matrix of strings expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de strings.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица строк.

source: %s: Wrong type for argument %d (List element: %d): String matrix expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de strings.

source: %s: Wrong type for argument %d: String matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de strings.

source: %s: Wrong type for argument %d: Polynomial matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de polinômios
ru_ru: %s: Неверный тип аргумента %d: Ожидалась полиномиальная матрица.

source: %s: Wrong type for argument %d : Polygon expected.
pt_br: %s: Tipo errado para o argumento %d : Esperava-se um polígono.
ru_ru: %s: Неверный тип аргумента %d : Ожидался многоугольник.

source: %s: Wrong type for argument %d: Working int matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de inteiros operacional.

source: %s: Wrong type for argument %d (List element: %d): Row vector expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se um vetor-linha.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидался вектор-строка.

source: %s: Wrong type for argument %d: Row vector expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um vetor-linha.
ru_ru: %s: Неверный тип аргумента %d: Ожидался вектор-строка.

source: %s: argument %d >(%d) should be a column vector.
pt_br: %s: O argumento %d >(%d) deveria ser um vetor coluna.
ru_ru: %s: аргумент %d >(%d) должен быть вектором-столбцом.

source: %s: Wrong type for argument %d: Column vector expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um vetor-coluna.
ru_ru: %s: Неверный тип аргумента %d: Ожидался вектор-столбец.

source: %s: Wrong type for argument %d (List element: %d): Boxed pointer expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se um ponteiro em caixa.
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидался ограниченный указатель (Boxed pointer).

source: %s: Wrong type for argument %d: Boxed pointer expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se um ponteiro em caixa.
ru_ru: %s: Неверный тип аргумента %d: Ожидался ограниченный указатель (Boxed pointer).

source: %s: Wrong type for argument %d: Matrix expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица.

source: %s: entry point %s not found in predefined tables or link table.
pt_br: %s: Ponto de entrada %s não encontrado nas tabelas predefinidos ou na tabela de links.
ru_ru: %s: Точка входа %s не найдена в предопределённых таблицах и таблице ссылок.

source: %s: Wrong type for argument %d: Function or string (external function) expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma função ou um string (função externa).
ru_ru: %s: Неверный тип аргумента %d: Ожидалась функция или строка (внешняя функция).

source: %s: Incompatible sizes.
pt_br: %s: Tamanhos incompatíveis.
ru_ru: %s: Несовместимые размеры.

source: %s: Optional argument %d not given and default value %s not found.
pt_br: %s: O argumento opcional %d não foi fornecido e o valor padrão %s não foi encontrado.
ru_ru: %s: Необязательный аргумент %d не задан и значение по умолчанию %s не найдено.

source: %f: No more space to store string arguments.
pt_br: %f: Não há mais espaço para armazenar argumentos strings.
ru_ru: %f: Закончилось место для хранения строковых аргументов.

source: %s: Wrong type for argument %d (List element: %d): Matrix of handle expected.
pt_br: %s: Tipo errado para o argumento %d (Elemento da lista: %d): Esperava-se uma matriz de manipuladores
ru_ru: %s: Неверный тип аргумента %d (Элемент списка: %d): Ожидалась матрица или дескриптор.

source: %s: Wrong type for argument %d: Matrix of handle expected.
pt_br: %s: Tipo errado para o argumento %d: Esperava-se uma matriz de manipuladores.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась матрица или дескриптор.

source: %s: Wrong number of input argument(s): %d expected.
pt_br: %s: Quantidade incorreta de argumentos de entrada: Esperava-se %d.

source: %s: Wrong number of input argument(s): %d to %d expected.
pt_br: %s: Número incorreto de argumentos de entrada: Esperava-se de %d a %d.

source: %s: Wrong number of output argument(s): %d expected.
pt_br: %s: Quantidade errada de argumento(s) de saída: Esperava-se %d.

source: %s: Wrong number of output argument(s): %d to %d expected.
pt_br: %s: Número errado de argumentos de saída: Esperava-se de %d a %d.

source: %s: argument %d > (%d) should be a complex matrix.
pt_br: %s: O argumento %d > (%d) deveria ser uma matriz de complexos.
ru_ru: %s: аргумент %d > (%d) должен быть матрицей комплексных чисел.

source: built in
pt_br: embutido
ru_ru: встроенная

source: Invalid time domain.
pt_br: O domínio de tempo é inválido.
ru_ru: Неправильный временной промежуток.

source: Invalid %c,%c matrices.
pt_br: Matrizes %c,%c inválidas.
ru_ru: Неправильные %c,%c матрицы.

source: %s argument
pt_br: Argumento %s
ru_ru: аргумент %s

source: %s and %s arguments
pt_br: Argumentos %s e %s
ru_ru: аргументы %s и %s

source: %s argument and argument %d
pt_br: Argumento %s e argumento %d
ru_ru: аргумент %s и аргумент номер %d

source: %s: %s has wrong %s dimension (%d), expecting (%d).
pt_br: %s: %s possui dimensão %s errada (%d), esperando-se (%d).
ru_ru: %s: %s имеет неправильное %s измерение (%d), ожидалось (%d).

source: %s: argument %d(%d) has wrong %s dimension (%d), expecting (%d).
pt_br: %s: O argumento %d(%d) possui dimensão %s errada (%d), esperando-se (%d).
ru_ru: %s: аргумент %d(%d) имеет неправильное %s измерение (%d), ожидалось (%d).

source: Cannot find Windows temporary directory.
pt_br: Não se consegue achar o diretório temporário do Windows.

source: Scilab version "%d.%d.%d.%d"
pt_br: Versão Scilab "%d.%d.%d.%d"
ru_ru: Scilab версии "%d.%d.%d.%d"

source: Scilab version "%d.%d.%d.%d" %s
pt_br: Versão Scilab "%d.%d.%d.%d" %s
ru_ru: Scilab версии "%d.%d.%d.%d" %s

source: Scilab Version Info.
pt_br: Informações sobre a versão Scilab.
ru_ru: О версии Scilab.

source: toolboxes
ru_ru: панели интсрументов

source: %s: Wrong value for first input argument: ''%s'' or ''%s'' expected.
ru_ru: %s:Неверный тип первого аргумента: Ожидалось ''%s'' или ''%s''.

source: only for Microsoft Windows.
ru_ru: только для Microsoft Windows.

source: %s: Wrong type for input argument: String expected.
ru_ru: %s: Неверный тип аргумента: Ожидалась строка.

source: %s: Wrong second input argument: Path to a scilab script file expected.
ru_ru: %s: Неверный второй аргумент: Ожидался путь к скрипту scilab.

source: %s called at line %s of exec_file
ru_ru: %s вызван в строке %s exec_file

source: %s called at line %s of execstr instruction.
ru_ru: %s вызван в строке %s инструкции execstr.

source: %s called under pause
ru_ru: %s вызван из-под паузы

source: %s: Wrong number of input argument: %d expected.
ru_ru: %s: Неверное количество аргументов: Ожидалось %d.

source: %s: Wrong number of input arguments: %d to %d expected.
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.

source: %s: Wrong number of output arguments: %d to %d expected.
ru_ru: %s: Неверное количество выходных аргументов: Ожидалось от %d до %d.

source: %s: Wrong type for argument %d: Mmatrix expected.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась Mmatrix.

source: Unexpected opcode, please report
ru_ru: Неожиданный opcode, пожалуйста, сообщите разработчикам об ошибке

source: Functions compiled with very old versions are no more handled
ru_ru: Функции скомпилированные очень старыми версиями больше не поддерживаются

source: Error : Not a valid gateway file %s (should start with <GATEWAY> and contain <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)
ru_ru: Ошибка: %s не является корректным файлом шлюза (он должен начинаться с <GATEWAY> и содержать <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)

source: Error : Not a valid gateway file %s (encoding not 'utf-8') Encoding '%s' found
ru_ru: Ошибка: Файл %s не является корректным файлом шлюза (кодировка не 'utf-8') Кодировка файла '%s'

source: list full.
ru_ru: список заполнен.

source: Type 'resume' or 'abort' to return to standard level prompt.
ru_ru: Введите 'resume' или 'abort' для возврата на стандартный уровень командной строки.

source: %s: Wrong input argument: Named variable expected.
ru_ru: %s: Неверный аргумент: Ожидалась именованная переменная.

source: %s: Wrong type for input argument: Compiled macro expected.
ru_ru: %s: Неверный тип аргумента: Ожидался откомпилированный макрос.

source: %s: Out of code
ru_ru: %s: За пределами кода

source: %s: Wrong Top value %d instead of %d
ru_ru: %s: Неверное значение Top %d вместо %d

source: %s: old version of if and while not yet implemented.
ru_ru: %s: старые версии if и while ещё не реализованы.

source: %s: unknown operator %d.
ru_ru: %s: неизвестный оператор %d.

source: %s: wrong fromwhat value %s
ru_ru: %s: неверное значение 'fromwhat' %s

source: %s: Wrong fromwhat value %s
ru_ru: %s: неверное значение 'fromwhat' %s

source: Error : Not a valid version file %s (should start with <MODULE_VERSION> and contains <VERSION major='' minor='' maintenance='' revision='' string=''>)
ru_ru: Ошибка : Файл %s не является корректным файлом версии (должен начинаться с <MODULE_VERSION> и содержать <VERSION major='' minor='' maintenance='' revision='' string=''>)

source: Error : Not a valid version file %s (encoding not 'utf-8') Encoding '%s' found
ru_ru: Error : Файл %s не является корректным файлом версии (кодировка не 'utf-8') Кодировка файла '%s'

source: %s: Wrong type for argument %d: Working integer matrix expected.
ru_ru: %s: Неверный тип аргумента %d: Ожидалась корректная целочисленная матрица (Working integer matrix).

source: Can't go to directory %s .
ru_ru: Не удалось войти в каталог %s .

source: Cannot load the module declaration file : %s.
ru_ru: Не удалось загрузить файл определения модуля : %s.

source: The SCI environment variable is not set
ru_ru: Переменная окружения SCI не установлена

source: Error : Not a valid module file %s (encoding not 'utf-8') Encoding '%s' found
ru_ru: Ошибка : Файл %s не является корректным файлом модуля (кодировка не 'utf-8'). Кодировка файла '%s'

source: !!! WARNING !!!
ru_ru: !!! ВНИМАНИЕ !!!

source: This software is being provided "as is", without any express or implied warranty.
ru_ru: Данное программное обеспечение расспространяется "как есть". Никаких гарантий не предоставляется и не подразумевается.

source: This is a development and not at all a final or stable version of Scilab 5.0 that will be released in the future. A lot of features are missing and buggy.
ru_ru: Эта версия для разработчиков, она не является окончательной или стабильной версией Scilab 5.0. Стабильная версия будет выпущена позже. Многие возможности отсутствуют или содержат ошибки.

source: In no event will the authors be held liable for any damages arising from, out of or in connection with the software or the use or other dealings in the software.
ru_ru: Авторы не несут ответственности за любой ущерб причинённый этим ПО или связанный с использованием этого ПО.

source: Warning: the operational team of the Scilab Consortium doesn't provide and doesn't support the port of Scilab to MacOS.
ru_ru: Внимание: основная команда Scilab Consortium не распространяет и не поддерживает порт Scilab на MacOS.

source: Fatal Error : Can't create table for scilab functions.
ru_ru: Критическая ошибка : Не удалось создать таблицу функций scilab.

source: %s: Wrong value for first input argument: Scalar, '%s' or '%s' expected.
ru_ru: %s: Неверное значение первого аргумента: Ожидалось число, '%s' или '%s'.

source: %s: Wrong type for first input argument: Scalar, '%s' or '%s'.
ru_ru: %s: Неверный тип первого аргумента: Ожидалось число, '%s' или '%s'.

source: %s: Wrong type of first input argument: String expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидалась строка.

source: %s: Wrong value for first input argument: '%s', '%s', '%s' or '%s' expected.
ru_ru: %s: Неверное значение первого аргумента: Ожидалось '%s', '%s', '%s' или '%s'.

source: %s: Wrong value for first input argument: '%s', '%s', '%s' or '%s'.
ru_ru: %s: Неверное значение первого аргумента: '%s', '%s', '%s' или '%s'.

source: %s: Wrong value for second input argument: '%s' expected.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось '%s'.

source: %s: Wrong value for first input argument: '%s', '%s' or '%s'.
ru_ru: %s: Неверное значение первого аргумента: '%s', '%s' или '%s'.

source: %s: Wrong value for first input argument: '%s', '%s', '%s' and second input argument must be '%s'.
ru_ru: %s: Неверное значение первого аргумента: '%s', '%s', '%s', а второй аргумент должен быть '%s'.

source: %s: Wrong value for second input argument: Must be > %d.
ru_ru: %s: Неверное значение второго аргумента: Должно быть > %d.

source: %s: Wrong type for input arguments.
ru_ru: %s: Неверные типы аргументов.

source: WARNING : %s
ru_ru: ВНИМАНИЕ : %s

source: %s: Wrong type for first input argument: String expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидалась строка.

source: %s: Wrong type for first input argument: Scalar, '%s' or '%s' expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидалось число, '%s' или '%s'.

source: %s: Wrong type for first argument: Scalar, '%s' or '%s' expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидалось число, '%s' или '%s'.

source: %s: Wrong type for second input argument: String expected.
ru_ru: %s: Неверный тип второго аргумента: Ожидалась строка.

source: %s: Wrong type for input arguments: Strings expected.
ru_ru: %s: Неверны типы аргументов: Ожидались строки.

source: %s: Wrong input argument.
ru_ru: %s: Неверный аргумент.

source: %s: Wrong value for first input argument: '%s' or '%s' expected.
ru_ru: %s: Неверное значение первого аргумента: Ожидалось '%s' или '%s'.

source: Internal Functions:
ru_ru: Встроенные функции:

source: Commands:
ru_ru: Команды:

source: Warning : Problems with %s.
ru_ru: Внимание : Проблемы с %s.

source: File
ru_ru: Файл

source: Edit
ru_ru: Правка

source: Preferences
ru_ru: Параметры

source: Control
ru_ru: Управление

source: Applications
ru_ru: Программы
