Repository: scilab/scilab
Catalog: scilab/modules/core/locales/*/core.po
Languages: pt_br, ru_ru

source: %s: The file %s does not exist.
pt_br: %s: O arquivo %s não existe.
ru_ru: %s: Файл %s не существует.

source: %s: Unable to find Perl file: %s
pt_br: %s: Incapaz de localizar arquivo Perl: %s
ru_ru: %s: Файл Perl не найден: %s

source: %s: Wrong type for input argument #%d: Strings expected.
pt_br: %s: Tipo errado para argumento de entrada #%d: era esperado um texto.
ru_ru: %s: Неверный тип аргумента #%d: Ожидалась строка.

source: %s: No perl command specified.
pt_br: %s: Nenhum comando perl foi especificado.
ru_ru: %s: Команда perl не была задана.

source: %s: Unable to find Perl in ''%s''
pt_br: %s: Incapaz de localizar Perl em "%s"
ru_ru: %s: Perl не найден в '%s''

source: %s: Unable to find Perl.
pt_br: %s: Incapaz de localizar Perl.
ru_ru: %s: Perl не найден.

source: %s: System error: Command executed: %s
pt_br: %s: Erro de sistema: Comando executado: %s
ru_ru: %s: Системная ошибка: Запущена комманда: %s

source: %s: Wrong number of input arguments: At least %d expected.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se pelo menos %d.
ru_ru: %s: Неверное количество аргументов: Ожидалось как минимум %d.

source: Obsolete: Define SCIHOME and HOME before to launch Scilab.
pt_br: Obsoleto: Defina SCIHOME e HOME antes de executar o Scilab.
ru_ru: Устарело: Установите SCIHOME и HOME для запуска Scilab.

source: is already compiled.
pt_br: já está compilado.
ru_ru: уже откомилирован.

source: User variables are:
pt_br: As variáveis de usuário são:
ru_ru: Пользовательские пременные:

source: %s: Wrong number of input arguments: %d or %d expected.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se %d ou %d.
ru_ru: %s: Неверное количество аргументов: Ожидалось %d или %d.

source: %s: Wrong number of output arguments: %d expected.
pt_br: %s: Quantidade errada de argumentos de saída: Esperava-se %d.
ru_ru: %s: Неверное количество выходных аргументов: Ожидалось %d.

source: Error
pt_br: Erro
ru_ru: Ошибка

source: SIGSTP: aborting current computation
pt_br: SIGSTP: abortando a computação atual
ru_ru: SIGSTP: отменяется текущее вычисление

source: Trying to stop scilab in the middle of an interface.
pt_br: Tentando parar o Scilab no meio de uma interface.
ru_ru: Попытка остановить scilab в середине интерфейса.

source: Do you really want to abort computation (y or n ?)
pt_br: Deseja mesmo abortar a computação (y ou n) ?
ru_ru: Вы уверены, что вы хотите отменить вычисление ( y или n ?)

source: %s: No more memory.
pt_br: %s: Memória esgotada.
ru_ru: %s: Не осталось доступной памяти.

source: Error: could not parse file %s
pt_br: Erro: não foi possível interpretar o arquivo %s
ru_ru: Ошибка: не удалось разобрать файл %s

source: Error returning tlist, memory full.
pt_br: Erro ao retornar tlist; memória esgotada.
ru_ru: Ошибка возврата tlist, память заполнена.

source: tlist not completely filled.
pt_br: tlist não foi preenchido completamente.
ru_ru: tlist заполнен не до конца.

source: %s: Too many names.
pt_br: %s: Muitos nomes.
ru_ru: %s: Слишком много имён.

source: %s: Wrong type for argument %d: List expected.
pt_br: %s: Tipo errado para o argumento #%d: Esperava-se uma lista.
ru_ru: %s: Неверный тип аргумента %d: Ожидался список (List).

source: %s: Optional arguments name=val must be at the end.
pt_br: %s: Argumentos opcionais nome=valor devem ficar no final.
ru_ru: %s: Необязательные аргументы name=val должны быть в конце.

source: %s: Unrecognized optional arguments %s.
pt_br: %s: Argumentos opcionais desconhecidos: %s.
ru_ru: %s: Не распознанные необязательные аргументы %s.

source: Optional argument list is empty.
pt_br: A lista de argumentos opcionais está vazia.
ru_ru: Список необязательных аргументов пуст.

source: Optional arguments list:
pt_br: Lista de argumentos opcionais:
ru_ru: Необязательные аргументы:

source: and %s.
pt_br: e %s.
ru_ru: и %s.

source: %s: bad call to %s! (1rst argument).
pt_br: %s: chamada inválida para %s! (primeiro argumento)
ru_ru: %s: неправильный вызов %s! (1-й аргумент).

source: %s: (%s) too many arguments in the stack edit stack.h and enlarge intersiz.
pt_br: %s: (%s) muitos argumentos na pilha. Edite stack.h e aumente o valor de intersiz.
ru_ru: %s: (%s) слишком много аргументов в стеке. Отредактируйте stack.h и увеличьте intersiz.

source: %s: (%s) bad third argument!
pt_br: %s: (%s) o terceiro argumento é inválido!
ru_ru: %s: (%s) плохой третий аргумент!

source: %s: Wrong type for argument: Complex expected.
pt_br: %s: Tipo errado para o argumento: Esperava-se um número complexo.
ru_ru: %s: Неверный тип аргумента: Ожидалось комплексное число (Complex).

source: %s: bad call to %s!
pt_br: %s: Chamada inválida para %s!
ru_ru: %s: неправильный вызов %s!

source: %s: bad call to %s (third argument %c).
pt_br: %s: Chamada inválida para %s (terceiro argumento %c).
ru_ru: %s: неправильный вызов %s (третий аргумент %c).

source: %s: (%s) bad second argument!
pt_br: %s: (%s) O segundo argumento é inválido!
ru_ru: %s: (%s) неправильный второй аргумент!

source: %s: createcvarfromptr: too many arguments on the stack, enlarge intersiz.
pt_br: %s: createcvarfromptr: argumentos em excesso na pilha, aumente o valor de intersiz.
ru_ru: %s: createcvarfromptr: слишком много аргументов в стеке, увеличьте intersiz.

source: %s: Recursion problems. Sorry ...
pt_br: %s: Problemas de recursão. Desculpe-nos...
ru_ru: %s: Проблемы рекурсии. Простите ...

source: %s: %s is not a Scilab function.
pt_br: %s: %s não é uma função do Scilab.
ru_ru: %s: %s не является функцией Scilab.

source: Invalid system.
pt_br: Sistema inválido.
ru_ru: Неправильная система.

source: A non square matrix!
pt_br: Não é uma matriz quadrada!
ru_ru: Матрица не является квадратной!

source: %s: internal error, info=%d.
pt_br: %s: Erro interno, info=%d.
ru_ru: %s: внутренняя ошибка, info=%d.

source: %s: intersiz is too small.
pt_br: %s: O valor de intersiz é muito pequeno.
ru_ru: %s: intersiz слишком мал.

source: argument number %d
pt_br: argumento número %d
ru_ru: аргумент номер %d

source: arguments %d and %d
pt_br: argumentos %d e %d
ru_ru: аргументы с номерами %d и %d

source: should be square
pt_br: deveria ser quadrada
ru_ru: должен быть квадратной матрицей

source: should be a vector
pt_br: deveria ser um vetor
ru_ru: должен быть вектором

source: should be a row vector
pt_br: deveria ser um vetor linha
ru_ru: должен быть вектором-строкой

source: should be a column vector
pt_br: deveria ser um vetor coluna
ru_ru: должен быть вектором-столбцом

source: should be a scalar
pt_br: deveria ser um escalar
ru_ru: должен быть числом

source: %s: %s has wrong dimensions (%d,%d), expecting (%d,%d).
pt_br: %s: %s tem dimensões erradas (%d,%d); esperava-se (%d,%d).
ru_ru: %s: %s имеет неправильный размер (%d,%d), ожидался (%d,%d).

source: first
pt_br: primeiro
ru_ru: первое

source: second
pt_br: segundo
ru_ru: второе

source: %s: %s has wrong length %d, expecting (%d).
pt_br: %s: %s tem o comprimento errado: %d; esperava-se %d.
ru_ru: %s: %s имеет неправильную длину %d, ожидалась (%d).

source: %s: %s have incompatible dimensions (%dx%d) # (%dx%d)
pt_br: %s: %s tem dimensões incompatíveis (%dx%d) # (%dx%d)
ru_ru: %s: размерность %s несовместима (%dx%d) # (%dx%d)

source: %s: %s have incompatible dimensions.
pt_br: %s: %s tem dimensões incompatíveis.
ru_ru: %s: размерность %s несовместима.

source: %s: %s should be a list with %d-element being %s.
pt_br: %s: %s deveria ser uma lista com o %d° elemento sendo %s.
ru_ru: %s: %s должен быть списком с %d-м элементом %s.

source: square
pt_br: quadrada
ru_ru: квадратная матрица

source: a vector
pt_br: um vetor
ru_ru: вектор

source: a row vector
pt_br: um vetor linha
ru_ru: вектор-строка

source: a column vector
pt_br: um vetor coluna
ru_ru: вектор-столбец

source: a scalar
pt_br: um escalar
ru_ru: число

source: GetDataFromName: variable %s not found.
pt_br: GetDataFromName: A variável %s não foi encontrada.
ru_ru: GetDataFromName: переменная %s не найдена.

source: %s: Variable %s not found.
pt_br: %s: A variável %s não foi encontrada.
ru_ru: %s: Переменная %s не найдена.

source: Undefined variable %s.
pt_br: Variável indefinida %s.
ru_ru: Неопределённая переменная %s.

source: %s: argument must be a string.
pt_br: %s: O argumento tem que ser um texto.
ru_ru: %s: аргумент должен быть строкой.

source: Impossible to create : %s
pt_br: Impossível criar: %s
ru_ru: Невозможно создать %s

source: Startup execution:
pt_br: Execução de inicialização:
ru_ru: Запуск программы:

source: loading initial environment
pt_br: carregando ambiente inicial
ru_ru: загрузка исходного окружения

source: &File
pt_br: &Arquivo

source: &Edit
pt_br: &Editar

source: &Preferences
pt_br: &Preferências

source: &Control
pt_br: &Controle

source: &Applications
pt_br: &Aplicativos

source: &Toolboxes
pt_br: &Caixa de ferramentas

source: results may be inaccurate. rcond = %s1
pt_br: resultados podem ser imprecisos. rcond = %s1
ru_ru: результаты могут быть неточны. rcond = %s1

source: %s: Wrong input argument #%d: Path to a scilab script file expected.
pt_br: %s: Argumento de entrada errado #%d: Esperava-se o caminho para um script do Scilab.

source: Checking: %s
pt_br: Verificando: %s

source: %s: Please check: %s.
pt_br: %s: Por favor, verifique: %s.

source: %s: File doesn''t exist: %s
pt_br: %s: Arquivo não existe: %s

source: %s: Requires Scipad.
pt_br: %s: Requer Scipad.

source: %s: Wrong number of input argument(s): At least %d expected.
pt_br: %s: Quantidade errada de argumento(s) de entrada: Esperava-se pelo menos %d.

source: %s: %s is a uneditable hard coded function.
pt_br: %s: %s é uma função hard coded não editável.

source: Error(s) : see help powershell'';''verify your script without scilab.
pt_br: Erro(s) : ver a ajuda powershell'';'' verifique o seu script sem o Scilab.
ru_ru: Есть ошибки : прочитайте документацию по powershell'';''проверьте свой скрипт без scilab.

source: Only for Microsoft Windows.
pt_br: Apenas para Microsoft Windows.

source: Powershell not found.
pt_br: Powershell não encontrado.
ru_ru: Powershell не найден.

source: %s: Wrong type for input argument #%d: String expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um texto.

source: %s: Wrong value for input argument #%d: Defined variable expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se uma variável definida.

source: %s called at line %s of %s
pt_br: %s chamado na linha %s of %s

source: %s called at line %s of %s instruction.
pt_br: %s chamado na linha %s da instrução %s.

source: %s called under %s
pt_br: %s chamado sob %s

source: %s called at line %s of macro %s
pt_br: %s chamado na linha %s da macro %s
ru_ru: %s вызван в строке %s макроса %s

source: Using %s elements ouf of %s
pt_br: Usando %s elementos de %s
ru_ru: Используется %s элементов из %s

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s''' ou ''%s'.

source: %s: Wrong size for input argument #%d: A string expected.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um texto.

source: %s: Wrong value for input argument #%d: Value greater than 0 expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um valor maior do que 0.

source: %s: Wrong size for input argument #%d: A scalar expected.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong type for input argument #%d.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument.
pt_br: %s: Tipo errado para o argumento de entrada.

source: %s: Wrong values for input argument #%d: '%s' or '%s' expected.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: %s: Wrong values for input argument #%d: A int expected.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se um int.

source: %s: Wrong values for input argument #%d: Must be in the interval [%d, %d].
pt_br: %s: Valores errados para o argumento de entrada #%d: Deve estar no intervalo [%d, %d].

source: %s: Wrong type for input argument #%d: A string or a scalar expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um texto ou um escalar.

source: %s: Wrong value for input argument #%d: '0' or '1' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '0' ou '1'.

source: %s: Wrong value for input argument #%d: A int expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um inteiro.

source: %s: Wrong value for input argument #%d: Must be in the interval [%d, %d].
pt_br: %s: Valor errado para o argumento de entrada #%d: Tem que estar no intervalo [%d, %d].

source: %s: Wrong size for inputs arguments.
pt_br: %s: Tamanho errado para os argumentos de entrada.

source: %s: Wrong type for inputs arguments.
pt_br: %s: Tipo errado para os argumentos de entrada.

source: %s: An error occurred.
pt_br: %s: Ocorreu um erro.
ru_ru: %s: Произошла ошибка.

source: %s: Wrong type of input argument #%d: String expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma string.

source: %s: Wrong type for input arguments #%d or #%d: Strings expected.
pt_br: %s: Tipo errado para os argumentos de entrada #%d or #%d: Esperava-se Strings.

source: Warning: Problems with %s.
pt_br: Aviso: Problemas com %s.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: %s: Wrong file VERSION %s.
pt_br: %s: VERSÃO errada do arquivo %s.
ru_ru: %s: У файла неверная VERSION %s.

source: %s: Wrong module name %s.
pt_br: %s: Nome errado do módulo %s.
ru_ru: %s: Неверное имя модуля %s.

source: %s: Wrong file VERSION in %s.
pt_br: %s: VERSÃO errada do arquivo %s.
ru_ru: %s: У файла неверная VERSION в %s.

source: %s: Wrong value for input argument #%d: '%s' expected.
pt_br: %s: Valor errado para argumento de entrada #%d: Esperava-se '%s'.

source: %s: Wrong type for input arguments #%d and #%d: Strings expected.
pt_br: %s: Tipo errado para os argumentos de entrada #%d e #%d: Esperava-se Strings.

source: %s: Cannot alloc more memory. Try gstacksize('max').
pt_br: %s: Não se consegue alocar mais memória. Tente gstacksize('max').
ru_ru: %s: Не удалось выделить (alloc) больше памяти. Попробуйте gstacksize('max').

source: %s: Out of bounds value. Not in [%lu,%lu].
pt_br: %s: Valor fora dos limites. Não está em [%lu,%lu].
ru_ru: %s: Значение за пределами допустимого диапазона [%lu,%lu].

source: %s: Wrong type for input argument #%d: Scalar, '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se escalar, '%s' ou '%s'.

source: %s: Wrong type for argument #%d: Scalar, '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento #%d: Esperava-se um escalar, '%s' ou '%s'.

source: %s: Invalid library %s.
pt_br: %s: Biblioteca inválida %s.
ru_ru: %s: Некорректная библиотека %s.

source: %s: Invalid '%s' value.
pt_br: %s: Valor '%s' inválido.

source: %s: function-name is incorrect.
pt_br: %s: O nome de função está incorreto.
ru_ru: %s: некорректное имя функции.

source: %s: Wrong value for input argument #%d: Must be %s.
pt_br: %s: Valor errado para o argumento de entrada #%d: Deve ser %s.

source: %s: Wrong type for input arguments #%d or #%d.
pt_br: %s: Valor errado para o argumentos de entrada #%d ou #%d.

source: %s: Impossible to read %s gateway.
pt_br: %s: Impossível ler o portão %s.

source: %s: Invalid module name : %s.
pt_br: %s: Nome de módulo inválido : %s.

source: %s: Cannot allocate more memory. Try stacksize('max').
pt_br: %s: Não se consegue alocar mais memória. Tente stacksize('max').

source: %s: Wrong value for input argument #%d: Scalar, '%s' or '%s' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um escalar, '%s' ou '%s'.

source: %s: Wrong type for input argument #%d: Scalar, '%s' or '%s'.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Escalar, '%s' ou '%s'.

source: WARNING: %s
pt_br: AVISO: %s

source: WARNING: %s
pt_br: AVISO: %s

source: Internal Functions:
pt_br: Funções internas:

source: Commands:
pt_br: Comandos:

source: %s: Wrong number of input arguments.
pt_br: %s: Número errado de argumentos de entrada.
ru_ru: %s: Неверное количество аргументов.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s', '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: '%s', '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' expected. Input argument #%d must be '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s', '%s', '%s'. O argumento de entrada #%d deve ser '%s'.

source: using %10d elements out of %10d.
pt_br: utilizando %10d elementos de %10d.
ru_ru: используется %10d элементов из %10d.

source: and %10d variables out of %10d.
pt_br: e %10d variáveis de %10d.
ru_ru: и %10d переменных из %10d.

source: Your variables are:
pt_br: Suas variáveis são:
ru_ru: Ваши переменные:

source: Your global variables are:
pt_br: Suas variáveis globais são:
ru_ru: Ваши глобальные переменные:

source: Fatal Error: Can't create table for scilab functions.
pt_br: Erro fatal: Não se consegue criar table para funções Scilab.

source: Error: Impossible to define %s environment variable.
pt_br: Erro: Impossível definir a variáel de ambiente %s.

source: Consortium Scilab (DIGITEO)
pt_br: Consórcio Scilab (DIGITEO)

source: Copyright (c) 1989-2009 (INRIA)
pt_br: Copirraite (c) 1989-2009 (INRIA)

source: Copyright (c) 1989-2007 (ENPC)
pt_br: Copirraite (c) 1989-2007 (ENPC)

source: Warning: the operational team of the Scilab Consortium doesn't provide and doesn't support this version of Scilab built with
pt_br: Aviso: o time operacional do Consórcio Scilab não provê nem suporta esta versão do Scilab construída com
ru_ru: Внимание: основная команда Scilab Consortium не распространяет и не поддерживает эту версию Scilab, собранную при помощи

source: Impossible to load %s library: %s
pt_br: Impossível carregar a biblioteca %s: %s

source: Impossible to load %s function in %s library: %s
pt_br: Impossível carregar a função %s na biblioteca %s: %s

source: Impossible to call %s in %s library: %s
pt_br: Impossível chamar %s na biblioteca %s: %s

source: Memory in use: %*ld %%
pt_br: Memória em uso: %*ld %%

source: Total Physical Memory (Kbytes): %*I64d
pt_br: Memória Física Total (Kbytes): %*I64d

source: Free Physical Memory (Kbytes): %*I64d
pt_br: Memória Física Livre (Kbytes): %*I64d

source: Total Paging File (Kbytes): %*I64d
pt_br: Arquivo de Paginamento Total (Kbytes): %*I64d

source: Free Paging File (Kbytes): %*I64d
pt_br: Arquivo de Paginamento Livre (Kbytes): %*I64d

source: Total Virtual Memory (Kbytes): %*I64d
pt_br: Memória Virtual Total (Kbytes): %*I64d

source: Free Virtual Memory (Kbytes): %*I64d
pt_br: Memória Virtual Livre (Kbytes): %*I64d

source: Free Extended Memory (Kbytes): %*I64d
pt_br: Memória Estendida Livre (Kbytes): %*I64d

source: Operating System:
pt_br: Sistema Operacional:

source: Number of processors: %d
pt_br: Número de processadores: %d

source: Video card: %s
pt_br: Placa de vídeo: %s

source: Video card driver version: %s
pt_br: Driver de placa de vídeo versão: %s

source: Screen size: %d x %d %d bits
pt_br: Tamanho de tela: %d x %d %d bits

source: The SCI environment variable is not set.
pt_br: A variável de ambiente SCI não foi ajustada.
ru_ru: Переменная окружения SCI не установлена.

source: Cannot load the module declaration file: %s.
pt_br: Não se consegue carregar arquivo de declaração de módulo: %s.

source: Error: Could not parse file %s.
pt_br: Erro: Não foi possível analisar o arquivo %s.

source: %s module not found.
pt_br: %s módulo não encontrado.
ru_ru: Модуль %s не найден.

source: Error: Not a valid module file %s (encoding not '%s') Encoding '%s' found.
pt_br: Error: Não é um módulo válido %s (a codificação não é '%s'). A codificação '%s' foi encontrada.

source: Version: %s
pt_br: Versão:%s

source: Compilation date: %s
pt_br: Data de compilação: %s

source: Compilation time: %s
pt_br: Tempo de compilação: %s

source: Compiler Architecture: %s
pt_br: Arquitetura do compilador: %s

source: Compiled with %s
pt_br: Compilado com %s

source: XML version: %s
pt_br: Versão XML: %s

source: Enable
pt_br: Habilitar

source: TCL version: %s
pt_br: Versão TCL: %s

source: TK version: %s
pt_br: Versão TK: %s

source: Path separator: %s
pt_br: Separador de endereço: %s

source: Directory separator: %s
pt_br: Separador de diretório: %s

source: PCRE Version: %d.%d
pt_br: Versão de PCRE: %d.%d

source: SCI environment variable not defined.
pt_br: A variável de ambiente SCI não está definida.
ru_ru: Переменная окружения SCI не задана.

source: Warning
pt_br: Aviso
ru_ru: Внимание!

source: SCIHOME not defined.
pt_br: SCIHOME não definido.
ru_ru: Переменная окружения SCIHOME не задана.

source: TMPDIR not defined.
pt_br: TMPDIR não definido.
ru_ru: Переменная окружения TMPDIR не задана.

source: %s: Wrong type for input argument #%d: Named variable expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma variável nomeada.

source: %s: Wrong type for input argument #%d: Compiled macro expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um macro compilado.

source: %s: Out of code.
pt_br: %s: Fora de código.

source: %s: stack size exceeded (Use stacksize function to increase it).
pt_br: %s: Tamanho de pilha excedido (utilize a função stacksize para aumentá-lo).
ru_ru: %s: достигнут пределе размера стека заполнен (Используйте функцию stacksize для его увеличения).

source: %s: Wrong %s value %d instead of %d.
pt_br: %s: Valor %s errado %d ao invés de %d.

source: %s: code %d not yet implemented.
pt_br: %s: Código %d ainda não implementado.

source: %s: Unknown code %d at index2 %d.
pt_br: %s: Código desconhecido %d em index2 %d.
ru_ru: %s: Неизвестный код %d в index2 %d.

source: %s: Old version of if and while not implemented.
pt_br: %s: Versões antigas de if e while ainda não implementadas.

source: %s: Wrong type value.
pt_br: %s: Valor de tipo errado.
ru_ru: %s: Неверный тип значения.

source: %s: Unknown operator %d.
pt_br: %s: Operador desconhecido %d.

source: %s: Wrong fromwhat value %s.
pt_br: %s: Valor fromwhat errado %s.

source: %s: wrong code %d.
pt_br: %s: Código errado %d.
ru_ru: %s: неверный код %d.

source: Error: Could not parse file %s
pt_br: Erro: Não foi possível analisar o arquivo %s

source: Error: Not a valid version file %s (should start with <MODULE_VERSION> and contains <VERSION major='' minor='' maintenance='' revision='' string=''>)
pt_br: Erro: Não é um arquivo de versão válida %s (deveria começar com <MODULE_VERSION> e conter <VERSION major='' minor='' maintenance='' revision='' string=''>)

source: Error: Not a valid version file %s (encoding not 'utf-8') Encoding '%s' found
pt_br: Erro: Não é um arquivo de versão válida %s (a codificação não é 'utf-8'). A codificação '%s' foi encontrada

source: Type '%s' or '%s' to return to standard level prompt.
pt_br: Digite '%s' ou '%s' para retornar para o nível de prompt padrão.

source: Error: Memory allocation.
pt_br: Erro: Alocação de memória.
