Repository: scilab/scilab
Catalog: scilab/modules/pvm/locales/*/pvm.po
Languages: fr_fr, ja_jp, ru_ru

source: %s: An error occurred: %s
fr_fr: %s : Une erreur s'est produite : %s
ja_jp: %s: エラーが起きました: %s
ru_ru: %s: Произошла ошибка: %s

source: %s: Error while creating processes: %s.
fr_fr: %s: Erreur pendant la création des processus: %s.
ja_jp: %s: 作り出そうとしている過程でエラー: %s
ru_ru: %s: Ошибка при создании процесссов: %s.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
ja_jp: %s: これ以上メモリはありません。
ru_ru: %s: Не осталось доступной памяти.

source: %s: No such file or directory.
fr_fr: %s: Fichier ou répertoire inconnu.
ja_jp: %s: ファイル、またはディレクトリが在りません。
ru_ru: %s: Нет такого файла или каталога.

source: %s: Unknown type or not yet implemented
fr_fr: %s: type inconnu ou pas encore implémenté
ru_ru: %s: Неизвестный тип или ещё не реализовано.

source: %s: Unknown type or not yet implemented.
fr_fr: %s: type inconnu ou pas encore implémenté.
ru_ru: %s: Неизвестный тип или ещё не реализовано.

source: %s: Wrong first input argument: '%s' or '%s' expected.
fr_fr: %s: Mauvais premier argument d'entrée: '%s' ou '%s' attendu.
ja_jp: %s: 最初の入力引数が不正: '%s' または '%s' を想定します。
ru_ru: %s: Неверный первый входной параметр: ожидался «%s» или «%s».

source: %s: work space (stacksize) is too small d
fr_fr: %s: l'espace de travail (stacksize) est trop petit d
ja_jp: %s: 作業スペース(スタックサイズ)はとても小さい d です。
ru_ru: %s: рабочее пространство (размер стека) слишком мало d

source: %s: work space (stacksize) is too small.
fr_fr: %s: l'espace de travail (stacksize) est trop petit.
ru_ru: %s: размер стека слишком мал.

source: (group,instance) already exists
fr_fr: (groupe, instance) existe déjà
ja_jp: (グループ、事例) 既に在ります
ru_ru: (группа,экземпляр) уже существует

source: Already doing operation
fr_fr: Opération déjà en cours
ru_ru: Уже выполняется команда

source: Already in group
fr_fr: Déjà dans le groupe
ja_jp: 既にグループです。
ru_ru: Уже в группе

source: Bad message id
fr_fr: Mauvais ID pour le message
ja_jp: 不正なメッセージID
ru_ru: Неверный id сообщения

source: Bad parameter
fr_fr: Paramètre erroné
ja_jp: 不正なパラメータ
ru_ru: Неверный параметр

source: Barrier count mismatch
fr_fr: Erreur dans le décompte de barrière
ja_jp: 障害 数が合いません
ru_ru: Количество вызовов pvm_barrier не совпадает

source: Can not decode received msg
fr_fr: Impossible de décoder le message reçu
ja_jp: 受け取ったメッセージを復号化することができません
ru_ru: Не удалось декодировать принятое сообщение

source: Can not get memory
fr_fr: Impossible de récupérer la mémoire
ja_jp: メモリを得ることができません。
ru_ru: Не удалось получить память

source: Daemon pvmd is not responding
fr_fr: Le démon pvmd ne répond pas
ja_jp: デーモン pvmd は応答しません
ru_ru: Служба pvmd не отвечает

source: Error MALLOC in pvm_error
fr_fr: Erreur MALLOC dans pvm_error
ja_jp: pvm_error で MALLOC エラー
ru_ru: Ошибка MALLOC в pvm_error

source: Error pvm_halt - signal
fr_fr: Erreur pvm_halt - signal
ja_jp: pvm_halt エラー - シグナル
ru_ru: Ошибка: получен сигнал pvm_halt

source: Error pvm_reduce: Not scalar type
fr_fr: Erreur pvm_reduce: Pas un type scalaire
ja_jp: エラー pvm_reduce: スカラー型ではありません
ru_ru: Ошибка pvm_reduce: не скалярный тип

source: Error pvm_reduce: Unknown reduction operation %s
fr_fr: Erreur pvm_reduce: Opération de réduction %s inconnue
ru_ru: Ошибка pvm_reduce: Неизвестная команда для распределённых вычислений %s

source: Failed to exec new slave pvmd
fr_fr: Echec de l'exécution d'un nouveau pvmd esclave
ja_jp: 新しい代替 pvmd 実施は失敗しました
ru_ru: Не удалось запустить подчиненный pvmd

source: Function not implemented
fr_fr: Fonction non implémentée
ja_jp: 関数は実行されませんでした
ru_ru: Функция не реализована

source: Host already configured (Duplicate host)
fr_fr: Hôte déja configuré (hôte dupliqué)
ja_jp: ホストは既に構成されています(ホストの重複)
ru_ru: Узел уже настроен (Двойной узел)

source: Host failed
fr_fr: Echec de l'hôte
ja_jp: ホストは失敗しました
ru_ru: Сбой узла

source: No current buffer
fr_fr: Pas de buffer courant
ja_jp: 現在のバッファでありません
ru_ru: Нет текущего буфера

source: No group with that name
fr_fr: Aucun groupe avec ce nom
ja_jp: その名前をもつグループはありません
ru_ru: Нет группы с таким именем

source: No parent task
fr_fr: Pas de tâche parente
ja_jp: 親タスクなし
ru_ru: Нет задачи-предка

source: No such (group,instance)
fr_fr: (groupe, instance) inconnue
ja_jp: ありません(グループ、事例)
ru_ru: Нет такой группы или экземпляра

source: No such executable
fr_fr: Executable inconnu
ja_jp: 実行可能ファイルはありません
ru_ru: Нет такого исполняемого файла

source: No such host
fr_fr: Hôte inconnu
ja_jp: ホストがありません
ru_ru: Нет такого узла

source: No such instance in group
fr_fr: Cette instance n'est pas dans le groupe
ja_jp: グループ内に事例なし
ru_ru: Нет такого экземпляра в группе

source: No such task
fr_fr: Tâche inconnue
ja_jp: タスクがありません
ru_ru: Нет такой задачи

source: Not in group
fr_fr: Pas dans le groupe
ja_jp: グループに在りません
ru_ru: Не в группе

source: Null group name is illegal
fr_fr: Le nom de groupe Null est illégal
ja_jp: 空のグループ名は不正です
ru_ru: Нулевое имя группы недопустимо

source: Out of resources
fr_fr: Ressources insuffisantes
ru_ru: Недостаточно ресурсов

source: PVM exists
fr_fr: PVM existe
ja_jp: PVMは存在します
ru_ru: PVM существует

source: PVM not found
fr_fr: PVM non trouvé
ja_jp: PVMが見つかりません
ru_ru: PVM не найден

source: PVM parallel Toolbox
fr_fr: Boite à outils parallèle PVM
ja_jp: PVM 平行したツールボックス
ru_ru: Использование PVM

source: Pvmd system error
fr_fr: Erreur système pvmd
ja_jp: Pvmd システムエラー
ru_ru: Системная ошибка pvmd

source: Pvmd-pvmd protocol mismatch
fr_fr: Pvmd-pvmd protocol incohérent
ja_jp: Pvmd-pvmd プロトコルが合いません
ru_ru: Несовпадение протокола pvmd-pvmd

source: Read past end of buffer
fr_fr: Lecture au delà de la fin du buffer
ja_jp: バッファの終わりを読みました
ru_ru: Чтение за пределами буфера сообщения

source: Scilab PVM module not installed.
fr_fr: Le module Scilab PVM n'est pas installé.
ja_jp: Scilab PVM モジュールはインストールされていません。
ru_ru: Модуль PVM не установлен.

source: The configuration file %s is used.
fr_fr: Le fichier de configuration %s est utilisé.
ja_jp: 構成ファイル %s は使われました。
ru_ru: Используется конфигурационный файл %s.

source: The standard configuration file $SCI%s will be used. With SCI=%s SCI will have to be set on remote hosts in order to spawn scilab
fr_fr: Le fichier de configuration standard $SCI%s sera utilisé. Avec SCI=%s SCI devra être réglé sur les hôtes distantes de façon à 'spawn'er Scilab
ja_jp: 標準構成ファイル $SCI%s は使われます。 SCI=%s で SCIがリモート・ホストに設定されている必要があります Scilabを作成するために
ru_ru: Будет использован стандартный конфигурационный файл $SCI%s. При SCI=%s Значение переменной окружения SCI необходимо будет установить на удалённых узлах для того, чтобы вызвать Scilab

source: The standard configuration file $SCI%s%s needs the environment variables %s, %s, %s to be set. PVM can not be started.
fr_fr: Le fichier de configuration standard $SCI%s%s a besoin que les variables d'environnement %s, %s, %s soient réglées. PVM ne peut pas être démarré.
ja_jp: 標準構成ファイル $SCI%s%s は、環境変数 %s、%s、%s のセットを必要とします。PVMは開始できません。
ru_ru: Стандартный файл конфигурации $SCI%s%s требует задания переменных окружения %s, %s, %s. Не удалось запустить PVM.

source: Unknown Error
fr_fr: Erreur inconnue
ja_jp: 未知のエラー
ru_ru: Неизвестная ошибка

source: Warning: PVM_ROOT is not set.
fr_fr: Attention: PVM_ROOT n'est pas réglé.
ja_jp: 警告: PVM_ROOTは設定されません。
ru_ru: Внимание: PVM_ROOT не установлен.

source: Warning: PVM_ROOT is set to %s
fr_fr: Attention: PVM_ROOT est réglé sur %s
ja_jp: 警告: PVM_ROOTは %s への設定です。
ru_ru: Внимание: PVM_ROOT установлен в %s

source: Warning: The standard configuration file $SCI%s was not found. We supposed that PVM and scilab are in standard place on your net (Cf. man pvmd3)
fr_fr: Attention: Le fichier de configuration standard $SCI%s na pas été trouvé. On suppose que PVM et Scilab sont à des endroits standards sur votre réseau (Cf. man pvmd3)
ja_jp: 警告: 標準構成ファイル $SCI%s が見つかりません。 私たちは、PVMとscilabがあなたのネットの標準の場所にあると仮定します (man pvm3 参照)
ru_ru: Предупреждение: стандартный файл конфигурации $SCI%s не найден. Предполагается, что PVM и scilab находятся в обычном месте вашей сети (Ср. man pvmd3)

source: but there exists no configuration file:
fr_fr: mais aucun fichier de configuration n'existe:
ja_jp: しかし、そこにはどんな構成ファイルも存在しません:
ru_ru: но конфигурационный файл не существует в:

source: %s: Unknow type or not yet implemented
ja_jp: %s: 未知の型、または、まだ装備されていません

source: Error pvm_reduce: Unknow reduction operation %s
ja_jp: エラー pvm_reduce: 未知の削減操作 %s

source: Out of ressources
ja_jp: リソース外

source: Already oing operation
ja_jp: すでに oing 操作
