Repository: scilab/scilab
Catalog: scilab/modules/output_stream/locales/*/output_stream.po
Languages: fr_fr

source: Incorrect assignment.
fr_fr: Affectation incorrecte.

source: Waiting for right parenthesis.
fr_fr: En attente d'une parenthèse droite.

source: Undefined variable: %s
fr_fr: Variable non définie: %s

source: Inconsistent column/row dimensions.
fr_fr: Dimension colonne/ligne incohérente.

source: Inconsistent row/column dimensions.
fr_fr: Dimension ligne/colonne incohérente.

source: Dot cannot be used as modifier for this operator.
fr_fr: Le Point ne peut pas être utilisé comme modifieur de cet opérateur.

source: Inconsistent addition.
fr_fr: Addition incohérente.

source: Inconsistent subtraction.
fr_fr: Soustraction incohérente.

source: Inconsistent multiplication.
fr_fr: Multiplication incohérente.

source: Inconsistent right division.
fr_fr: Division droite incohérente.

source: Inconsistent left division.
fr_fr: Division gauche incohérente.

source: Redefining permanent variable.
fr_fr: Redéfinition d'une variable permanente.

source: Eye variable undefined in this context.
fr_fr: La variable Eye n'est pas définie dans ce contexte.

source: Submatrix incorrectly defined.
fr_fr: Sous-matrice incorrectement définie.

source: Incorrect command!
fr_fr: Commande erronée!

source: stack size exceeded!
fr_fr: Taille de la pile dépassée!

source: Use stacksize function to increase it.
fr_fr: Utiliser la fonction stacksize pour l'augmenter.

source: Memory used for variables: %d
fr_fr: Mémoire utilisée pour les variables: %d

source: Intermediate memory needed: %d
fr_fr: Mémoire intermédiaire requise: %d

source: Total memory available: %d
fr_fr: Mémoire totale disponible: %d

source: Too many variables!
fr_fr: Trop de variables!

source: Problem is singular.
fr_fr: Le problème est singulier.

source: Wrong type for first argument: Square matrix expected.
fr_fr: Mauvais type pour le premier argument: une matrice carrée est attendue.

source: Wrong type for argument %d: Square matrix expected.
fr_fr: Mauvais type pour l'argument %d: Une matrice carrée est attendue.

source: Invalid index.
fr_fr: Index invalide.

source: Recursion problems. Sorry...
fr_fr: Problèmes de récursion. Désolé ...

source: Matrix norms available are 1, 2, inf, and fro.
fr_fr: Les normes matricielles disponibles sont 1, 2, inf et fro.

source: Convergence problem...
fr_fr: Problème de convergence ...

source: Bad call to primitive: %s
fr_fr: Mauvais appel de la primitive : %s

source: Too complex recursion! (recursion tables are full)
fr_fr: Récurrence trop complexe! (les tables de récurrence sont pleines)

source: Division by zero...
fr_fr: Division par zéro ...

source: Empty function...
fr_fr: Fonction vide ...

source: Matrix is not positive definite.
fr_fr: La matrice n'est pas définie positive.

source: Invalid exponent.
fr_fr: Exposant invalide.

source: Incorrect string.
fr_fr: Chaîne de caractères incorrecte.

source: Singularity of log or tan function.
fr_fr: Singularité de la fonction log ou tan.

source: Too many ':'
fr_fr: Trop de ':'

source: Incorrect control instruction syntax.
fr_fr: Syntaxe de l'instruction de contrôle incorrecte.

source: Syntax error in a '%s' instruction.
fr_fr: Erreur de syntaxe dans une instruction '%s'.

source: Wrong first argument.
fr_fr: Mauvais premier argument.

source: Wrong input argument %d.
fr_fr: Mauvais argument d'entrée %d.

source: Incorrect function at line %d.
fr_fr: Fonction incorrecte à la ligne %d.

source: Incorrect function.
fr_fr: Fonction incorrecte.

source: Wrong file name.
fr_fr: Mauvais nom de fichier.

source: Incorrect number of input arguments.
fr_fr: Nombre incorrect d'argument d'entrée.

source: Waiting for end of command.
fr_fr: En attente de la fin de la commande.

source: Incompatible output argument.
fr_fr: Argument de sortie incompatible.

source: Incompatible input argument.
fr_fr: Argument d'entrée incompatible.

source: Not implemented in scilab...
fr_fr: Pas encore implémenté dans Scilab...

source: Wrong argument %d.
fr_fr: Mauvais argument %d.

source: null matrix (argument # %d).
fr_fr: matrice null (argument # %d).

source: Incorrect syntax.
fr_fr: Syntaxe incorrecte.

source: end or else is missing...
fr_fr: end ou else est manquant ...

source: input line longer than buffer size: %d
fr_fr: la ligne entrée est plus longue que la taille du buffer : %d

source: Incorrect file or format.
fr_fr: Fichier ou format incorrecte.

source: subroutine not found: %s
fr_fr: sous-programme non trouvé : %s

source: Wrong type for argument %d: Real matrix expected.
fr_fr: Mauvais type pour l'argument %d: Matrice de réels attendue.

source: Wrong type for input argument %d: Real or complex matrix expected.
fr_fr: Mauvais type pour l'argument d'entrée %d: Matrice de réels ou de complexes attendue.

source: Wrong type for input argument %d: Polynomial expected.
fr_fr: Mauvais type pour l'argument d'entrée %d: Polynôme attendu.

source: Wrong type for argument %d: String expected.
fr_fr: Mauvais type pour l'argument %d: Chaîne de caractères attendue.

source: Wrong type for argument %d: List expected.
fr_fr: Mauvais type pour l'argument %d: List attendue.

source: Problem with comparison symbol...
fr_fr: Problème avec le symbole de comparaison ...

source: Function has no input argument...
fr_fr: La fonction n'a pas d'argument d'entrée ...

source: Wrong number of arguments in function call...
fr_fr: Mauvais nombre d'arguments dans l'appel de la fonction ...

source: Arguments are :
fr_fr: Les arguments sont:

source: Function has no output.
fr_fr: La fonction n'a pas de sortie.

source: Incorrect # of outputs in the function
fr_fr: Nombre de sorties de la fonction incorrecte

source: Wrong size for argument: Incompatible dimensions.
fr_fr: Mauvaise dimension for l'argument: Dimensions incompatibles.

source: Direct access : give format.
fr_fr: Accès direct : donner le format.

source: End of file at line %d.
fr_fr: Fin de fichier à la ligne %d.

source: %d graphic terminal?
fr_fr: %d terminaux graphiques?

source: Integration fails.
fr_fr: Echec de l'intégration.

source: %d: logical unit already used.
fr_fr: %d: unité logique déjà utilisée.

source: No more logical units available!
fr_fr: Plus d'unités logiques disponibles:

source: Unknown file format.
fr_fr: Format de fichier inconnu.

source: Fatal error!!! Your variables have been saved in the file : %s Bad call to a scilab function ? Otherwise, send a bug report to :
fr_fr: Erreur fatale !!! Vos variables ont été sauvegardées dans le fichier : %s Mauvais appel à une fonction Scilab ? Sinon, envoyer un rapport de bug à :

source: Floating point exception.
fr_fr: Exception en virgule flottante.

source: Too many arguments in fort (max 30).
fr_fr: Trop d'arguments dans fort (max 30).

source: This variable is not valid in fort.
fr_fr: Cette variable n'est pas valide dans fort.

source: %s is not valid in this context.
fr_fr: %s n'est pas valide dans ce contexte.

source: Error while linking.
fr_fr: Erreur pendant l'édition de liens.

source: Leading coefficient is zero.
fr_fr: Le premier coefficient est zéro.

source: Too high degree (max 100).
fr_fr: Degré trop grand (max 100).

source: for x=val with type(val)=%d is not implemented in Scilab.
fr_fr: pour x=val avec type(val)=%d n'est pas implémenté dans Scilab.

source: %s: Wrong number of input arguments.
fr_fr: %s: Mauvais nombre d'arguments d'entrée.

source: %s: Wrong number of output arguments.
fr_fr: %s: Mauvais nombre d'arguments de sortie.

source: Indexing not allowed for output arguments of resume.
fr_fr: L'indexage n'est pas autorisé pour les arguments de sortie de resume.

source: Incorrect function (argument n: %d).
fr_fr: Fonction incorrecte (argument n: %d).

source: %s: Wrong type for argument %d: Real or complex matrix expected.
fr_fr: %s: Mauvais type pour l'argument %d: Une matrice réelle ou complexe attendue.

source: %s: Wrong type for argument %d: Real matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : matrice réelle attendue.

source: %s: Wrong type for argument %d: Real vector expected.
fr_fr: %s: Mauvais type pour l'argument %d: Vecteur réel attendu.

source: %s: Wrong type for argument %d: Scalar expected.
fr_fr: %s: Mauvais type for l'argument %d: Scalaire attendu.

source: Host does not answer...
fr_fr: L'hôte ne répond pas ...

source: Uncontrollable system.
fr_fr: Système non contrôlable.

source: Unobservable system.
fr_fr: Système non observable.

source: %s: singular or assymetric problem.
fr_fr: %s: problème singulier ou asymétrique.

source: Wrong size for argument %d.
fr_fr: Mauvaise dimension pour l'argument %d.

source: Wrong type for argument %d: Transfer matrix expected.
fr_fr: Mauvais type pour l'argument %d: Matrice de transfert attendue.

source: Wrong type for argument %d: In state space form expected.
fr_fr: Mauvais type pour l'argument %d: Attendu sous la forme espace d'état.

source: Wrong type for argument %d: Rational matrix expected.
fr_fr: Mauvais type pour l'argument %d: Matrice rationnelle attendue.

source: Wrong type for argument %d: In continuous time expected.
fr_fr: Mauvais type pour l'argument %d: Attendu en temps continu.

source: Wrong type for argument %d: In discrete time expected.
fr_fr: Mauvais type pour l'argument %d: Attendu en temps discret.

source: Wrong type for argument %d: SISO expected.
fr_fr: Mauvais type pour l'argument %d: SISO attendu.

source: time domain of argument %d is not defined.
fr_fr: le domaine temporel de l'argument %d n'est pas défini.

source: Wrong type for argument %d: A system in state space or transfer matrix form expected.
fr_fr: Mauvais type pour l'argument %d: Un système sous la forme espace d'état ou sous la forme matrice de transfert est attendu.

source: Variable returned by scilab argument function is incorrect.
fr_fr: La variable retournée par la fonction scilab passée en argument est invalide.

source: Elements of %dth argument must be in increasing order.
fr_fr: Les éléments du %dième argument doivent être rangés par ordre croissant.

source: Elements of first argument are not (strictly) increasing.
fr_fr: Les éléments du premier argument ne sont pas (strictement) croissant.

source: Elements of %dth argument are not in (strictly) decreasing order.
fr_fr: Les éléments du %dième argument ne sont pas rangés en ordre (strictement) décroissant.

source: Elements of first argument are not in (strictly) decreasing order.
fr_fr: Les éléments du premier argument ne sont pas rangés en ordre (strictement) décroissant.

source: Last element of %dth argument <> first.
fr_fr: Le dernier élément du %dième argument <> d'abord.

source: Last element of first argument does not match the first one.
fr_fr: Le dernier élément du premier argument ne correspond pas au premier élément.

source: Variable or function %s are not in file.
fr_fr: La variable ou la fonction %s n'est pas dans le fichier.

source: Variable %s is not a valid rational function.
fr_fr: La variable %s n'est pas une fonction rationnelle valide.

source: Variable %s is not a valid state space representation.
fr_fr: La variable %s n'est pas dans une représentation espace d'état valide.

source: Undefined fonction.
fr_fr: Fonction non définie.

source: Function name already used.
fr_fr: Nom de fonction déjà utilisé.

source: Too many functions are defined (maximum #:%d).
fr_fr: Trop de fonctions sont définies (nb maximum: %d).

source: Too complex for scilab, may be a too long control instruction.
fr_fr: Trop compliqué pour Scilab, peut-être une instruction de contrôle trop longue.

source: Too large, can't be displayed.
fr_fr: Trop large, ne peut pas être affiché.

source: %s was a function when compiled but is now a primitive!
fr_fr: %s était une fonction à la compilation mais est maintenant une primitive!

source: Trying to re-define function %s.
fr_fr: Essaye de redéfinir la fonction %s.

source: No more memory.
fr_fr: Plus de mémoire.

source: Too large string.
fr_fr: Chaîne de caractères trop longue.

source: Too many linked routines.
fr_fr: Trop de routines liées.

source: Stack problem detected within a loop. A primitive function has been called with a wrong number of output arguments. No output argument test has been made for this function. Please report this bug :
fr_fr: Problème de pile détecté pendant une boucle. Une fonction primitive a été appelée avec un mauvais nombre d'arguments de sortie. Aucun test sur les arguments de sortie n'a été fait dans cette fonction. Rapportez ce bug s'il vous plaît :

source: Wrong value for argument %d.
fr_fr: Mauvaise valeur pour l'argument %d.

source: List element number %d is Undefined.
fr_fr: L'élément %d de la list n'est pas défini.

source: Wrong type for argument %d: Named variable not an expression expected.
fr_fr: Mauvais type pour l'argument %d: Une variable nommée n'est pas l'expression attendue.

source: Indices for non-zero elements must be given by a 2 column matrix.
fr_fr: Les indices des éléments non-nuls doivent être donnés dans une matrice 2 colonnes.

source: Incompatible indices for non-zero elements.
fr_fr: Indices incompatibles pour les éléments non-nuls.

source: Logical unit number should be larger than %d.
fr_fr: Le numéro d'unité logique doit être plus grand que %d.

source: Function not bounded from below.
fr_fr: La fonction n'est pas bornée inférieurement.

source: Problem may be unbounded: too high distance between two consecutive iterations.
fr_fr: Le problème peut être non borné: la distance est trop grande entre deux itérations consécutives.

source: Inconsistent constraints.
fr_fr: Contraintes incompatibles.

source: No feasible solution.
fr_fr: Pas de solution réalisables.

source: Degenerate starting point.
fr_fr: Point de départ dégénéré.

source: No feasible point has been found.
fr_fr: Aucun point réalisable n'a été trouvé.

source: Optimization fails: back to initial point.
fr_fr: Echec de l'optimisation: retour au point initial.

source: %s: Stop requested by simulator (ind=0)
fr_fr: %s: Arrêt demandé par le simulateur (ind=0)

source: %s: Wrong input parameters.
fr_fr: %s: Mauvais paramètres d'entrée.

source: Too small memory.
fr_fr: Mémoire trop limitée.

source: %s: Problem with initial constants in simul.
fr_fr: %s: Problèmes avec les constantes initiales dans simul.

source: %s: Bounds and initial guess are incompatible.
fr_fr: %s: Les bornes et l'estimation initiale sont incompatibles.

source: %: This method is NOT implemented.
fr_fr: %: Cette méthode n'est PAS implémentée.

source: NO hot restart available in this method.
fr_fr: PAS de redémarrage à chaud disponible pour cette méthode.

source: %s: Incorrect stopping parameters.
fr_fr: %s: Paramètres d'arrêts incorrects.

source: %s: Incorrect bounds.
fr_fr: %s: Bornes incorrectes.

source: Variable : %s must be a list
fr_fr: Variable: %s doit être une liste

source: Hot restart: dimension of working table (argument n:%d).
fr_fr: Redémarrage à chaud: dimension de l'espace de travail (argument n°:%d).

source: %s: df0 must be positive !
fr_fr: %s: df0 doit être positive !

source: Undefined operation for the given operands.
fr_fr: Opération non définie pour les opérandes données.

source: check or define function %s for overloading.
fr_fr: vérifier ou définir la fonction %s pour la surcharge.

source: %s: Wrong size for argument %d: (%d,%d) expected.
fr_fr: %s: Mauvaise taille pour l'argument %d: (%d,%d) attendue.

source: %s: Wrong size for argument %d: %d expected.
fr_fr: %s: Mauvaise taille pour l'argument %d: %d attendu.

source: %s: Wrong type for argument %d: Matrix of strings expected.
fr_fr: %s: Mauvais type pour l'argument %d: Matrice de chaîne de caractères attendue.

source: %s: Wrong type for argument %d: Boolean matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice booléenne attendue.

source: %s: Wrong type for argument %d: Matrix expected.
fr_fr: %s: Mauvais type pour l'argument %d: Matrice attendue.

source: %s: Wrong type for argument %d: List expected.
fr_fr: %s: Mauvais type pour l'argument %d: Liste attendue.

source: %s: Wrong type for argument %d: Function or string (external function) expected.
fr_fr: %s: Mauvais type pour l'argument %d: Fonction ou chaîne de caractères (fonction externe) attendue.

source: %s: Wrong type for argument %d: Polynomial expected.
fr_fr: %s: Mauvais type pour l'argument %d: Polynôme attendu.

source: %s: Wrong type for argument %d: Working int matrix expected.
fr_fr: %s: Mauvais type pour l'argument n° %d: Matrice de travail d'entiers attendue.

source: %s: Wrong type for argument %d: Vector expected.
fr_fr: %s: Mauvais type pour l'argument %d: Vecteur attendu.

source: %dth argument type must be boolean.
fr_fr: Le type du %dième argument doit être booléen.

source: Argument type must be boolean.
fr_fr: Le type de l'argument doit être booléen.

source: Wrong type for argument %d: Boolean or scalar expected.
fr_fr: Mauvais type pour l'argument %d: Booléen ou scalaire attendu.

source: Wrong type for argument %d: Sparse matrix of scalars expected.
fr_fr: Mauvais type pour l'argument %d: Matrice creuse ou scalaires attendus.

source: Wrong type for argument %d: Handle to sparse lu factors expected.
fr_fr: Mauvais type pour l'argument %d: Un handle vers des facteurs lu creux est attendu.

source: Wrong type argument %d: Sparse or full scalar matrix expected.
fr_fr: Mauvais type pour l'argument %d: Matrice scalaire creuse ou pleine attendue.

source: Null variable cannot be used here.
fr_fr: Une variable nulle ne peut pas être utilisée ici.

source: A sparse matrix entry is defined with two differents values.
fr_fr: Une entrée de matrice creuse est définie avec deux valeurs différentes.

source: %s not yet implemented for full input parameter.
fr_fr: %s pas encore implémenté pour les paramètres d'entrée pleins.

source: It is not possible to redefine the %s primitive this way (see clearfun).
fr_fr: Il n'est pas possible de redéfinir la primitive %s de cette façon (voir clearfun).

source: Type data base is full.
fr_fr: La base de données des types est pleine.

source: This data type is already defined.
fr_fr: Ce type de donnée est déjà définie.

source: Inequality comparison with empty matrix.
fr_fr: Comparaison de type inégalité avec une matrice vide.

source: Missing index.
fr_fr: Indice manquant.

source: reference to the cleared global variable %s.
fr_fr: référence vers la variable global effacée %s.

source: Operands of / and \ operations must not contain NaN of Inf.
fr_fr: Les opérandes des opérations / et \ ne doivent pas contenir de NaN ou d'Inf.

source: semi def fails.
fr_fr: Echec de semi def.

source: Wrong type for first input argument: Single string expected.
fr_fr: Mauvais type pour le premier argument d'entrée: Une seule chaîne de caractères attendue.

source: Entry name not found.
fr_fr: Nom d'entrée non trouvé.

source: Maximum number of dynamic interfaces reached.
fr_fr: Nombre maximum d'interfaces dynamique atteint.

source: %s: expecting more than one argument.
fr_fr: %s: attend plus d'un argument.

source: %s: problem with one of the entry point.
fr_fr: %s : problème avec un des points d'entrée.

source: %s: the shared archive was not loaded.
fr_fr: %s: la bibliothèque partagée n'a pas été chargée.

source: %s: Only one entry point allowed on this operating system.
fr_fr: %s: Seulement un point d'entrée est autorisé sur ce système d'exploitation.

source: %s: First argument cannot be a number.
fr_fr: %s: Le premier argument ne peut pas être un nombre.

source: You cannot link more functions, maxentry reached.
fr_fr: Vous ne pouvez pas lier plus de fonctions, maxentry atteint.

source: File "%s" already exists or directory write access denied.
fr_fr: Le fichier "%s" existe déjà ou le répertoire n'est pas accessible en écriture.

source: File "%s" does not exist or read access denied.
fr_fr: Le fichier "%s" n'existe pas ou n'est pas accessible en lecture.

source: Binary direct acces files must be opened by 'file'.
fr_fr: Les fichiers en accès binaire directs doivent être ouvert par la fonction 'file'.

source: C file logical unit not allowed here.
fr_fr: L'unité logique de type fichier C n'est pas autorisé ici.

source: Fortran file logical unit not allowed here.
fr_fr: L'unité logique de type fortran n'est pas autorisé ici.

source: No input file associated to logical unit %d.
fr_fr: Aucun fichier d'entrée n'est associé à l'unité logique %d.

source: Function not defined for given argument type(s),
fr_fr: Fonction non définie pour le type d'argument donné.

source: check arguments or define function %s for overloading.
fr_fr: vérifier les arguments ou définir la fonction %s pour la surcharge.

source: Wrong value for argument %d: the lu handle is no more valid.
fr_fr: Mauvaise valeur pour l'argument %d: le handle lu n'est plus valide.

source: Wrong value for argument %d: Valid variable name expected.
fr_fr: Mauvaise valeur pour l'argument %d: Nom de variable valide attendu.

source: Wrong value for argument %d: Empty string expected.
fr_fr: Mauvaise valeur pour l'argument %d: chaîne de caractères vide attendue.

source: Recursive extraction is not valid in this context.
fr_fr: L'extraction récursive n'est pas valide dans ce contexte.

source: %s: ipar dimensioned at least 11.
fr_fr: %s: ipar doit être de dimension au moins 11.

source: %s: ltol must be of size ipar(4).
fr_fr: %s: ltol doit être de dimension ipar(4).

source: %s: fixpnt must be of size ipar(11).
fr_fr: %s: fixpnt doit être de dimension ipar(11).

source: %s: ncomp < 20 requested.
fr_fr: %s: ncomp < 20 demandé.

source: %s: m must be of size ncomp.
fr_fr: %s: m doit être de dimension ncomp.

source: %s: sum(m) must be less than 40.
fr_fr: %s: sum(m) doit être inférieur à 40.

source: %s: input data error.
fr_fr: %s: erreur de données d'entrée.

source: %s: no. of subintervals exceeds storage.
fr_fr: %s: no. de sous intervalles dépasse la capacité de stockage.

source: %s: Th colocation matrix is singular.
fr_fr: %s: La matrice de colocation Th est singulière.

source: Interface property table is full.
fr_fr: La table des propriétés d'interface est pleine.

source: Too many global variables! , max number is %d.
fr_fr: Trop de variables globales! , le nombre max est %d.

source: Error while writing in file,(disk full or deleted file.
fr_fr: Erreur pendant l'écriture dans le fichier, (disque plein ou fichier supprimé.

source: Wrong value for argument %d: Must not contain NaN or Inf.
fr_fr: Mauvaise valeur pour l'argument %d: Ne doit pas contenir de NaN ou Inf.

source: %s and %s must have equal number of rows.
fr_fr: %s et %s doivent avoir le même nombre de lignes.

source: %s and %s must have equal number of columns.
fr_fr: %s et %s doivent avoir le même nombre de colonnes.

source: %s and %s must have equal dimensions.
fr_fr: %s et %s doivent avoir les mêmes dimensions.

source: Invalid return value for function passed in arg %d.
fr_fr: Valeur de retour invalide pour la fonction passée en argument %d.

source: Wrong value for argument %d: eigenvalues must have negative real parts.
fr_fr: Mauvaise valeur pour l'argument %d: les valeurs propres doivent avoir une partie réelle négative.

source: Wrong value for argument %d: eigenvalues modulus must be less than one.
fr_fr: Mauvaise valeur pour l'argument %d: le module des valeurs propres doivent être inférieurs à un.

source: Size varying argument a*eye(), (arg %d) not allowed here.
fr_fr: L'argument de taille variable a*eye(), (arg %d) n'est pas autorisé ici.

source: endfunction is missing.
fr_fr: endfunction est manquant.

source: Instruction left hand side: waiting for a dot or a left parenthesis.
fr_fr: Partie gauche de l'instruction: en attente d'un point ou d'une parenthèse ouvrante.

source: Instruction left hand side: waiting for a name.
fr_fr: Partie de gauche de l'instruction: en attente d'un nom.
