Repository: scilab/scilab
Catalog: scilab/modules/output_stream/locales/*/output_stream.po
Languages: fr_fr

source: varargout keyword cannot be used here.
fr_fr: Le mot clef varargout ne peut pas être utilisé ici.

source: Missing operator, comma, or semicolon.
fr_fr: Opérateur, virgule ou point-virgule manquant.

source: Too many commands defined.
fr_fr: Trop de commandes définies.

source: %s: Input arguments should have the same formal variable name.
fr_fr: %s: Les arguments d'entrée devrait avoir le même nom formel de variable.

source: "unknown data"
fr_fr: "Donnée inconnue"

source: Warning :
fr_fr: Attention:

source: Non convergence in the QZ algorithm.
fr_fr: Non convergence de l'algorithme QZ.

source: The top %d x %d blocks may not be in generalized Schur form.
fr_fr: Les %d x %d blocs supérieurs ne sont peut être pas sous la forme de Schur généralisée.

source: Non convergence in QR steps.
fr_fr: Non convergence des itérations QR.

source: The top %d x %d block may not be in Schur form.
fr_fr: Les %d x %d blocks supérieurs ne sont peut être pas sous la forme de Schur.

source: The first %d singular values may be incorrect.
fr_fr: Les premières %d valeurs singulières sont peut être incorrectes.

source: Warning: Result may be inaccurate.
fr_fr: Attention: Le résultat est peut être inexact.

source: matrix is close to singular or badly scaled. rcond = %s
fr_fr: la matrice est presque singulière ou mal conditionnée. rcond = %s

source: computing least squares solution. (see lsq).
fr_fr: calcul de la solution des moindres carrés. (voir lsq).

source: eigenvectors are badly conditioned.
fr_fr: les vecteurs propres sont mal conditionnés.

source: results may be inaccurate. rcond = %s
fr_fr: les résultats sont peut être inexacts. rcond = %s

source: Warning: obsolete use of '=' instead of '=='.
fr_fr: Attention: utilisation obsolète de '=' à la place de '=='.

source: Warning: obsolete use of eye rand or ones.
fr_fr: Attention : utilisation obsolète de eye, rand ou ones.

source: Rank defficient. rank = %d
fr_fr: Rang défaillant. rang = %d

source: Quapro encounters cycles on degenerate point.
fr_fr: Quapro a rencontré des cycles sur un point dégénéré.

source: Norm of projected gradient lower than %s.
fr_fr: La norme du gradient projeté est inférieure à %s.

source: at last iteration f decreases by less than %s.
fr_fr: pendant la dernière itération, f a diminué de moins de %s.

source: Optimization stops because too small variations for x.
fr_fr: L'optimisation s'est arrêtée à cause d'une trop petite variation de x.

source: Optim stops: maximum number of calls to f is reached.
fr_fr: Optim s'est arrêté: le nombre maximum d'appel à f a été atteint.

source: Optim stops: maximum number of iterations is reached.
fr_fr: Optim s'est arrêté: le nombre maximum d'itérations a été atteint.

source: Optim stops: too small variations in gradient direction.
fr_fr: Optim s'est arrêté: les variations de direction du gradient sont trop petites.

source: Stop during calculation of descent direction.
fr_fr: Arrêt pendant le calcul de la direction de descente.

source: Stop during calculation of estimated hessian.
fr_fr: Arrêt pendant le calcul de l'estimation du hessien.

source: End of optimization.
fr_fr: Fin de l'optimisation.

source: End of optimization (linear search fails).
fr_fr: Fin de l'optimisation (échec de la recherche en ligne).

source: sfact : uncomplete convergence relative precision reached : 10**(%s).
fr_fr: sfact : convergence incomplète. Précision relative atteinte: 10**(%s).

source: Help file inconsistent...
fr_fr: Fichier d'aide invalide ...

source: Functions files location : %s.
fr_fr: Emplacement des fichiers de fonctions: %s.

source: Pause mode: enter empty lines to continue.
fr_fr: Mode pause : entrer des lignes vides pour continuer.

source: Breakpoints of function : %s
fr_fr: Point d'arrêt de la fonction: %s

source: Warning: recursion problem..., cleared.
fr_fr: Attention: problème de récurrence ... nettoyé.

source: Warning: stack problem..., cleared.
fr_fr: Attention: problème avec la pile ... nettoyé.

source: Stop after row %s in function %s.
fr_fr: Arrêt après la ligne %s dans la fonction %s.

source: The identifier : %s
fr_fr: L'identifiant : %s

source: has been truncated to: %s.
fr_fr: a été tronqué en : %s.

source: Real part
fr_fr: Partie réelle

source: Imaginary part
fr_fr: Partie imaginaire

source: Maximum size of buffer : %d characters.
fr_fr: Taille maximum du buffer: %d caractères.

source: Rank deficient : rank = %s - tol = %s .
fr_fr: Défaillance du rang : rang = %s - tol = %s.

source: Your variables are:
fr_fr: Vos variables sont:

source: Using %s elements out of %s.
fr_fr: Utilisation de %s éléments parmi %s.

source: and %s variables out of %s.
fr_fr: et %s variables parmi %s.

source: System functions:
fr_fr: Fonctions système:

source: Commands:
fr_fr: Commandes :

source: Warning : redefining function: %s. Use funcprot(0) to avoid this message
fr_fr: Attention: redéfinition de la fonction: %s. Utilisez funcprot(0) pour éviter ce message

source: inside function: %s.
fr_fr: dans la fonction: %s.

source: Not enough memory to perform simplification.
fr_fr: Pas suffisamment de mémoire pour effectuer la simplification.

source: Your global variables are...
fr_fr: Vos variables globales sont ...

source: %s: Loop on two orders detected.
fr_fr: %s: Boucle sur deux niveaux détectée.

source: %s: Impossible to reach required order. previous order computed solution returned.
fr_fr: %s : impossible d'atteindre l'ordre demandé. le précédent ordre calculé est retourné.

source: %s: Failure when looking for the intersection with domains boundaries. previous order computed solution returned.
fr_fr: %s : problème pendant la recherche de l'intersection avec les bornes du domaine. le précédent ordre calculé est retourné.

source: %s: Too many solutions found. previous order computed solution returned.
fr_fr: %s : trop de solutions trouvées. le précédent ordre calculé est retourné.

source: Warning: loaded file has been created with a previous version of Scilab or you are trying to load a file saved on a different architecture.
fr_fr: Attention : le fichier chargé a été créé avec une version précédente de Scilab ou alors vous essayez de charger un fichier sauvé sur une architecture différente.

source: Warning:
fr_fr: Attention:

source: Impossible to load variable %s.
fr_fr: Impossible de charger la variable %s.

source: Warning: Use of standard list to define typed structures is obsolete. Use tlist.
fr_fr: Attention: l'utilisation d'une liste standard pour définir des structures typées est obsolète. Utilisez tlist.

source: Warning : division by zero...
fr_fr: Attention: division par zéro ...

source: Warning : singularity of 'log' or 'tan' function.
fr_fr: Attention: singularité de la fonction 'log' ou 'tan'.

source: At time: %s ,Too many iteration to achieve required precision.
fr_fr: A l'instant: %s, Trop d'itération pour atteindre la précision demandée.

source: stepsize not significant in rkqc.
fr_fr: stepsize n'est pas suffisamment important dan rkqc.

source: Warning: variable %%ODEOPTIONS not found.
fr_fr: Attention: la variable %%ODEOPTIONS n'a pas été trouvée.

source: Warning: integration up to tcrit.
fr_fr: Attention: intégration jusqu'à l'instant tcrit.

source: Warning: integration not completed! check tolerance parameters or step size.
fr_fr: Attention: intégration incomplète! vérifiez les paramètres de tolérance ou la taille du pas.

source: Warning: Jacobian external is given, but not used!, see %ODEOPTIONS(6).
fr_fr: Attention: le Jacobien externe est donnée, mais pas utilisé!, voir %ODEOPTIONS(6).

source: Warning: No Jacobian external given but one is required by %ODEOPTIONS(6) value !
fr_fr: Attention: Pas de Jacobien externe donnée mais un est requis par %ODEOPTIONS(6) !

source: itask=2,3 or 5: At most one value of t is allowed, the last element of t is used.
fr_fr: itask=2,3 ou 5: Au moins une valeur de t est autorisée, le dernier élément de t est utilisé.

source: Warning: odedc forces itask=4 and handles tcrit.
fr_fr: Attention: odedc impose itask=4 et gère tcrit.

source: Warning: function is already compiled.
fr_fr: Attention: la fonction est déjà compilée.

source: %s: termination for lack of space to divide triangle.
fr_fr: %s: fin pour cause de manque d'espace pour le découpage d'un triangle.

source: %s: termination because of roundoff noise.
fr_fr: %s: fin pour cause de bruit d'arrondi.

source: %s: termination for relative error < (5.0*%eps).
fr_fr: %s: fin pour cause d'erreur relative < (5.0*%eps).

source: %s: termination: function evaluations > MEVALS.
fr_fr: %s: fin pour cause de nombre d'évaluation de la fonction > MEVALS.

source: %s: maxpts was too small to obtain the required accuracy.
fr_fr: %s: maxpts était trop petit pour obtenir la précision demandée.

source: Too many input/output ports for hilited block.
fr_fr: Trop de ports entrée / sortie pour le bloc souligné.

source: Too many input/output entries for hilited block.
fr_fr: Trop de ports entrée / sortie pour le bloc souligné.

source: Undefined display for this data type.
fr_fr: Affichage non défini pour ce type de donnée.

source: Warning: primitive function %s has moved.
fr_fr: Attention: la fonction primitive %s a été déplacée.

source: Rebuild your function libraries.
fr_fr: Reconstruisez votre bibliothèque de fonctions.

source: Warning: primitive function %s is now a Scilab function.
fr_fr: Attention: la fonction primitive %s est maintenant une fonction Scilab.

source: Roundoff errors make leading eigenvalues in the Schur form no longer satisfy criterion.
fr_fr: Les erreurs d'arrondi font que les premières valeurs propres de la forme de Schur ne satisfont plus le critère.

source: Formal variable name has been truncated.
fr_fr: Le nom de la variable formel a été tronqué.

source: Unknown key <%s> ignored.
fr_fr: La clef inconnue <%s> est ignorée.

source: %s: window dimensions have been set less than 2^16.
fr_fr: %s: les dimensions de la fenêtre ont été réduites à moins de 2^16.

source: Some data have not been computed they are replaced by NaN.
fr_fr: Des données n'ont pas été calculées, elles sont remplacées par NaN.

source: %s: both actual and predicted relative reductions in the criterion at most %s.
fr_fr: %s: les réductions relatives actuelle et prédite du critère sont au plus %s.

source: %s: relative error between two consecutive iterates is at most %s.
fr_fr: %s: l'erreur relative entre deux itérations consécutives est au plus %s.

source: %s: the cosine of the angle between %s and any column of the jacobian is at most %s in absolute value.
fr_fr: %s: le cosinus de l'angle entre %s et n'importe quelle colonne du Jacobien est au plus %s en valeur absolue.

source: %s: Number of calls to %s has reached or exceeded %s.
fr_fr: %s: Le nombre d'appels à %s a atteint ou dépassé %s.

source: %s: %s is too small. No further reduction in the criterion is possible.
fr_fr: %s: %s est trop petit. Une réduction supplémentaire du critère est impossible.

source: %s: %s is too small. %s is orthogonal to the columns of the jacobian to machine precision.
fr_fr: %s: %s est trop petit. %s est orthogonal aux colonnes du Jacobien à la précision machine près.

source: poly: variable name must be lesser than 5 characters long.
fr_fr: poly: le nom de variable doit faire moins de 5 caractères de long.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.

source: (cont'd) %s
fr_fr: (continue) %s

source: (end) %s
fr_fr: (fin) %s
