Repository: scilab/scilab
Catalog: scilab/modules/graphic_export/locales/*/graphic_export.po
Languages: ja_jp, pt_br, ru_ru

source: Scilab graphic module disabled -nogui or -nwni mode.
ja_jp: Scilabグラフィック・モジュール 無効 -nogui または -nwni モード。
pt_br: O modo gráfico do Scilab desabilitou o modo -nogui ou -nwni.
ru_ru: Графический модуль Scilab выключен в режимах -nogui и -nwni.

source: Scilab Graphic export module not installed.
ja_jp: Scilabグラフィック エクスポート モジュールはインストールされていません。
pt_br: Módulo de exportação Scilab Graphic não instalado.
ru_ru: Модуль экспорта графики Scilab не установлен.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' または '%s' を想定します。
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось '%s' или '%s'.

source: %s: OpenGL error during export.
ja_jp: %s: エクスポート中に OpenGLのエラー。
pt_br: %s: Erro de OpenGL durante exportação.
ru_ru: %s: Ошибка OpenGL в процессе экспорта.

source: %s: Unable to create export file, permission denied.
ja_jp: %s: エクスポートファイルを生成できません、権限がありません。
pt_br: %s: Não se consegue criar arquivo de exportação, permissão negada.
ru_ru: %s: Не удалось создать файл для экспорта, доступ запрещён.

source: %s: GL2PS error during export.
ja_jp: %s: エクスポート中に GL2PSのエラー。
pt_br: %s: Erro de GL2PS durante exportação.
ru_ru: %s: Ошибка GL2PS в процессе экспорта.

source: %s: Unable to create export file, figure is too complex.
ja_jp: %s: エクスポートファイルを生成できません、構成はあまりに複雑です。
pt_br: %s: Não se consegue criar arquivo de exportação, a figura é muito complexa.
ru_ru: %s: Не удалось экспортировать в файл, изображение слишком сложное.

source: %s: Wrong type for input argument #%d: Positive integer expected.
ja_jp: %s: 入力引数 #%d で不正な型: 自然数を想定します。
pt_br: %s: Tipo errado para o argumento de entrada #%d: Experava-se inteiro positivo.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось положительное целое число.

source: %s: Wrong type for input argument #%d: Single character string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 単一文字列を想定します。
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: Esperava-se um string único.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка из одного символа.

source: %s has been replaced by %s
ja_jp: %s は、%s によって取り替えられました
pt_br: %s foi substituído por %s
ru_ru: %s заменено на %s

source: %s: %s must be called before any action.
ja_jp: %s: %s は、挙動の前に呼ばれなくてはいけません。
pt_br: %s: %s deve ser chamado antes de qualquer ação.
ru_ru: %s: %s должна быть вызвана перед любым действием.

source: %s: Wrong number of input arguments: Function has no input argument with ''%s'' or ''%s'' drivers.
ja_jp: %s: 入力引数で不正な数: 関数は、''%s'' または ''%s'' ドライバで入力引数を持ちません。
pt_br: %s: Número incorreto de argumentos de entrada: A função não possui argumento de entrada com drivers ''%s'' ou ''%s''.
ru_ru: %s: Неверное количество входных аргументов: Функция не имеет аргументов при использовании драйверов ''%s'' или ''%s''.

source: %s: Wrong number of input argument: String expected with ''%s'', ''%s'', ''%s'' or ''%s'' drivers.
ja_jp: %s: 入力引数で不正な数: ''%s'', ''%s'', ''%s'' または ''%s'' ドライバで文字列を想定します。
pt_br: %s: Número incorreto de argumentos de entrada: Esperava-se string com drivers ''%s'', ''%s'', ''%s'' ou ''%s''.
ru_ru: %s: Неверное количество входных аргументов: Ожидается строка, если драйвер ''%s'', ''%s'', ''%s'' или ''%s''.

source: %s: Wrong type for input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um texto.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка.

source: %s: Wrong number of input arguments: %d to %d expected.
ja_jp: %1$s: 入力引数で不正な数: %3$d への %2$d を想定します。
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se de %d a %d.
ru_ru: %s: Неверное количество входных аргументов: Ожидалось от %d до %d.

source: %s: Wrong type for input argument #%d: Integer expected.
ja_jp: %s: 入力引数 #%d で不正な型: 整数を想定します。
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se inteiro.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось целое число.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' を想定します。
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s''' ou ''%s'.
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'' или ''%s''.

source: %s: EMF format only available under Microsoft Windows OS.
ja_jp: %s: EMFフォーマットは、Microsoft Windows OSの下に利用できます。
pt_br: %s: Formato EMF disponível apenas para Microsoft Windows.
ru_ru: %s: Формат EMF доступен только под ОС Microsoft Windows.

source: %s: Unable to execute pstoedit.
ja_jp: %s: pstoeditを実行できません。
pt_br: %s: Não se consegue executar pstoedit.
ru_ru: %s: Не удалось выполнить команду pstoedit.

source: xbasimp has been replaced by toprint for printing and by xs2ps for the file export
ja_jp: xbasimpは、印刷とファイルエクスポートのため、xs２psによってtoprintに取り替えられました
pt_br: xbasimp foi substituído por toprint para impressão e por xs2ps para a exportação do arquivo.
ru_ru: Команда xbasimp было заменена на toprint для печати и на xs2ps для экспортирования в файл

source: %s: Unable to locate pstoedit. Please install pstoedit or add it to the PATH to be able to use this feature.
ja_jp: %s: pstoeditを配置できません。どうぞpstoeditをインストールするか、PATHにそれを加えてこの特徴を使えるようにしてください。
pt_br: %s: Não se consegue localizar pstoedit. Por favor, instale pstoedit ou adicione-o a PATH para que se possa utilizar este recurso.
ru_ru: %s: Не удалось найти команду pstoedit. Для правильной работы необходимо установить программу pstoedit, а если она уже установлена, тогда добавьте путь к ней в переменную PATH.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' or ''%s'' expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' または ''%s'' を想定します。
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' ou ''%s''.
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' или ''%s''.
