Repository: scilab/scilab
Catalog: scilab/modules/fileio/locales_macros/*.po
Languages: de_de, fr_fr

source: %s: An error occurred: %s
de_de: %s: ein Fehler ist aufgetreten: %s
fr_fr: %s : Une erreur s''est produite : %s

source: %s: Incorrect format.
de_de: %s: Inkorrektes Format.
fr_fr: %s: Format incorrecte.

source: %s: Invalid conversion.
de_de: %s: ungültige Konversion.
fr_fr: %s: Conversion invalide.

source: %s: Options ignored.
de_de: %s: Optionen ignoriert.
fr_fr: %s : Options ignorées.

source: %s: Wrong number of input argument(s).
de_de: %s: Falsche Anzahl an Eingansargumenten.
fr_fr: %s : Mauvais nombre d''argument(s) d''entrée.

source: %s: Wrong number of output argument(s).
de_de: %s: Falsche Anzahl an Ausgangsargumenten
fr_fr: %s : Mauvais nombre d''argument(s) de sortie.

source: %s: Wrong size for input argument #%d: A String expected.
de_de: %s: falscher Größe für Eingangsargument #%d: eine Zeichenkette erwartet.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A file descriptor expected.
de_de: %s: falsche Größe für Eingangsargument #%d: ein Datei-Deskriptor wird erwartet.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un descripteur de fichier attendu.

source: %s: Wrong size for input argument #%d: A filename expected.
de_de: %s: falsche Größe für Eingangsargument #%d: ein Dateiname erwartet.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un nom de fichier attendu.

source: %s: Wrong size for input argument #%d: A string expected.
de_de: %s: falsche Größe für Eingangsargument #%d: eine Zeichenkette erwartet.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A String expected.
de_de: %s: falscher Typ für Eingangsargument #%d: eine Zeichenkette erwartet.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A file descriptor expected.
de_de: %s: falscher Typ für Eingangsargument #%d: ein Datei-Deskriptor wird erwartet.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Un descripteur de fichier attendu.

source: %s: Wrong type for input argument #%d: A filename or file descriptor expected.
de_de: %s: falscher Typ für Eingangsargument #%d: ein Dateiname oder Dateideskriptor erwartet.
fr_fr: %s: Mauvais type pour l''argument d''entrée %d: Un nom de fichier attendu.

source: %s: Wrong type for input argument #%d: A string expected.
de_de: %s: falscher Typ für Eingangsargument ''%d: eine Zeichenkette erwartet.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: String expected.
de_de: %s: falscher Typ für Eingangsargument #%d: Variable erwartet.
fr_fr: %s : Mauvais type pour l''argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument: String expected.
de_de: %s: falscher Typ für Eingangsargument: Zeichenkette erwartet.
fr_fr: %s : Mauvais type pour l''argument d''entrée : Chaîne de caractère attendue.

source: %s: Wrong value for input argument #%d: A valid file descriptor expected.
de_de: %s: falscher Wert für Eingangsargument #%d: ein gültiger Datei-Deskriptor wird erwartet.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Un descripteur de fichier valide attendu.

source: %s: Wrong value for input argument #%d: Must be ''%s''.
de_de: %s: falscher Wert für Eingangsargument #%d: muß ''%s'' sein.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Doit être ''%s''.

source: %s: Wrong variable type (%s) found in ''%s''. File may be wrong or corrupted.
de_de: %s: falscher Variablentyp (%s) in ''%s'' gefunden. Datei könnte fehlerhaft sein oder beschädigt.
fr_fr: %s : Mauvais type de variable (%s) trouvé dans ''%s''. Le fichier est peut être mauvais ou corrompu.

source: %s: end of input reached before final conversion.
de_de: %s: Ende des Dateneingangs vor der Finalen Konversion erreicht.
fr_fr: %s: la fin de l''entrée a été atteinte avant la conversion finale.
