Repository: scilab/scilab
Catalog: scilab/modules/metanet/locales/*/metanet.po
Languages: ca_es, fr_fr, ru_ru

source: &File
ca_es: &Fitxer
fr_fr: &Fichier
ru_ru: &Файл

source: &Tools
ca_es: &Eines
fr_fr: &Outils
ru_ru: &Сервис

source: &Edit
ca_es: &Edita
fr_fr: &Edition
ru_ru: &Правка

source: %s: First argument must be a vector of size greater or equal to 2.
ca_es: %s: El primer argument ha de ser un vector de mida major o igual que 2.
fr_fr: %s: Le premier argument doit être un vecteur de taille égale ou plus grande que 2.
ru_ru: %s: Первый аргумент должен быть вектором, размером более или равным 2.

source: %s: Second argument must be a vector with same dimension as the first one.
ca_es: %s: El segon argument ha de ser un vector de la mateixa dimensió que el primer.
fr_fr: %s: Le second argument doit être un vecteur ayant les même dimension que le premier.
ru_ru: %s: Второй аргумент должен быть вектором с размерностью, как у первого.

source: %s: Third argument must be a vector of size greater or equal to 1.
ca_es: %s: El tercer argument ha de ser un vector de mida major o igual que 1.
fr_fr: %s: Le troisième argument doit être un vecteur de taille égale ou plus grande que 1.
ru_ru: %s: Третий аргумент должен быть вектором, размером более или равным 1.

source: %s: First argument must be a vector with positive integer values.
ca_es: %s: El primer argument ha de ser un vector amb valors enters positius.
fr_fr: %s: Le premier argument doit être un vecteur composé de valeurs entières positives.
ru_ru: %s: Первый аргумент должен быть вектором с положительными целыми значениями.

source: %s: Second argument must be a vector with positive integer values.
ca_es: %s: El segon argument ha de ser un vector amb valors enters positius.
fr_fr: %s: Le second argument doit être un vecteur composé de valeurs entières positives.
ru_ru: %s: Второй аргумент должен быть вектором с положительными целыми значениями.

source: %s: Third argument must be a vector with positive integer values.
ca_es: %s: El tercer argument ha de ser un vector amb valors enters positius.
fr_fr: %s: Le troisième argument doit être un vecteur composé de valeurs entières positives.
ru_ru: %s: Третий аргумент должен быть вектором с положительными целыми значениями.

source: Running out of memory
ca_es: No hi ha més memòria
fr_fr: Plus de mémoire disponible
ru_ru: Выход за пределы памяти

source: "%s" is a directory
ca_es: «%s» és un directori
fr_fr: « %s » est un répertoire
ru_ru: "%s" является каталогом

source: Directory "%s" does not exist
ca_es: El directori "%s" no existeix
fr_fr: Le répertoire "%s" n'existe pas
ru_ru: Каталог "%s" не существует

source: Graph file "%s/%s.graph" does not exist
ca_es: El fitxer gràfic "%s/%s.graph" no existeix
fr_fr: Le fichier graphe "%s/%s.graph" n'existe pas
ru_ru: Файл графа "%s/%s.graph" не существует

source: Unable to open file "%s/%s.graph"
ca_es: No s'ha pogut obrir el fitxer "%s/%s.graph"
fr_fr: Impossible d'ouvrir le fichier "%s/%s.graph"
ru_ru: Невозможно открыть файл "%s/%s.graph"

source: Bad graph file. Node "%s" is duplicated
ca_es: El fitxer gràfic és incorrecte. Hi ha duplicat el node "%s"
fr_fr: Mauvais fichier graphe. Le noeud "%s" est dupliqué
ru_ru: Повреждённый файл графа. Узел "%s" дублирован

source: Bad graph file. Node "%s" referenced by arc "%s" not found
ca_es: El fitxer gràfic és incorrecte. No s'ha trobat el node "%s" referenciat per l'arc "%s"
fr_fr: Mauvais fichier graphe. Le noeud "%s" référencé par l'arc "%s" est introuvable
ru_ru: Повреждённый файл графа. Узел "%s" полученный по дуге "%s" не найден

source: Scilab module metanet not installed.
ca_es: No està instal·lat el mòdul metanet del Scilab.
fr_fr: Le module Scilab metanet n'est pas installé.
ru_ru: Модуль Scilab metanet не установлен.

source: Bad internal node number %d
ca_es: El número intern de node %d és incorrecte
fr_fr: Mauvais numéro interne de noeud %d
ru_ru: Неверный внутренний номер узла %d

source: Bad internal arc number %d
ca_es: El número intern d'arc %d és incorrecte
fr_fr: Mauvais numéro interne d'arc %d
ru_ru: Неверный внутренний номер дуги %d

source: Unable to write file in directory %s, check access
ca_es: No s'ha pogut escriure el fitxer al directori %s, comproveu l'accés
fr_fr: Impossible d'écrire le fichier dans le répertoire %s, vérifiez les droits
ru_ru: Невозможно записать файл в каталог %s, проверьте права доступа
