Repository: scilab/scilab
Catalog: scilab/modules/statistics/locales/*/statistics.po
Languages: fr_fr

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d à %d attendus.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', %d or %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'', ''%s'', %d ou %d attendu.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s: Mauvais nombre d'arguments en entrée: %d attendu.

source: %s: Wrong type for input argument #%d: Vector expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Vecteur attendu.

source: %s: Wrong value for input argument #%d: Same number of line as first input argument expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Même nombre de ligne que le premier argument d'entrée attendu.

source: %s: Wrong value for input argument #%d: Same number of column as first input argument expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Même nombre de colonne que le premier argument d'entrée attendu.

source: %s: Wrong number of input argument: At least %d expected.
fr_fr: %s: Mauvais nombre d'argument d'entrée: Au moins %d attendu.

source: %s: Wrong number of input argument: %d to %d expected.
fr_fr: %s: Mauvais nombre d'argument en entrée: %d à %d attendu.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'',''%s'', %d or %d.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'', ''%s'',''%s'', %d ou %d.

source: %s: Wrong type for input argument #%d: Real vector or matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Vecteur ou matrice réelle attendu.

source: %s: Wrong type for input argument #%d.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d.

source: %s: Wrong type for input argument #%d: Scalar or vector expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Scalaire ou vecteur attendu.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'',''%s'' or a positive number expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'', ''%s'',''%s'' ou un nombre positif attendu.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendus.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', %d or %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'', ''%s'',''%s'', %d ou %d attendue.

source: %s: Wrong type for input arguments #%d: Numerical expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Numérique attendu.

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Doit être entre %d et %d.

source: %s: Wrong type for input argument #%d: Numerical expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Numérique attendu.

source: %s: Wrong type for input argument #%d: Boolean expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Bouléen attendu.

source: %s: Wrong type for input arguments: Numerical expected.
fr_fr: %s: Mauvais type pour les arguments d'entrée: Un type numérique est attendu.

source: %s: Wrong size for both input arguments: same size expected.
fr_fr: %s: Mauvaise taille pour les deux paramètres en entrée: même taille attendue.

source: %s: Wrong size for input argument #%d: Must be > %d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d: Doit être > %d.

source: %s: Wrong size for input argument #%d and #%d: Same size expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d et n° #%d: Même dimension attendue.

source: %s: Wrong size for input argument #%d: Same number of rows of the second input argument expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d: Même nombre de lignes que le second argument d'entrée attendu.

source: %s: Wrong size for input argument #%d: Same number of columns of the second input argument expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d: Même nombre de colonnes que le second argument d'entrée attendu.

source: %s: Wrong value of input argument #%d: Less or equal than length of last input argument expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Inférieur ou égale à la longueur du dernier argument d'entrée.

source: %s: Wrong size for input argument #%d: Size %s expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d: Dimension %s attendue.

source: %s: Graph demand out of bounds.
fr_fr: %s: Référence d'axe de représentation au delà des limites.

source: Correlations Circle
fr_fr: Cercle des corrélations

source: Eigenvalues (in percent)
fr_fr: Valeurs propres (en pourcentage)

source: %s: Wrong size for input arguments #%d and #%d: Same dimensions expected.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée n° %d et n° #%d: Mêmes dimensions attendues.

source: %s: Wrong value for %d input argument: ''%s'', ''%s'', %d or %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'', ''%s'', %d ou %d attendue.

source: %s: Wrong type for input argument #%d: Vector, matrix of numbers or strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Vecteur, matrice de nombre ou chaînes de caractères attendu.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: Real number between %d to %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Nombre réel entre %d et %d attendu.

source: Wrong value for input argument orien: %s.
fr_fr: Mauvaise valeur pour l'argument d'entrée orien: %s.

source: Size of x is zero : returning NaN.
fr_fr: La dimension de x est zéro: retourne NaN.

source: Size of x:%i
fr_fr: Dimension de x:%i

source: Keeping %i values from %i to %i in sorted order
fr_fr: Retient %i valeurs de %i à %i dans un classement ordonné

source: Unexpected value of orien : %s
fr_fr: Valeur de orien inattendue: %s

source: %s: Wrong value of w : %d; 0 or 1 expected.
fr_fr: %s: Mauvaise valeur pour w : %d; 0 ou 1 attendu.

source: %s: Wrong value for input argument: ''%s'', ''%s'', %d or %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument en entrée: ''%s'', ''%s'', %d ou %d attendue.

source: %s: Wrong value for input argument #%d: Must be > %d.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Doit être > %d.

source: X,Y,A and B
fr_fr: X,Y,A et B

source: A,B,P and Q
fr_fr: A,B,P et Q

source: B,P,Q,X and Y
fr_fr: B,P,Q,X et Y

source: P,Q,X,Y and A
fr_fr: P,Q,X,Y et A

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: '%s', '%s', '%s' ou '%s' attendue.

source: Answer appears to be lower than lowest search bound %f
fr_fr: La solution est inférieure à la borne inférieure de recherche %f

source: Answer appears to be higher than greatest search bound %f
fr_fr: La réponse est supérieure à la borne supérieure de recherche %f

source: Input argument %c is out of range. Bound exceeded: %f
fr_fr: L'argument d'entrée %c est en dehors de l'intervalle. Borne dépassée: %f

source: S,Xn,Pr and Ompr
fr_fr: S,Xn,Pr et Ompr

source: Xn,Pr,Ompr,P and Q
fr_fr: Xn,Pr,Ompr,P et Q

source: Pr,OMPr,P,Q and S
fr_fr: Pr,OMPr,P,Q et S

source: P,Q,S and Xn
fr_fr: P,Q,S et Xn

source: X and Df
fr_fr: X et Df

source: Df, P and Q
fr_fr: Df, P et Q

source: P,Q and X
fr_fr: P,Q et X

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: '%s', '%s' ou '%s' attendue.

source: cdfchi: Error in cumgam
fr_fr: cdfchi: Erreur dans cumgam

source: X,Df and Pnonc
fr_fr: X,Df et Pnonc

source: Df,Pnonc,P and Q
fr_fr: Df,Pnonc,P et Q

source: Pnonc,P,Q and X
fr_fr: Pnonc,P,Q et X

source: P,Q,X and Df
fr_fr: P,Q,X et Df

source: F,Dfn and Dfd
fr_fr: F,Dfn et Dfd

source: Dfn,Dfd,P and Q
fr_fr: Dfn,Dfd,P et Q

source: Dfd,P,Q and F
fr_fr: Dfd,P,Q et F

source: P,Q,F and Dfn
fr_fr: P,Q,F et Dfn

source: F,Dfn,Dfd and Pnonc
fr_fr: F,Dfn,Dfd et Pnonc

source: Dfn,Dfd,Pnonc,P and Q
fr_fr: Dfn,Dfd,Pnonc,P et Q

source: Dfd,Pnonc,P,Q and F
fr_fr: Dfd,Pnonc,P,Q et F

source: Pnonc,P,Q,F and Dfn
fr_fr: Pnonc,P,Q,F et Dfn

source: P,Q,F,Dfn and Dfd
fr_fr: P,Q,F,Dfn et Dfd

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: '%s', '%s', '%s', '%s' ou '%s' attendue.

source: X,Shape and Scale
fr_fr: X,Shape et Scale

source: Shape,Scale,P and Q
fr_fr: Shape,Scale,P et Q

source: Scale,P,Q and X
fr_fr: Scale,P,Q et X

source: P,Q,X and Shape
fr_fr: P,Q,X et Shape

source: S,XN,PR and OMPR
fr_fr: S,XN,PR et OMPR

source: XN,PR,OMPR,P and Q
fr_fr: XN,PR,OMPR,P et Q

source: PR,OMPR,P,Q and S
fr_fr: PR,OMPR,P,Q et S

source: P,Q,S and Xn
fr_fr: P,Q,S et Xn

source: X,Mean and Std
fr_fr: X,Mean et Std

source: Mean,Std,P and Q
fr_fr: Mean,Std,P et Q

source: Std,P,Q and X
fr_fr: Std,P,Q et X

source: P,Q,X and Mean
fr_fr: P,Q,X et Mean

source: Std must not be zero
fr_fr: Std ne doit pas être zero

source: S and Xlam
fr_fr: S et Xlam

source: Xlam,P and Q
fr_fr: Xlam,P et Q

source: P,Q and S
fr_fr: P,Q et S

source: T and Df
fr_fr: T et Df

source: P,Q and T
fr_fr: P,Q et T

source: %s: Wrong number of input arguments with the '%s' option: %d expected.
fr_fr: %s: Mauvais nombre pour les arguments d'entrée avec l'option '%s': %d attendu.

source: %s and %s must have same size.
fr_fr: %s et %s doivent être de la même taille.
