Repository: scilab/scilab
Catalog: scilab/modules/data_structures/locales/*/data_structures.po
Languages: fr_fr

source: An hypermatrix extraction must have at least 2 arguments.
fr_fr: Une extraction d'hypermatrice doit avoir au moins 2 arguments.

source: An hypermatrix insertion must have at least 3 arguments.
fr_fr: Une insertion d'hypermatrice doit avoir au moins 3 arguments.

source: Argument is not an hypermatrix.
fr_fr: L'argument n'est pas une hypermatrice.

source: Bad hypermatrix insertion.
fr_fr: Mauvaise insertion dans une hypermatrice.

source: Incompatible hypermatrix extraction.
fr_fr: Extraction d'une hypermatrice incompatible.

source: %s: ''dims'' can not be used as a field name.
fr_fr: %s: ''dims'' ne peut etre utilisé comme nom de champs.

source: %s: Number of entries does not match product of dimensions
fr_fr: %s: Le nombre d'entrées ne correspond pas au produit des dimensions

source: %s: Wrong number of input argument(s) : an even number is expected.
fr_fr: %s: Mauvais nombre d'argument d'entrée(s) : un nombre pair est attendu.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : %d attendu.

source: %s: Wrong number of input arguments: %d expected
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: struct array expected.
fr_fr: %s: Mauvais type for l'argument d'entrée n° %d: une structure attendue.

source: %s: Wrong values for input argument #%d: Elements must be non-negative integers.
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée n° %d: Les éléments doivent être des entiers non négatifs.

source: %s: field name ''%s'' defined twice.
fr_fr: %s: le champ nommé ''%s'' est défini deux fois.

source: Bad (%d th) index in hypermatrix extraction.
fr_fr: Mauvais (%d ième) index dans l'extraction d'une hypermatrice.

source: Too many arguments in the stack, edit stack.h and enlarge intersiz.
fr_fr: Trop d'arguments sur la pile, éditez stack.h et augmentez intersiz.
