Repository: scilab/scilab
Catalog: scilab/modules/signal_processing/locales_macros/*.po
Languages: fr_fr

source: %s: Arguments #%d and #%d must have the same sizes.
fr_fr: %s: Les arguments n° %d et n° %d doivent avoir les mêmes dimensions.

source: %s: Incompatible input arguments #%d and #%d: Argument #%d expected to be less than argument #%d.
fr_fr: %s: Les arguments d''entrée n°%d et n°%d sont incompatibles: L''argument n°%d doit être plus petit que l''argument n°%d.

source: %s: Incompatible input arguments #%d and #%d: Same degree expected.
fr_fr: %s: Les arguments d''entrée n°%d et n°%d sont incompatibles: Ils doivent avoir le même degré.

source: %s: Incompatible input arguments #%d and #%d: Same numbers of elements expected.
fr_fr: %s : Arguments d''entrée n°%d et n°%d incompatibles : Même nombre d''éléments attendu.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s : Arguments d''entrée n°%d et n°%d incompatibles : Même dimension attendue.

source: %s: Input argument #%d must be real.
fr_fr: %s : L''argument d''entrée n°%d doit être réel.

source: %s: Too abrupt change near end of frequency range.
fr_fr: %s: Changement trop brusque au voisinage de la fin de la bande de fréquence.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d à %d attendus.

source: %s: Wrong size for input argument #%d: A %d elements array expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n°%d: Un tableau de %d éléments est attendu.

source: %s: Wrong size for input argument #%d: A polynomial expected.
fr_fr: %s : Mauvaise taille pour l''argument d''entrée n°%d : Un polynôme est attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un scalaire attendu.

source: %s: Wrong size for input argument #%d: A single input, single output system expected.
fr_fr: %s: Mauvaise taille pour l''argument d''entrée n° %d: Un système mono-entrée, mono-sortie est attendu.

source: %s: Wrong size for input argument #%d: A tall matrix expected.
fr_fr: %s: Mauvaise dimensions pour l''argument d''entrée n°%d: Le nombre de lignes doit être >= au nombre de colonnes.

source: %s: Wrong type for input argument #%d: Linear dynamical system or row vector of floats expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n°%d: Un système dynamique linéaire ou un vecteur de flottants est attendu.

source: %s: Wrong type for input argument #%d: Array of floating point numbers expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : un tableau de nombres flottants est attendu.

source: %s: Wrong type for input argument #%d: rational fraction array expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : tableau de fraction rationnelle attendu.

source: %s: Wrong value for input argument #%d: Must be in the interval [%s, %s].
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n° %d : Doit être dans l''intervalle [%s, %s].

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Doit être dans l''ensemble {%s}.

source: %s: Wrong values for input argument #%d: Distance between Max and Min elements must be greater than %g.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: La distance entre le plus grand et le plus petit élement doit être plus grande que %g.

source: %s: Wrong values for input argument #%d: Elements must be in increasing order.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: Les élements doivent être en ordre croissant.

source: %s: Wrong values for input argument #%d: Elements must be in the interval [%s, %s].
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: Les élements doivent être dans l''intervalle [%s, %s].

source: %s: Wrong values for input argument #%d: Elements must be positive.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: Les élements doivent être positifs.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
fr_fr: %s : Mauvaise valeurs pour l''argument d''entrée n°%d : Un entier non-négatif attendu.

source: %s: Wrong values for input argument #%d: Not sampled high enough.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: L''échantillonage n''est pas assez fin.

source: %s: Wrong values for input argument #%d: The first element must be %s and the last %s.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: Le premier élement doit être %s et le dernier %s.

source: %s: Wrong values for input argument #%d: degree must be in the set {%s}.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n°%d: Le degré doit être dans l''ensemble {%s}.

source: Arma identification
fr_fr: Identification d''Arma

source: Signal Processing
fr_fr: Traitement du signal

source: Spectral power
fr_fr: Puissance spectrale

source: Theoretical value
fr_fr: Valeur théorique

source: Using macro mese
fr_fr: Utilise la macro mese

source: estimates xf
fr_fr: Estime xf

source: estimates xs
fr_fr: Estime xs

source: frequency
fr_fr: fréquence

source: real state
fr_fr: état réel

source: spectral estimate
fr_fr: estimation spectrale
