Repository: scilab/scilab
Catalog: scilab/modules/cacsd/locales/*/cacsd.po
Languages: fr_fr, pt_br

source: %s: Wrong values for input arguments #%d and #%d.
fr_fr: %s: Mauvaises valeurs pour les arguments d'entrée #%d et #%d.
pt_br: %s: Valores errados para os argumentos de entrada #%d e #%d.

source: %s: Wrong value for input argument #%d: Must be in [%d %d].
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Les élements doivent être dans l'intervalle [%d, %d].
pt_br: %s: Valor errado para o argumento de entrada #%d: Deve estar em [%d %d].

source: %s: Wrong type for input argument #%d: Linear state space expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une représentation d'état est attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um espaço de estados linear.

source: %s: Square but singular system.
fr_fr: %s: Le système est carré mais singulier.
pt_br: %s: Sistema quadrado mas singular.

source: %s: System not stabilizable (or detectable) => Stabilizing the stabilizable part.
fr_fr: %s: Le système n'est pas stabilisable (ou detectable) => La partie stabilisable est rendue stable.
pt_br: %s: Sistema não estabilizável (ou detectável) => Estabilizando a parte estabilizável.

source: %s: Wrong type for input argument #%d: %s data structure expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une structure de donnée de type %s est attendue.
pt_br: %s: Tipo errado do argumento de entrada #%d: esperava estrutura de dados %s.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s: Mauvais type pour largument d'entrée #%d: Un vecteur de chaines de caractères est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de textos.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Une chaine de caractères est attendue.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um texto.

source: %s: WARNING: the A matrix has eigenvalues near the imaginary axis.
fr_fr: %s: Attention: la matrice A a des valeurs propres proches de l'axe imaginaire.
pt_br: %s: ALERTA: a matriz A possui auto-valores próximos da eixo imaginário.

source: %s: Controllable & observable mode(s) of A near the imaginary axis
fr_fr: %s: Les modes controllables et observables de A sont proches de l'axes imaginaire.
pt_br: %s: Modo controlável e observável de A estão próximos ao eixo imaginário.

source: %s: All modes of A are nearly nonminimal so that || G || is almost 0.
fr_fr: %s: Tous les modes de A sont quasi non-minimaux, donc || G || est presque 0.
pt_br: %s: Todos os modos de A são aproximadamente não-minimais tal que || G || é quase 0.

source: %s: The computed value of || G || may be inaccurate.
fr_fr: %s: La valeur calculée pour || G || peut-être imprécise.
pt_br: %s: O valor computado de || G || pode ser impreciso.

source: %s: Wrong dimension (%d) of stable subspace: %d expected.
fr_fr: %s: Mauvaise dimension (%d) du sous espace stable: %d est attendue.
pt_br: %s: Dimensão errada (%d) de subespaço estável: Esperava-se %d.

source: %s: Wrong type for input argument #%d: Linear state space or a transfer function expected.
fr_fr: %s: Mauvais type pour l'agument d'entrée #%d: Une representation d'état ou une fonction de transfert est attendue.
pt_br: %s: Tipo incorrecto para el parámetro de entrada #%d: Se esperaba espacio de estados lineal o una función de transferencia.

source: %s: Wrong value for input argument #%d: Continuous time system expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée #%d: Le système doit être en temps continu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema de tempo contínuo.

source: %s: Wrong value for input argument #%d: Stabilizable system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système stabilisable est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema estabilizável.

source: %s: Wrong value for input argument #%d: Detectable system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système détectable est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema detectável.

source: %s: Cannot find the state dimension.
fr_fr: %s : Il n'est pas possible de déterminer la dimension de l'état.
pt_br: %s: Não se consegue achar a dimensão de estado.

source: %s: Incompatible input arguments #%d and #%d: Same column dimensions expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir le même nombre de colonnes.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se a mesma dimensão das colunas.

source: %s: Wrong number of input arguments: %d expected
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d est attendu.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se %d

source: %s: Wrong type for input argument #%d: Linear dynamical system .
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire est attendu.

source: %s: Wrong type of input argument #%d: Array of floating point numbers expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: un tableau de nombres flottants est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um array de números de pontos flutuantes.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Elle doit être dans l'ensemble {%s}.
pt_br: %s: Valor errado do argumento de entrada #%d: deve estar no conjunto {%s}.

source: %s: Stationary Riccati solver failed.
fr_fr: %s: La résolution de l'équation de Riccati statique a échoué.
pt_br: %s: O solucionador estacionário de Riccati falhou.

source: %s: Incompatible input arguments #%d and #%d: Same numbers of elements expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir le même nombre d'élements.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se o mesmo número de elementos.

source: %s: Wrong value for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: ''%s'' est attendue.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s''.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d attendu(s).
pt_br: %s: Quantidade errada de argumentos de entrada. Esperava-se %d.

source: %s: Wrong value for of input argument %d: Proper system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système propre est attendu.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d attendu(s).
pt_br: %s: Número de argumentos de entrada incorreto: Esperava-se %d.

source: %s: Wrong type for input argument #%d: Array of floating point numbers expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: un tableau de nombres flottants est attendu.
pt_br: %s: Tipo errado do argumento de entrada #%d: esperava um array de pontos flutuantes.

source: %s: Wrong type for input argument #%d: Linear dynamical system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire est attendu.
pt_br: %s: Tipo errado do argumento de entrada #%d: esperava um sistema linear dinâmico.

source: Zeros
fr_fr: Zéros

source: Transmission zeros and poles
fr_fr: Poles et zéros de transmission
pt_br: Pólos e zeros de transmissão

source: Real axis
fr_fr: Axe réel
pt_br: Eixo real

source: Imaginary axis
fr_fr: Axe imaginaire
pt_br: Eixo imaginário

source: %s: Input argument %d is assumed continuous time.
fr_fr: %s: L'argument d'entrée %d est supposé en temps continu.
pt_br: %s: Argumento de entrada %d é assumido como sendo de tempo contínuo.

source: %s: Wrong number of output arguments: %d expected.
fr_fr: %s: Mauvais nombre d'arguments de sortie: %d est attendu.
pt_br: %s: Quantidade errada de argumentos de saída: Esperava-se %d.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Il doit valoir %d ou %d.
pt_br: %s: Quantidade errada de argumentos de entrada: esperava-se %d ou %d.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Il doit être compris entre %d et %d.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se de %d a %d.

source: %s: Wrong number of output arguments: At least %d expected.
fr_fr: %s: Mauvais nombre d'arguments de sortie: au moins %d attendu.
pt_br: %s: Número errado de argumentos de saída: Esperava-se pelo menos %d.

source: %s: Wrong value for input argument #%d: %d or %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: %d ou %d est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se %d ou %d.

source: %s: Needs %s => Use default value %s=%d.
fr_fr: %s: %s est nécessaire, la valeur par défaut %s=%d est utilisée.
pt_br: %s: É necessário %s => Use o valor padrão %s=%d.

source: %s: System is not stable.
fr_fr: %s: Le système n'est pas stable.
pt_br: %s: O sistema não é estável.

source: %s: norm cannot be computed. Relative accuracy smaller than 1e-3 Hinfnorm is probably exactly max sv(D) The system might be all-pass
fr_fr: %s: La norme ne peut-être calculée. La précision relative est plus petite que 1e-3 Hinfnorm est probablement exactement max sv(D) Le système devrait être passe-tout.
pt_br: %s: A norma não pode ser computada. Precisão relativa menor que 1e-3 Hinfnorm provavelmente é exatamente max sv(D) O sistema pode ser passa-tudo.

source: %s: More than %d iterations.
fr_fr: %s: Plus que %d itérations.
pt_br: %s: Mais de %d iterações.

source: %s: Wrong type for input argument #%d: State-space linear system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système linéaire sous forme d'état est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema linear de espaço de estados.

source: %s: Wrong type for input argument #%d: Continuous-time linear system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système temps continu est attendu.
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: Esperava-se um sistema linear de tempo contínuo.

source: %s: Wrong value for input argument #%d: Pure imaginary poles unexpected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Des poles sont proches de l'axe imaginaire.
pt_br: %s: Valor errado para o argumento de entrada #%d: Não se esperava pólos imáginários puros.

source: %s: Wrong value for input argument #%d: Stable system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système stable est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema estável.

source: %s: Francis equations not satisfied.
fr_fr: %s: Les équations de Francis ne sont pas satisfaites.
pt_br: %s: As equações de Francisnão não são satisfeitas.

source: %s: Wrong size for input argument #%d: row dimension must be equal to %d.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Le nombre de lignes doit être égal à %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: a dimensão da coluna deve ser igual a %d.

source: %s: Wrong size of input argument #%d: Number of columns are incompatible with %s.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Le nombre de colonnes est incompatible avec %s.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Número de colunas é incompativel com %s.

source: %s: Dimensions of %s are inadequate.
fr_fr: %s: Les dimensions de %s sont inadéquates.
pt_br: %s: Dimensões de %s são inadequadas.

source: %s: %s is not full rank at the machine precision.
fr_fr: %s: %s n'est pas de plein rang à la précision machine.
pt_br: %s: %s não tem posto cheio na precisão da máquina.

source: %s: %s is nearly unstabilizable.
fr_fr: %s: %s est presque non-stabilisable.
pt_br: %s: %s é praticamente não-estabilizável.

source: %s: %s has zero(s) near the imaginary axis.
fr_fr: %s: %s a un ou plusieurs zéros proches de l'axe imaginaire.
pt_br: %s: %s possui zero(s) próximo ao eixo imaginário.

source: %s: %s has pure imaginary eigenvalue(s).
fr_fr: %s: %s a des valeurs propres imaginaires pures.
pt_br: %s: %s possui auto-valor(es) puramente imaginários.

source: %s: %s is indefinite.
fr_fr: %s: %s n'est pas défini non-négatif.
pt_br: %s: %s é indefinida.

source: %s: Controllable & observable mode(s) of %s near the imaginary axis.
fr_fr: %s: Les modes controllables et observables de %s sont proches de l'axe imaginaire.
pt_br: %s: Modo(s) controlável e observável de %s próximo ao eixo imaginário.

source: %s: All modes of %s are nearly nonminimal so that %s is almost %d.
fr_fr: %s: Tous les modes de %s sont presque non-minimaux donc %s est presque %d.
pt_br: %s: Todos os modos de %s são aproximadamente não-minimais de tal forma que %s é no máximo %d.

source: %s: Wrong size for input argument #%d: A row vector with length>%d expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un vecteur ligne de longueur>%d est attendu.
pt_br: %s: Tamanho incorreto para o argumento de entrada #%d: Esperava-se um vetor linha de comprimento >%d.

source: %s: Wrong type for input argument #%d: Linear dynamical system or row vector of floats expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire ou un vecteur ligne est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema linear dinâmico ou um vetor linha de pontos flutuantes.

source: %s: Incompatible input arguments #%d and #%d: Same number of elements expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils avoir le même nombre d'élements.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se o mesmo número de elementos.

source: Nyquist plot
fr_fr: Courbe de Nyquist
pt_br: Esboço Nyquist

source: %s: Wrong type for input argument #%d: A list expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une list est attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma lista.

source: %s: Hybrid system not implemented.
fr_fr: %s: Les systèmes hybrides ne sont pas gérés.
pt_br: %s: Sistema híbrido não implementado.

source: %s: Multi rate discrete system not implemented.
fr_fr: %s: Les systèmes multi-cadences ne sont pas gérés.
pt_br: %s: Sistema discreto de taxas múltiplas não implementado.

source: %s: Incorrect link: %s
fr_fr: %s: Lien %s incorrect
pt_br: %s: Link incorreto: %s

source: %s: Wrong size for link from block %s.
fr_fr: %s: Mauvaise taille pour le lien issu du bloc %s.
pt_br: %s: Tamanho errado do link do bloco %s.

source: %s: Invalid sizes found during the process.
fr_fr: %s: Des tailles incorrectes ont été trouvées pendant le traitement.
pt_br: %s: Tamanhos inválidos encontrados durante o processo.

source: %s: Undefined type ''%s''.
fr_fr: %s: Type ''%s'' non reconnu.
pt_br: %s: tipo ''%s'' não definido.

source: %s: No output found.
fr_fr: %s: Aucune sortie n'a été trouvée.
pt_br: %s: Nenhuma saída encontrada.

source: %s: No input found.
fr_fr: %s: Aucune entrée n'a été trouvée.
pt_br: %s: Nenhuma entrada encontrada.

source: %s: Some output(s) are undefined.
fr_fr: %s: Des sorties ne sont pas définies.
pt_br: %s: Alguma(s) saída(s) não foi(foram) definida(s).

source: %s: Some input(s) are undefined.
fr_fr: %s: Des sorties ne sont pas définies.
pt_br: %s: Alguma(s) entradas não estão definidas.

source: %s: Wrong values for input argument #%d: you must choose rk<nout.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: rk<nout est attendu.
pt_br: %s: Valore errados para o argumento de entrada #%d: você deve escolher rk<nout.

source: %s: Wrong number of output arguments: %d to %d expected.
fr_fr: %s: Mauvais nombre d'arguments de sortie: Il doit être compris entre %d et %d.
pt_br: %s: Número errado de argumentos de saída: Esperava-se de %d a %d.

source: Amplitude and phase contours of y/(1+y)
fr_fr: Isovaleurs d'amplitude et de phase de y/(1+y)
pt_br: Amplitud y contornos de fase de y/(1+y)

source: phase(y) (degree)
fr_fr: phase(y) (degré)
pt_br: fase(y) (grau)

source: magnitude(y) (Db)
fr_fr: Amplitude (Db)

source: %s: time domains are not compatible.
fr_fr: %s: Les domaines temps ne sont pas compatibles.
pt_br: %s: Domínios de tempo incompatíveis.

source: %s: Wrong size for input argument #%d: Single input, single output system expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un système mono-entrée, mono-sortie est attendu.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um sistema de entrada-saída simples.

source: %s: Infinite solution.
fr_fr: %s: Solution infinie.
pt_br: %s: Solução infinita.

source: %s: Wrong size for input argument #%d: Square system expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un système carré est attendu.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um sistema quadrado.

source: %s: Wrong type for input argument #%d: Linear dynamical system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema linear dinâmico.

source: %s: %s not full rank.
fr_fr: %s: %s n'est pas de rang plein.
pt_br: %s: %s não possui posto cheio.

source: %s: Frequencies beyond Nyquist frequency are ignored.
fr_fr: %s: Les fréquences au dela de la fréquence de Nyquist sont ignorées.
pt_br: %s: As frequências maiores que a frequência de Nyquist são ignoradas.

source: %s: Negative frequencies below Nyquist frequency are ignored.
fr_fr: %s: Les fréquences négatives au dessous de la fréquence de Nyquist sont ignorées.
pt_br: %s: As frequências menores que a frequência de Nyquist são ignoradas.

source: %s: Wrong value for input arguments #%d and #%d: %s < %s expected.
fr_fr: %s: Mauvaise valeurs pour les arguments d'entré #%d et #%d: %s doit être inférieur à %s .
pt_br: %s: Valor errado para argumentos de entrada #%d e #%d: Esperava-se %s < %s .

source: %s: Wrong type for input argument #%d: State-space form expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une représentation d'état est attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um estado de espaços.

source: %s: Incompatible input arguments #%d and #%d: Same row dimensions expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir le même nombre de lignes.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se as mesmas dimensões de linha.

source: %s: Bad conditioning.
fr_fr: %s: Mauvais conditionnement.
pt_br: %s: Mau condicionamento.

source: %s: Number of rows of %s are incompatible with %s object.
fr_fr: %s: Le nombre de lignes de %s est incompatible avec l'objet %s.
pt_br: %s: Número de colunas de %s é incompatível com o objeto %s.

source: %s: Wrong size for input argument #%d: An empty matrix expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Une maytrice vide est attendue.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz vazia.

source: %s: %s must be of dimension (%s, %s).
fr_fr: %s: %s doivent être de dimensions (%s, %s).
pt_br: %s: %s deve ter dimensão (%s, %s).

source: %s: Wrong values for input argument #%d: State matrix is singular.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: La matrice d'état est singulière.
pt_br: %s: Valores errados para o argumento de entrada #%d: A matriz de estados é singular.

source: %s: Wrong values for input argument #%d: State matrix - eye is singular.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: La matrice d'état a des valeurs propres égales à 1.

source: %s: %s is not zero! (set to zero)
fr_fr: %s: %s n'est pas nul mais considéré comme nul!
pt_br: %s: %s não é zero! (ajuste para zero)

source: %s: Iteration %s, error=%s.
fr_fr: %s: Itération %s, erreur=%s.
pt_br: %s: Iteração %s, erro=%s.

source: %s: Wrong value for input argument #%d: Proper system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système propre est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema próprio.

source: Frequency (Hz)
fr_fr: Fréquence (Hz)
pt_br: Frequência (Hz)

source: Magnitude (Db)
fr_fr: Amplitude (Db)

source: %s Wrong number of input arguments: %d or %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Il doit valoir %d ou %d.

source: %s: Wrong type for input argument #%d: Linear state space expected.
fr_fr: %s: Mauvais type pour l'arguments d'entrée #%d: Une représentation d'état est attendue.

source: Autocorrelation Function
fr_fr: Fonction d'autocorrélation
pt_br: Função de Auto-correlação

source: %s: Wrong type for input argument #%d: A linear dynamical system or a polynomial expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire ou un polynôme est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema linear dinâmico ou um polinômio.

source: %s: Wrong value for input argument #%d: Single input, single output system expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un système mono-entrée, mono-sortie est attendu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sistema de entrada única e saída única.

source: open loop zeroes
fr_fr: Zéros en boucle ouverte
pt_br: zeros de loops abertos

source: open loop poles
fr_fr: Poles en boucle ouverte
pt_br: Pólos de laço aberto

source: asymptotic directions
fr_fr: Directions asymptotiques
pt_br: direções assintóticas

source: Evans root locus
fr_fr: Lieu d'Evans
pt_br: Locus da raiz de Evans

source: %s: Curve truncated to the first %d discretization points.
fr_fr: %s: La courbe a été tronquée aux %d premiers points de discrétisation.
pt_br: %s: Curva truncada para os primeiros %d pontos de discretização.

source: %s: Wrong value for input arguments: If %s and %s nothing to identify.
fr_fr: %s: Mauvaise valeur pour les arguments d'entrée: Si %s et %s il n'y a rien à identifier.
pt_br: %s:Valor errado dos argumentos de entrada: Se %s e %s não há nada para identificar.

source: %s: %s is numerically singular.
fr_fr: %s: %s est numeriquement singulier.
pt_br: %s: %s é numericamente singular.

source: %s: Standard deviation of the estimator %s:
fr_fr: %s: L'écart type de l'estimateur %s est:
pt_br: %s: Desvio padrão do estimador %s:

source: %s: Wrong values for input argument #%d: proper elements expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Les élements doivent être propres.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se elementos próprios.

source: %s: Wrong values for input argument #%d: Proper transfer function expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Le système doit être propre.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se uma função de transferência própria.

source: %s : No feasible ro in bounds [%g %g]
fr_fr: %s: pas de valeur adimissible pour ro dans l'intervalle [%g %g].
pt_br: %s : Não existe ro viável nos limites [%g %g]

source: %s: %s is not stabilizable.
fr_fr: %s: %s n'est pas stabilisable.
pt_br: %s: %s não é estabilizável.

source: %s: %s is stabilizable.
fr_fr: %s: %s est stabilisable.
pt_br: %s: %s é estabilizável.

source: %s: %s is not detectable.
fr_fr: %s: %s n'est pas détectable.
pt_br: %s: %s não é detectável.

source: %s: %s is detectable.
fr_fr: %s: %s est détectable.
pt_br: %s: %s é detectável.
