Repository: scilab/scilab
Catalog: scilab/modules/cacsd/locales/*/cacsd.po
Languages: fr_fr, pt_br

source: %s: %s has a zero on/close the imaginary axis.
fr_fr: %s: %s a un zéro sur ou proche de l'axe imaginaire.
pt_br: %s: %s possui um zero em/próximo do eixo imaginário.

source: %s: Wrong values for input argument #%d: %s is not full rank.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: %s n'est pas de plein rang.
pt_br: %s: Valores errado para o argumento de entrada #%d: %s não possui posto cheio.

source: %s: gamma too small.
fr_fr: %s: gamma est trop petit.
pt_br: %s: gamma muito pequeno.

source: %s: An eigenvalue of %s (controller) is close to Imaginary axis.
fr_fr: %s: Une valeur propre du controlleur %s est proche de l'axe imaginaire.
pt_br: %s: Um auto-valor de %s (controlador) está próximo do eixo imaginário.

source: %s: Riccati solution inaccurate: equation error = %g.
fr_fr: %s: La solution de l'équation de Ricatti est imprécise, l'erreur d'équation =%g.
pt_br: %s: Solução de Riccati imprecisa: erro da equação = %g.

source: %s: An eigenvalue of %s (observer) is close to Imaginary axis.
fr_fr: %s: Une valeur propre du de l'observateur %s est proche de l'axe imaginaire.
pt_br: %s: Um auto-valor de %s (observador) está próximo do eixo imaginário.

source: Unfeasible (Hx hamiltonian)
fr_fr: Pas de solution (hamiltonien Hx)
pt_br: Inviável (Hx hamiltonian)

source: Unfeasible (Hy hamiltonian)
fr_fr: Pas de solution (hamiltonien Hy)
pt_br: No factible (Hy hamiltonian)

source: Unfeasible (spectral radius)
fr_fr: Pas de solution (rayon spectral)
pt_br: Inviável (raio espectral)

source: %s: Direct feedthrough set to its zero degree coefficient.
fr_fr: %s: Le terme de transfert direct est assigné à son coefficient de degré 0.
pt_br: %s: Feedthrough direto ajustado para o seu coeficiente de grau zero.

source: %s: Direct feedthrough set to zero.
fr_fr: %s: Le terme de transfert direct est assigné à zéro.
pt_br: %s: Feedthrough direto ajustado para zero.

source: %s: Incompatible input arguments #%d and #%d:
fr_fr: %s: les arguments d'entrée #%d et #%d sont incompatibles:
pt_br: %s: Argumentos de entrada #%d e #%d incompatíveis:

source: %s: Residual norm = %g
fr_fr: %s: Norme du résidu = %g
pt_br: %s: Norma residual = %g

source: %s: Bad conditionning.
fr_fr: %s: Mauvais conditionnement.
pt_br: %s: Mau condicionamento.

source: %s: Wrong value for input argument #%d: Pure imaginary poles unexpected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Des poles sont proches de l'axe imaginaire.

source: Phase (degree)
fr_fr: Phase (degré)
pt_br: Fase (grau)

source: %s: Stable subspace is too small.
fr_fr: %s: Le sous espace stable est trop petit.
pt_br: %s: O subspaço estável é muito pequeno.

source: %s: %s non symmetric.
fr_fr: %s: %s n'est pas symétrique.
pt_br: %s: %s não é simétrico.

source: %s: Wrong value for input argument #%d: Time domain must be ''c'' or ''d''.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Le domaine temps doit être ''c'' ou ''d''.
pt_br: %s: Valor errado para o argumento de entrada #%d: O domínio do tempo deve ser ''c'' ou ''d''.

source: %s: Wrong size for input argument #%d: Square matrix expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Une matrice carrée est attendue.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz quadrada.

source: %s: Wrong size for input argument #%d: Square system expected. '),
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un système carré est attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un scalaire est attendu.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong type for input argument #%d: String, Scalar or empty matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une chaine de caractères, un scalaire ou une matrice vide sont attendus.
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: Esperava-se string, escalar ou uma matriz vazia.

source: %s: Wrong type for input argument #%d: Polynomial array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un tableau de polynômes est attendu.
pt_br: %s: Argumento de entrada errado para #%d: Esperava-se array de polinômios.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir les mêmes dimensions.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se as mesmas dimensões.

source: %s: Incompatible input arguments #%d and #%d: Same formal variable names expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir les mêmes variables formelles.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se nomes de variáveis formais iguais.

source: %s: At least %s past values needed.
fr_fr: %s: au moins %s valeurs passées sont nécessaires.
pt_br: %s: São necessários pelo menos %s valores passados.

source: %s: Wrong type for input argument #%d: Linear state space system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Une représentation d'état est attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema de espaço de estados linear.

source: %s: Input argument #%d must be real.
fr_fr: %s: L'argument d'entrée #%d doit être réel.
pt_br: %s: O argumento de entrada #%d deve ser real.

source: %s: Input argument #%d must be strictly positive.
fr_fr: %s: L'argument d'entrée #%d doit être strictement positif.
pt_br: %s: O argumento de entrada #%d deve ser estritamente positivo.

source: %s: Wrong values for input argument #%d: Discrete time system expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Un système discret est attendu.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se um sistema de tempo discreto.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Au moins %d sont attendus.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se pelo menos %d.

source: %s: Wrong type for input argument #%d: rational fraction array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un tableau de fraction rationnelles est attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um array de frações racionais.

source: %s: Wrong size for input argument #%d: A polynomial expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un polynôme est attendu.
pt_br: %s: Tamanho incorreto para o argumento de entrada #%d: Esperava-se um polinômio.

source: %s: Wrong values for input argument #%d: Stable system expected.
fr_fr: %s: Mauvaise valeur Pour l'argument d'entrée #%d: Un système stable est attendu.
pt_br: %s: Valores errados do argumento de entrada #%d: esperava um sistema estável.

source: Numerator :
fr_fr: Numérateur:
pt_br: Numerador:

source: Denominator :
fr_fr: Dénominateur:
pt_br: Denominador:

source: Irreducible Factors of transfer function (click below)
fr_fr: Facteurs irréductibles de la fonction de tranfert (cliquer ci dessous)
pt_br: Fatores irredutíveis da função de transferência (clique abaixo)

source: Irreducible Factors of transfer function natural frequency and damping factor (click below)
fr_fr: Facteurs irréductibles de la fonction de tranfert fréquence propre et atténuation (cliquer ci dessous)
pt_br: Fatores irredutíveis da frequência natural e do fator de amortecimento da função de transferência (clique abaixo)

source: Denominator :
fr_fr: Dénominateur:

source: %s: Incorrect answer.
fr_fr: %s: Réponse incorrecte.
pt_br: %s: Resposta incorreta.

source: %s: Wrong type for input argument: Linear dynamical system expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Un système dynamique linéaire est attendu.
pt_br: %s: Tipo errado de argumento de entrada: esperava um sistema linear dinâmico.

source: %s: Wrong number of output argument: %d expected.
pt_br: %s: Número errado de argumento de saída: Esperava-se %d.

source: %s: Wrong number of output arguments: %d or %d expected.
pt_br: %s: Número errado de argumentos de saída: Esperava-se %d ou %d.

source: %s: Wrong type for input argument #%d: A real expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um número real.

source: Gain :
pt_br: Ganho :

source: Poles
pt_br: Pólos
