Repository: scilab/scilab
Catalog: scilab/modules/scicos/locales_macros/*.po
Languages: ca_es, fr_fr, uk_ua

source: %s.mo cannot be compiled
ca_es: No es pot compilar el %s.mo
fr_fr: %s.mo ne peut pas être compilée
uk_ua: не вдалося зібрати %s.mo

source: %s.mo compilation forced
ca_es: S''ha forçat la compilació de %s.mo
fr_fr: Compilation de %s.mo forcée
uk_ua: збирання %s.mo виконується у примусовому режимі

source: %s.mo must be recompiled
ca_es: S''ha de recompilar el %s.mo
fr_fr: %s.mo doit être recompilée
uk_ua: %s.mo доведеться зібрати повторно

source: Scilab is in no gui mode : Scicos is unavailable
ca_es: L''Scilab està en mode consola: L''Scicos no és disponible
fr_fr: Scilab est en mode sans-UI : Scicos n''est pas disponible
uk_ua: Scilab працює не у графічному режимі: скористатися Scicos не можна

source: %s is not a valid directory
ca_es: %s no és un directori vàlid
fr_fr: %s n''est pas un répertoire valide
uk_ua: %s не є коректною адресою каталогу

source: %s is not a valid name, please change the title of the diagram.
ca_es: %s no és un nom vàlid, canvieu el nom del diagrama.
fr_fr: %s n''est pas un nom valide, changez, svp, le titre du diagramme.
uk_ua: %s є некоректною назвою, будь ласка, змініть назву діаграми.

source: %s: Cannot find any MO files in the following location: %s.
ca_es: %s: No s''ha pogut trobar cap fitxer MO a la següent ubicació: %s.
fr_fr: %s: Impossible de trouver les fichiers MO dans le répertoire suivant: %s.
uk_ua: %s: не вдалося знайти жодного файла MO за такою адресою: %s.

source: %s: Diagram does not compile in pass %d.
ca_es: %s: El diagrama no compila al pas %d.
fr_fr: %s: Le diagramme ne compile pas à l''étape %d.
uk_ua: %s: не вдалося створити діаграму на кроці %d.

source: %s: Error: A scifunc block has not been defined.
ca_es: %s: Error: No s''ha definit un bloc scifunc.
fr_fr: %s: Erreur: Un bloc scifunc n''a pas été défini.
uk_ua: %s: помилка: блок scifunc не було визначено.

source: %s: Error: Modelica compiler (MODELICAC) is unavailable.
ca_es: %s: Error: El compilador Modelica (MODELICAC) no està disponible.
fr_fr: %s: Erreur: Le compilateur Modelica (modelicac) n''est pas disponible.
uk_ua: %s: помилка: не вдалося знайти компілятор Modelica (MODELICAC).

source: %s: First argument must be a Scicos diagram data structure
ca_es: %s: El primer argument ha de ser un diagrama d''estructura de dades de Scicos
fr_fr: %s: Le premier argument doit être une structure de donnée d''un diagramme Scicos
uk_ua: %s: першим параметром повинна бути структура даних діаграми Scicos

source: %s: Input ports are not numbered properly.
ca_es: %s: Els ports d''entrada no s''han numerat correctament.
fr_fr: %s: Les ports d''entrée ne sont pas numérotés correctement.
uk_ua: %s: помилкова нумерації портів вхідних даних.

source: %s: Output ports are not numbered properly.
ca_es: %s: Els ports de sortida no s''han numerat correctament.
fr_fr: %s: Les ports de sortie ne sont pas numérotés correctement.
uk_ua: %s: помилкова нумерації портів вихідних даних.

source: %s: Wrong number of input arguments. Must be between %d and %d.
ca_es: %s: Nombre incorrecte d''arguments d''entrada. Ha de ser entre %d i %d.
fr_fr: %s: Mauvais nombre d''arguments d''entrée. Doit être entre %d et %d.
uk_ua: %s: помилкова кількість вхідних параметрів. Їх має бути від %d до %d.

source: %s: Wrong number of input arguments: %d expected.
ca_es: %s: Nombre incorrecte d''arguments d''entrada: Se''n necessiten %d.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendu.
uk_ua: %s: помилкова кількість вхідних параметрів: слід використовувати %d.

source: %s: Wrong number of output arguments: %d expected.
ca_es: %s: Nombre incorrecte d''arguments de sortida: Se''n necessiten %d.
fr_fr: %s : Mauvais nombre d''arguments de sortie : %d attendus.
uk_ua: %s: помилкова кількість вихідних параметрів: слід використовувати %d.

source: %s: Wrong size for input argument #%d: Single integer expected.
ca_es: %s: L''argument #%d és d''un tipus incorrecte: Ha de ser un nombre simple.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un seul entier attendu.
uk_ua: %s: помилкова розмірність вхідного параметра №%d: мало бути одне ціле число.

source: %s: Wrong size for input argument #%d: Single string expected.
ca_es: %s: L''argument #%d és d''un tipus incorrecte: Ha de ser un text simple.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n° %d : Une simple chaîne de caractères attendue.
uk_ua: %s: помилковий розмір вхідного параметра №%d: слід використовувати одинарний рядок.

source: %s: Wrong size for input arguments #%d and #%d.
ca_es: %s: Mida incorrecta per als arguments d''entrada #%d i #%d.
fr_fr: %s : Mauvaise dimension pour les arguments d''entrée n°%d et n°%d.
uk_ua: %s: помилкові розмірності вхідних параметрів №%d та №%d.

source: %s: Wrong type for input argument #%d: Integer expected.
ca_es: %s: L''argument #%d és d''un tipus incorrecte: Ha de ser un enter.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Entier attendu.
uk_ua: %s: помилковий тип вхідного параметра №%d: мало бути ціле число.

source: %s: Wrong type for input argument #%d: String expected.
ca_es: %s: L''argument #%d és d''un tipus incorrecte: Ha de ser un text.
fr_fr: %s : Mauvais type pour l''argument n° %d : Chaîne de caractères attendue.
uk_ua: %s: помилковий тип вхідного параметра №%d: слід використовувати тип «string».

source: &Edit
ca_es: &Edita
fr_fr: &Edition
uk_ua: &Правка

source: &File
ca_es: &Fitxer
fr_fr: &Fichier
uk_ua: &Файл

source: &Tools
ca_es: &Eines
fr_fr: &Outils
uk_ua: &Інструменти

source: ''scicos'' is no more available, please use ''xcos'' instead.
ca_es: El ''scicos'' ja no està disponible. Utilitzeu el ''xcos''.
fr_fr: ''scicos'' n''est plus accessible, veuillez utiliser ''xcos''.
uk_ua: «scicos» більше не підтримується, будь ласка, скористайтеся «xcos».

source: About Scicos
ca_es: Quant al Scicos
fr_fr: A propos de Scicos
uk_ua: Про Scicos

source: Activate Scilab Window
ca_es: Activa la finestra d''Scilab
fr_fr: Active la Fenêtre Scilab
uk_ua: Вікно активації Scilab

source: Add a new color at the Scicos palette
ca_es: Afegeix un color nou a la paleta d''Scicos
fr_fr: Ajoute une nouvelle couleur dans la palette Scicos
uk_ua: Додавання нового кольору до палітри Scicos

source: Add color
ca_es: Afegeix un color
fr_fr: Ajoute une couleur
uk_ua: Додати колір

source: Add new block
ca_es: Afegeix un nou bloc
fr_fr: Ajoute un nouveau block
uk_ua: Додати новий блок

source: Align
ca_es: Alinea
fr_fr: Aligner
uk_ua: Вирівняти

source: An Atomic Superblock cannot contain sample clocks
ca_es: Un superbloc atòmic no pot contenir mostres de rellotge
fr_fr: Un Superblock Atomique ne peut pas contenir d''horloges d''échantillonnage
uk_ua: Елементарний суперблок не може містити шаблонів годинника

source: An error occur when evaluating context:
ca_es: S''ha produït un error en avaluar el context:
fr_fr: Une erreur est survenue pendant l''évaluation du contexte:
uk_ua: Під час спроби оцінки контексту сталася помилка:

source: An unexpected error occurred while executing the menu %s:
fr_fr: Une erreur inattendue est survenue pendant l''exécution du menu %s:
uk_ua: Сталася помилка під час спроби відкриття меню %s:

source: Analyze Diagram
ca_es: Analitza el diagrama
fr_fr: Analyse le Diagramme
uk_ua: Аналізувати діаграму

source: Atomic
ca_es: Atòmic
fr_fr: Atomique
uk_ua: Елементарний

source: Available Parameters
ca_es: Paràmetres disponibles
fr_fr: Paramètres Disponibles
uk_ua: Доступні параметри

source: Background color
ca_es: Color de fons
fr_fr: Couleur de l''arrière-plan
uk_ua: Колір тла

source: Background color ? :
ca_es: Color de fons? :
fr_fr: Couleur de fond ? :
uk_ua: Колір тла:

source: Block Documentation
ca_es: Documentació del bloc
fr_fr: Documentation du Block
uk_ua: Документація з блоку

source: Block ID font name
ca_es: Nom de lletra de l''identificador de bloc
fr_fr: Nom de la police de caractère de l''ID du Block
uk_ua: Гарнітура шрифту ідентифікатора блоку

source: Block ID font size
ca_es: Mida de lletra de l''identificador de bloc
fr_fr: Taille de la police de caractère de l''ID du block
uk_ua: Розмір шрифту ідентифікатору блоку

source: BrowseTo
ca_es: Navega A
uk_ua: Перегляд

source: Browser
ca_es: Navegador
fr_fr: Navigateur
uk_ua: Переглядач

source: C Code Generation
ca_es: Generació de codi C
fr_fr: Génération de Code C
uk_ua: Створення коду мовою C

source: Calc
fr_fr: Calculer
uk_ua: Калькулятор

source: Choose export format:
ca_es: Escolliu el format d''exportació:
fr_fr: choisissez un format d''exportation:
uk_ua: Виберіть формат для експортування:

source: Click block to label
ca_es: Feu clic al bloc per etiquetar
fr_fr: Cliquez sur le block pour ajouter un label
uk_ua: Клацніть на блоці для визначення мітки

source: Click block to resize
ca_es: Feu clic al bloc per redimensionar
fr_fr: Cliquez sur le block pour le redimensionner
uk_ua: Клацніть на блоці для зміни розмірів

source: Click object to move, drag and click (left to fix, right to cancel)
ca_es: Feu clic a l''objecte per moure, arrossegar (esquerre per fixar, dret per cancel·lar)
fr_fr: Cliquez sur un objet à déplacer, glissez et cliquez (clique gauche pour le fixer, clique droit pour abandonner)
uk_ua: Клацніть на об’єкті, щоб пересунути його. Перетягніть і клацніть (лівою, щоб зафіксувати, правою, щоб скасувати)

source: Click on a Super Block (without activation output) to obtain a coded block!
ca_es: Feu clic en un super bloc (sense activar la sortida) per obtenir un bloc codificat.
fr_fr: Cliquez sur un Super Block (sans sortie d''activation) pour obtenir un block codé!
uk_ua: Клацніть на суперблоці (без активації виведення даних), щоб переглянути блок коду!

source: Click on a block to set or get its documentation
fr_fr: Cliquez sur un block pour affecter ou récupérer sa documentation
uk_ua: Клацніть на блоці, щоб змінити або переглянути документацію з нього

source: Click on a port of object to be moved
fr_fr: Cliquez sur un port, cliquez sur un port de l''objet à déplacer
uk_ua: Клацніть на тому порті об’єкта, який слід пересунути

source: Click on a super block
ca_es: Feu clic en un super bloc
fr_fr: Cliquez sur un Super Block
uk_ua: Клацніть на суперблоці

source: Click on an object to set or get identification
ca_es: Feu clic en un objecte per establir o obtenir la identificació
fr_fr: Cliquez sur un objet pour affecter ou récupérer son identification
uk_ua: Клацніть на об’єкті, щоб змінити або переглянути параметри ідентифікації

source: Click on block to open graphic icon editor
ca_es: Feu clic en un bloc per obrir l''editor gràfic d''icones
fr_fr: Cliquez sur un block pour ouvrir l''éditeur graphique d''icone
uk_ua: Клацніть на блоці, щоб відкрити редактор графічних піктограм

source: Click on block to be flipped
ca_es: Feu clic al bloc que s''ha de capgirar
fr_fr: Cliquez sur le block à renverser
uk_ua: Клацніть на блоці, який слід віддзеркалити

source: Click on block to be turned left
ca_es: Feu clic al bloc que s''ha de girar a l''esquerra
fr_fr: Cliquez sur le block à tourner à gauche
uk_ua: Клацніть на блоці, який слід обертати за годинниковою стрілкою

source: Click on block to be turned right
ca_es: Feu clic al bloc que s''ha de girar a la dreta
fr_fr: Cliquez sur le block à tourner à droite
uk_ua: Клацніть на блоці, який слід обертати проти годинникової стрілки

source: Click on block to edit its icon
ca_es: Feu clic al bloc per editar la seva icona
fr_fr: Cliquez sur le block pour éditer son icone
uk_ua: Клацніть на блоці, щоб змінити його піктограму

source: Click on object to get information on it
ca_es: Feu clic a l''objecte per veure la seva informació
fr_fr: Cliquez sur l''objet pour obtenir de l''information
uk_ua: Клацніть на об’єкті, щоб переглянути відомості про нього

source: Click on object to choose its color
ca_es: Feu clic a l''objecte per escollir el seu color
fr_fr: Cliquez sur l''objet pour choisir sa couleur
uk_ua: Клацніть на об’єкті, щоб вибрати його колір

source: Click on the object to duplicate, drag, click (left to copy, right to cancel)
ca_es: Feu clic a l''objecte per duplicar-lo (esquerre per copiar, dret per cancel·lar)
fr_fr: Cliquez sur l''objet à dupliquer, glisser, cliquer (clique gauche pour copier, clique droit pour abandonner)
uk_ua: Клацніть на об’єкті, щоб здублювати його, перетягніть вказівник і ще раз клацніть (лівою кнопкою, щоб скопіювати, правою, щоб скасувати)

source: Click to open block or make a link
ca_es: Feu clic per obrir el bloc o fer-ne un enllaç
fr_fr: Cliquez pour ouvrir le block ou pour contruire un lien
uk_ua: Клацніть, щоб відкрити блок, або створити зв’язок

source: Click where you want object to be placed (right-click to cancel)
ca_es: Feu clic on vulgueu posar l''objecte (amb el botó dret per cancel·lar)
fr_fr: Cliquer où vous voulez placer l''objet (clic-droit pour annuler)
uk_ua: Клацніть лівою у тому місці, де ви бажаєте розташувати об’єкт (клацніть правою кнопкою, щоб скасувати)

source: Close
ca_es: Tanca
fr_fr: Fermer
uk_ua: Закрити

source: Code Generation only works for a Superblock !
ca_es: La generació de codi només funciona per a un superbloc.
fr_fr: La génération de code fonctionne uniquement pour un super-bloc !
uk_ua: Створення коду працює лише для суперблоків!

source: Code generation applies only to Super Blocks.
ca_es: La generació de codi només s''aplica a un superbloc.
fr_fr: La génération de code s''applique seulement aux super-blocs.
uk_ua: Створювати коду можна лише для суперблоків.

source: Color
fr_fr: Couleur
uk_ua: Колір

source: Compile
ca_es: Compila
fr_fr: Compiler
uk_ua: Зібрати

source: Context
fr_fr: Contexte
uk_ua: Контекст

source: Copy
ca_es: Copia
fr_fr: Copier
uk_ua: Копіювати

source: Create Atomic
ca_es: Crea un Atomic
fr_fr: Créé Atomique
uk_ua: Створити елементарний об’єкт

source: Create Mask
ca_es: Crea una màscara
fr_fr: Créer un masque
uk_ua: Створити маску

source: CtrlSelect
fr_fr: CtrlSélect
uk_ua: Ctrl-позначення

source: Customize Mask
ca_es: Personalitza una màscara
fr_fr: Personnaliser le masque
uk_ua: Змінити маску

source: Customize block GUI:
ca_es: Personalitza el bloc:
fr_fr: Customise l''interface graphique du block:
uk_ua: Налаштування інтерфейсу блоку:

source: Cut
ca_es: Retalla
fr_fr: Couper
uk_ua: Вирізати

source: Cut: Click on the object to cut
ca_es: Retalla: Feu clic a l''objecte per retallar-lo
fr_fr: Couper : Cliquer sur l''objet pour le couper
uk_ua: Вирізання: клацніть на об’єкті, який слід вирізати

source: Debug Level
ca_es: Nivell de depuració
fr_fr: Niveau de débogage
uk_ua: Докладність діагностичних повідомлень

source: Default link colors
ca_es: Color predeterminat dels enllaços
fr_fr: Couleurs par défaut du lien
uk_ua: Типові кольори зв’язків

source: Default window parameters
ca_es: Paràmetres predeterminats de finestra
fr_fr: Paramètres par défaut de la fenêtre
uk_ua: Типові параметри вікна

source: Defined shortcuts
ca_es: Dreceres de teclat definides
fr_fr: Raccourcis définis
uk_ua: Визначені клавіатурні скорочення

source: Delete
ca_es: Elimina
fr_fr: Supprimer
uk_ua: Вилучити

source: Delete: Click on the object to delete
ca_es: Elimina: Feu clic a l''objecte a eliminar
fr_fr: Suppression : Cliquer sur l''objet pour le supprimer
uk_ua: Вилучити: клацніть на об’єкті, який слід вилучити

source: Demos
fr_fr: Démos
uk_ua: Демонстрації

source: Details
ca_es: Detalls
fr_fr: Détails
uk_ua: Подробиці

source: Diagram
ca_es: Diagrama
fr_fr: Diagramme
uk_ua: Діаграма

source: Done
ca_es: Fet
fr_fr: Effectué
uk_ua: Виконано

source: Drag, click left for final or intermediate points or right to cancel
ca_es: Arrossega, clic amb el botó esquerre per posar punts intermedis o final, amb el botó dret per cancel·lar
fr_fr: Glisser, clic gauche pour les points finaux ou intermédiaires ou droit de annuler
uk_ua: Перетягніть вказівник, клацніть лівою для позначення остаточної або проміжної точки, клацніть правою, щоб скасувати.

source: Duplicate
ca_es: Duplica
fr_fr: Dupliquer
uk_ua: Здублювати

source: Edit
ca_es: Edita
fr_fr: Edition
uk_ua: Правка

source: Error
fr_fr: Erreur
uk_ua: Помилка

source: Eval
fr_fr: Évaluation
uk_ua: Обчислити

source: Event links color? :
ca_es: Color dels enllaços a esdeveniments:
fr_fr: Couleur des liens évènement? :
uk_ua: Колір зв’язків між подіями:

source: Exit
ca_es: Surt
fr_fr: Quitter
uk_ua: Вийти

source: Export
ca_es: Exporta
fr_fr: Exporter
uk_ua: Експортувати

source: Export All
ca_es: Exporta-ho tot
fr_fr: Exporter tout
uk_ua: Експортувати все

source: Export in file %s failed
ca_es: Ha fallat l''exportació al fitxer %s
fr_fr: Exportation dans le fichier %s a échoué
uk_ua: Спроба експортування даних до файла %s завершилася невдало

source: File
ca_es: Fitxer
fr_fr: Fichier
uk_ua: Файл

source: Fit diagram to figure
ca_es: Encaixa el diagrama a la figura
fr_fr: Adapter le diagramme à la figure
uk_ua: Масштаб діаграми за рисунком

source: Flip
ca_es: Capgira
fr_fr: Pivoter
uk_ua: Віддзеркалити

source: Following palette(s) ignored (associated file(s) no more exist):
ca_es: S''ha ignorat les següents paletes (ja no existeix el seu fitxer associat):
fr_fr: La(les) palette(s) suivante(s) est(sont) ignorée(s) (le(s) dossier(s) associé(s) n''existe(nt) plus) :
uk_ua: Пропущено такі палітри (відповідних файлів вже не існує):

source: Foreground color ? :
ca_es: Color de primer pla:
fr_fr: Couleur de premier plan ? :
uk_ua: Колір тексту:

source: Format
ca_es: Formata
uk_ua: Формат

source: Free
ca_es: Lliure
fr_fr: Gratuit
uk_ua: Довільний

source: Get Info
ca_es: Obté informació
fr_fr: Obtenir les informations
uk_ua: Отримати відомості

source: Help
ca_es: Ajuda
fr_fr: Aide
uk_ua: Довідка

source: ID font definitions
ca_es: Definicions de font d''identificació
fr_fr: Définitions des ID des polices
uk_ua: Параметри шрифту ідентифікатора

source: ID fonts
ca_es: Fonts d''identificació
fr_fr: ID des polices
uk_ua: Шрифти ідентифікаторів

source: Icon
ca_es: Icona
fr_fr: Icône
uk_ua: Піктограма

source: Icon Editor
ca_es: Editor d''icones
fr_fr: Éditeur d''icônes
uk_ua: Редактор піктограм

source: Identification
ca_es: Identificació
uk_ua: Ідентифікація

source: It is impossible to set ID for this type of object
ca_es: No es poden establir identificadors per a aquest tipus d''objecte
fr_fr: Il est impossible de définir l''ID pour ce type d''objet
uk_ua: Встановити ідентифікатор для цього типу або об’єкта неможливо.

source: Label
ca_es: Etiqueta
fr_fr: Etiquettes
uk_ua: Мітка

source: Link
ca_es: Enllaç
fr_fr: Lien
uk_ua: Зв''язок

source: Link ID font name
ca_es: Nom de lletra de l''identificador d''enllaç
fr_fr: Nom de police de caractères de l''ID du lien
uk_ua: Гарнітура шрифту ідентифікатора зв’язку

source: Link ID font size
ca_es: Mida de lletra de l''identificador d''enllaç
fr_fr: Taille de la police de caractères de l''ID du lien
uk_ua: Розмір шрифту ідентифікатора зв’язку

source: Link parameters
ca_es: Paràmetres d''enllaç
fr_fr: Paramètres de lien
uk_ua: Параметри зв’язку

source: Load as Palette
ca_es: Carrega com una paleta
fr_fr: Charger en tant que palette
uk_ua: Завантажити як палітру

source: Mask
ca_es: Màscara
fr_fr: Masque
uk_ua: Маска

source: Mask can only be created for Super Blocks.
ca_es: Només podeu crear una màscara per a superblocs.
fr_fr: Les Masques ne peuvent être crées que pour les Super Blocks.
uk_ua: Маску можна створювати лише для суперблоків.

source: Modelica initialize
ca_es: Inicialitza la Modelica
fr_fr: Initialisation de Modelica
uk_ua: Ініціалізація Modelica

source: Modify title and menu labels.
ca_es: Modifica el títol i les etiquetes del menú.
fr_fr: Modifier les étiquettes de titre et de menu.
uk_ua: Змінити заголовок і пункти меню.

source: Move
ca_es: Mou
fr_fr: Déplacer
uk_ua: Пересунути

source: MoveLink
uk_ua: Пересунути зв’язок

source: Multiple selection cannot be used here
ca_es: No podeu seleccionar més d''un element
fr_fr: Le choix multiple ne peut pas être employé ici
uk_ua: Тут не можна використовувати одночасне позначення декількох об’єктів

source: Navigator window
ca_es: Finestra del navegador
fr_fr: Fenêtre de navigateur
uk_ua: Вікно навігації

source: New
ca_es: Nou
fr_fr: Nouveau
uk_ua: Створити

source: No
fr_fr: Non
uk_ua: Ні

source: No selected block in the current Scicos window.
ca_es: No heu seleccionat cap bloc a la finestra d''Scicos actual.
fr_fr: Aucun bloc sélectionné dans la fenêtre courante de Scicos.
uk_ua: У поточному вікні Scicos немає позначених блоків.

source: Only blocks can be selected for this operation.
ca_es: Per a aquesta operació només podeu seleccionar blocs.
fr_fr: Seuls des blocs peuvent être choisis pour cette opération.
uk_ua: Для виконання цієї дії можна позначати лише блоки.

source: Only one block can be selected in current window for this operation.
ca_es: Només podeu seleccionar un bloc a la finetra actual per a aquesta operació.
fr_fr: Un seul bloc peut être sélectionné dans la fenêtre actuelle pour cette opération.
uk_ua: Для виконання цієї дії потрібно позначити у поточному вікні лише один блок.

source: Open
ca_es: Obre
fr_fr: Ouvrir
uk_ua: Відкрити

source: Open a Scicos demonstration diagram
ca_es: Obre un diagrama de demostració d''Scicos
fr_fr: Ouvrir un diagramme de démonstration de Xcos
uk_ua: Відкрити приклад діаграми Scicos

source: Open a Scicos diagram
ca_es: Obre un diagrama d''Scicos
fr_fr: Ouvrir un diagramme de Xicos
uk_ua: Відкрити діаграму Scicos

source: Open/Set
ca_es: Obre/Estableix
fr_fr: Ouvrir/Régler
uk_ua: Відкрити/Визначити

source: Pal editor
ca_es: Editor Pal
fr_fr: Editeur de Palette
uk_ua: Редактор палітр

source: Palette
ca_es: Paleta
uk_ua: Палітра

source: Palettes
ca_es: Paletes
uk_ua: Палітри

source: Palettes Tree
ca_es: Arbre de paletes
fr_fr: Arbre de palettes
uk_ua: Ієрархія палітр

source: Paste
ca_es: Enganxa
fr_fr: Coller
uk_ua: Вставити

source: Place in Diagram
ca_es: Posa al diagrama
fr_fr: Placer dans le diagramme
uk_ua: Розташувати на діаграмі

source: PlaceinBrowser
ca_es: Posa al navegador
uk_ua: Розташувати у переглядачі

source: PlaceinDiagram
ca_es: Posa al diagrama
uk_ua: Розташувати на діаграмі

source: Please report
ca_es: Informeu
fr_fr: Faites un rapport svp
uk_ua: Будь ласка, повідомте нам

source: Popup
ca_es: Finestra emergent
fr_fr: Fenêtre qui apparaît
uk_ua: Контекстне вікно

source: Press left mouse button, drag region and release (right button to cancel)
fr_fr: Presser le bouton gauche de la sourie, glisser la région et relacher (bouton droit pour abandonner)
uk_ua: Натисніть ліву кнопку миші, перетягніть рамку для позначення області і відпустіть кнопку (правою кнопкою можна скасувати дію)

source: Problem saving a backup; I cannot activate Scilab
ca_es: S''ha produït un error en la còpia de seguretat. No es pot activar l''Scilab
fr_fr: Problème lors de la sauvegarde du backup ; Je ne peux pas activer Scilab
uk_ua: Проблем зі створенням резервної копії. Не вдалося задіяти Scilab

source: Problem while building library %s
ca_es: S''ha trobat un problema creant la llibreria %s
fr_fr: Un problème est arrivé en construisant la bibliothèque %s
uk_ua: Проблема під час спроби збирання бібліотеки %s

source: Properties
ca_es: Propietats
fr_fr: Propriétés
uk_ua: Властивості

source: Purge
ca_es: Neteja
fr_fr: Purger
uk_ua: Очистити

source: Region to Palette
ca_es: Passa la regió a una paleta
fr_fr: Région vers Palette
uk_ua: Область у палітру

source: Region to Super Block
ca_es: Passa la regió a un superbloc
fr_fr: Région vers Super Block
uk_ua: Область у суперблок

source: Regular links color ? :
ca_es: Color dels enllaços:
fr_fr: Couleur des liens réguliers ?:
uk_ua: Колір звичайних зв’язків:

source: Remove Atomic
ca_es: Elimina l''Atomic
fr_fr: Supprimer Atomique
uk_ua: Вилучити елементарний об’єкт

source: Remove Mask
ca_es: Elimina la màscara
fr_fr: Enlever le masque
uk_ua: Вилучити маску

source: Rename
ca_es: Canvia el nom
fr_fr: Renommer
uk_ua: Перейменувати
