Repository: scilab/scilab
Catalog: scilab/modules/scicos/locales_macros/*.po
Languages: ca_es, fr_fr, uk_ua

source: Replot
ca_es: Torna a dibuixar
fr_fr: Retracer
uk_ua: Перемалювати

source: Requested action: %s is not available
ca_es: L''acció demanada: %s no és disponible
fr_fr: Action demandée : %s n''est pas disponible
uk_ua: Вказана дія: не вдалося отримати доступ до %s

source: Resize
ca_es: Redimensiona
fr_fr: Redimensionner
uk_ua: Змінити розміри

source: Resize is allowed only for Blocks or Links.
ca_es: Només podeu redimensionar blocs o enllaços.
fr_fr: Le redimensionnement n''est permis que pour les blocs et les liens.
uk_ua: Змінювати розміри можна лише для блоків і зв’язків.

source: Rotate Left
ca_es: Gira a l''esquerra
fr_fr: Tourner vers la gauche
uk_ua: Обернути ліворуч

source: Rotate Right
ca_es: Gira a la dreta
fr_fr: Tourner vers la droite
uk_ua: Обернути праворуч

source: Run
ca_es: Executa
fr_fr: Exécuter
uk_ua: Виконати

source: Save
ca_es: Desa
fr_fr: Enregistrer
uk_ua: Зберегти

source: Save As
ca_es: Anomena i desa
fr_fr: Enregistrer sous...
uk_ua: Зберегти як

source: Save Block GUI
ca_es: Desa la interfície del bloc
fr_fr: Sauver l''UI du block
uk_ua: Зберегти графічний інтерфейс блоку

source: Save as Interf Func
ca_es: Desa com a Interf Func
fr_fr: Sauver en Interf Func
uk_ua: Зберегти як функцію Interf

source: Save as Palette
ca_es: Desa com a paleta
fr_fr: Sauvegarder une palette
uk_ua: Зберегти як палітру

source: Scicos Documentation
ca_es: Documentació d''Scicos
fr_fr: Documentation de Xcos
uk_ua: Документація з Scicos

source: Scicos version %s
ca_es: Versió d''Scicos %s
fr_fr: Version de Scicos %s
uk_ua: Версія Scicos %s

source: Scilab Graphics of %s
ca_es: Gràfics d''Scilab de %s
fr_fr: Graphiques de Scilab de %s
uk_ua: Графічні дані Scilab %s

source: Select a block.
ca_es: Seleccioneu un bloc.
fr_fr: Sélectionner un block
uk_ua: Позначте блок.

source: Select a directory path
ca_es: Seleccioneu el camí a un directori
fr_fr: Choisir un chemin de dossier
uk_ua: Виберіть шлях до каталогу

source: SelectAll
ca_es: Selecciona-ho tot
uk_ua: Вибрати все

source: SelectLink
ca_es: Selecciona un enllaç
uk_ua: Вибрати зв’язок

source: SelectRegion
ca_es: Selecciona una regió
uk_ua: Вибрати область

source: Set Block identification
ca_es: Indiqueu una identificació del bloc
fr_fr: Définir l''identification bloc
uk_ua: Встановити ідентифікатор блоку

source: Set Block sizes
ca_es: Indiqueu les mides del bloc
fr_fr: Définir la taille bloc
uk_ua: Встановити розміри блоку

source: Set Diagram Info
ca_es: Indiqueu la informació del diagrama
fr_fr: Définir l''information de diagramme
uk_ua: Визначити відомості щодо діаграми

source: Set grid
ca_es: Indiqueu la graella
fr_fr: Définir la grille
uk_ua: Визначити параметри сітки

source: Set link Identification
ca_es: Indiqueu la identificació de l''enllaç
fr_fr: Définir l''identification de lien
uk_ua: Встановити ідентифікацію зв’язків

source: Set link edition mode
ca_es: Indiqueu el mode d''edició de l''enllaç
fr_fr: Définir le mode d''édition de lien
uk_ua: Встановити режим редагування зв’язків

source: Setup
ca_es: Configura
fr_fr: Configurer
uk_ua: Налаштування

source: Shortcuts
ca_es: Dreceres de teclat
fr_fr: Raccourcis
uk_ua: Клавіатурні скорочення

source: Show Block Shadow
ca_es: Mostra l''ombra dels blocs
fr_fr: Afficher l''ombre du block
uk_ua: Показувати тіні від блоків

source: Simulate
ca_es: Simula
fr_fr: Simuler
uk_ua: Імітувати

source: Smart
ca_es: Intel·ligent
fr_fr: Rapide
uk_ua: Кмітливий

source: Smart Move
ca_es: Moviment intel·ligent
fr_fr: Déplacement intelligent
uk_ua: Кмітливе пересування

source: Smart move does not work yet with multiple selection
ca_es: El moviment intel·ligent encara no funciona amb seleccions múltiples
fr_fr: Le déplacement intelligent ne fonctionne pas avec une sélection multiple
uk_ua: Роботу кмітливого режиму пересування для позначення з декількох об’єктів ще не реалізовано

source: Sorry file name not defined in
ca_es: El nom de fitxer no està definit a
fr_fr: Désolé le nom de fichier n''est pas défini dans
uk_ua: Вибачте, назву файла не визначено у

source: Sorry: Only C or FORTRAN languages are supported
ca_es: Només estan suportats els llenguatges C o FORTRAN
fr_fr: Désolé : Seuls les langages C et Fortran sont supportés
uk_ua: Вибачте, передбачено підтримку лише мов C і FORTRAN

source: Stop
ca_es: Atura
fr_fr: Arrêter
uk_ua: Зупинити

source: The current icon depends on block parameter
ca_es: La icona actual depèn del paràmetre de bloc.
fr_fr: L''icône courant dépend des paramètres du bloc
uk_ua: Поточна піктограма залежить від параметра блоку

source: The key %s is already in use for %s
ca_es: La clau %s ja s''utilitza per a %s
fr_fr: La clef %s est déjà en service pour %s
uk_ua: Клавішу %s вже використано для %s

source: The key %s is not a valid letter
ca_es: La clau %s no és una lletra vàlida
fr_fr: La clef %s n''est pas une lettre valide
uk_ua: Клавіша %s не є клавішею літери

source: The parameter(s) %s must be defined in the
ca_es: El paràmetre %s s''ha de definir a
fr_fr: Le(s) paramètre(s) %s doit(doivent) être défini(s) dans
uk_ua: Параметри %s слід визначати у

source: Thickness
ca_es: Gruix
fr_fr: Épaisseur
uk_ua: Товщина

source: This block is not masked.
ca_es: Aquest bloc no té màscara.
fr_fr: Ce bloc n''est pas masqué.
uk_ua: Цей блок не замасковано.

source: This window is not an active palette
ca_es: Aquesta finestra no és una paleta activa
fr_fr: Cette fenêtre n''est pas une palette active
uk_ua: Це вікно не є активною палітрою

source: This window is not an active scicos window
ca_es: Aquesta finestra no és una finestra activa d''Scicos
fr_fr: Cette fenêtre n''est pas une fenêtre active de scicos
uk_ua: Це вікно не є активним вікном scicos

source: Title of the GUI
ca_es: Títol de la interfície
fr_fr: Titre de la GUI
uk_ua: Заголовок графічного інтерфейсу

source: To avoid this message, please update the %s.scicos_pal file.
ca_es: Per evitar aquest missatge, actualitzeu el fitxer %s.scicos_pal.
fr_fr: Pour éviter ce message, mettre svp le fichier %s.scicos_pal.
uk_ua: Щоб це повідомлення більше не з’являлося, будь ласка, оновіть файл %s.scicos_pal.

source: To reactivate Scicos, click on a diagram or type scicos();
ca_es: Per reactivar l''Scicos, feu clic en un diagrama o escriviu scicos();
fr_fr: Pour réactiver Scicos, cliquer sur un diagramme ou tapez xcos();
uk_ua: Щоб повторно активувати Scicos, клацніть на діаграмі або віддайте команду scicos();

source: Toggle grid
ca_es: Intercanvia la reixa
fr_fr: Basculer la grille
uk_ua: Увімкнути/Вимкнути показ сітки

source: Tools
ca_es: Eines
fr_fr: Outils
uk_ua: Інструменти

source: Type
ca_es: Tipus
uk_ua: Тип

source: Type not recognized
ca_es: Aquest tipus és desconegut
fr_fr: Type non reconnu
uk_ua: Тип не розпізнано

source: Undo
ca_es: Desfés
fr_fr: Défaire
uk_ua: Вернути

source: Up To Main Diagram
ca_es: Ves al diagrama principal
fr_fr: Jusqu''au diagramme principal
uk_ua: Вгору до основної діаграми

source: Use 3D aspect?
ca_es: Utilitzar aspecte en 3D?
fr_fr: Utiliser l''aspect 3D ?
uk_ua: Використовувати просторове представлення?

source: View
ca_es: Visualitza
fr_fr: Vue
uk_ua: Перегляд

source: Warning %d menus have identical name %s
ca_es: Avís: %d menús tenen el mateix nom %s
fr_fr: Attention %d menus ont des noms %s identiques
uk_ua: Попередження: у меню %d є пункти з тотожними назвами %s

source: Yes
ca_es: Sí
fr_fr: Oui
uk_ua: Так

source: Your diagram is not saved. Do not quit Scilab or
ca_es: No heu desat el diagrama. No tanqueu l''Scilab o
fr_fr: Votre diagramme n''est pas sauvegarder. Ne pas quitter Scilab ou
uk_ua: Вашу діаграму не було збережено. Не завершуйте роботу Scilab, інакше

source: Zoom in
ca_es: Apropa
fr_fr: Zoom avant
uk_ua: Збільшити

source: Zoom out
ca_es: Allunya
fr_fr: Zoom arrière
uk_ua: Зменшити

source: current choice is
ca_es: l''elecció actual és
fr_fr: le choix courant est
uk_ua: поточним вибором є

source: height
ca_es: alçada
fr_fr: hauteur
uk_ua: висота

source: scs_show active...
ca_es: scs_show està actiu...
fr_fr: scs_show actif...
uk_ua: задіяно scs_show…

source: width
ca_es: amplada
fr_fr: largeur
uk_ua: ширина
