Repository: scilab/scilab
Catalog: scilab/modules/fileio/locales/*/fileio.po
Languages: ja_jp, ru_ru

source: %s: %s format not recognized.
ja_jp: %s: %s フォーマットは認められませんでした。
ru_ru: %s: %s формат не распознан.

source: %s: An error occurred in %s: errno=%s
ja_jp: %s: %s でエラーが起きました: エラー = %s
ru_ru: %s: Произошла ошибка в %s: errno=%s

source: %s: An error occurred.
ja_jp: %s: エラーが起きました。

source: %s: An error occurred: %s
ja_jp: %s: エラーが起きました: %s
ru_ru: %s: Произошла ошибка: %s

source: %s: An error occurred: field %d is too long (< %d) for %%c directive.
ja_jp: %1$s: エラーが起きました: %%4$c 指令のためのフィールド %2$d は、あまりにも長いです(< %3$d)
ru_ru: %s: Произошла ошибка: поле %d слишком длинное (< %d) для указания %%c .

source: %s: An error occurred: field %d is too long (< %d) for %%s directive.
ja_jp: %1$s: エラーが起きました: %%4$s 指令のためのフィールド %2$d は、あまりにも長いです(< %3$d)
ru_ru: %s: Произошла ошибка: поле %d слишком длинное (< %d) для указания %%s .

source: %s: An error occurred: field %d is too long (> %d) for %%[ directive.
ja_jp: %1$s: エラーが起きました: %%4$[ 指令のためのフィールド %2$d があまりにも長いです(>%3$d)
ru_ru: %s: Произошла ошибка: поле %d слишком длинное (> %d) для указания %%[ .

source: %s: An error occurred: format is too long (> %d).
ja_jp: %s: エラーが起きました: フォーマットはあまりにも長いです(> %d)
ru_ru: %s: Произошла ошибка: формат слишком длинный (> %d).

source: %s: An error occurred: too many (> %d) conversion required.
ja_jp: %s: エラーが起きました: 多すぎる変換要求です(>%d)
ru_ru: %s: Произошла ошибка: требуется слишком много (> %d) преобразований.

source: %s: Cannot close file whose descriptor is %d: File is not active.
ja_jp: %s: 記述子が %d のファイルを閉じることができません: ファイルは活動していません。
ru_ru: %s: Не удалось закрыть файл с дескриптором %d: Файл не активен.

source: %s: Cannot close file whose descriptor is %d: No file to close.
ja_jp: %s: 記述子が %d のファイルを閉じることができません: 閉じるファイルはありません。
ru_ru: %s: Не удалось закрыть файл с дескриптором %d: Нет файла для закрытия.

source: %s: Cannot go to directory %s
ja_jp: %s: ディレクトリ %s に行けません
ru_ru: %s: Не удалось перейти в директорию %s

source: %s: Cannot go to directory.
ja_jp: %s: ディレクトリに行けません。

source: %s: Cannot open file %s.
ja_jp: %s: ファイル %s を開けません。
ru_ru: %s: Не удалось открыть файл %s.

source: %s: Cannot open file '%s'.
ja_jp: %s: ファイル '%s' を開けません。
ru_ru: %s: Не удалось открыть файл '%s'.

source: %s: Cannot read data in file '%s'.
ja_jp: %s: データをファイル '%s' に読み込めません。
ru_ru: %s: Не удалось прочитать данные из файла '%s'.

source: %s: Cannot read file whose descriptor is %d: File is not active.
ja_jp: %s: %d 記述子のファイルを開くことができません: ファイルは活動していません。

source: %s: Could not extend the number of files simultaneously open in Scilab.
ja_jp: %s: Scilabで同時に開かれたファイルの数を増やせません。
ru_ru: %s: Не удалось увеличить количество файлов одновременно открытых в Scilab.

source: %s: Data mismatch.
ja_jp: %s: まずいデータの組み合わせです。
ru_ru: %s: Данные не совпадают.

source: %s: Error while opening, reading or writing '%s'.
ja_jp: %s: 開いて読み込み中か、または、'%s' を書いているときにエラー
ru_ru: %s: Ошибка в процессе открытия, чтения или записи в '%s'.

source: %s: Error while opening, reading or writing.
ja_jp: %s: 開いて読み込み中か、または、書いているときにエラー
ru_ru: %s: Ошибка при открытии, чтении или записи.

source: %s: Error while trying to retrieve the name of the current directory.
ja_jp: %s: 現在のディレクトリ名を回復するよう試みている間にエラーが起こりました。
ru_ru: %s: Произошла ошибка при получении имени текущего каталога.

source: %s: Incorrect format.
ja_jp: %s: 不正確なフォーマット

source: %s: Invalid conversion.
ja_jp: %s: 無効なコンバージョン

source: %s: Memory allocation error.
ja_jp: %s: メモリ確保エラー.

source: %s: No File opened in Scilab.
ja_jp: %s: Scilabで開かれたファイルはありません。
ru_ru: %s: Нет открытых в Scilab файлов.

source: %s: No input file associated to logical unit %d.
ja_jp: %s: ロジカルユニット %d に関連した入力ファイルはありません。
ru_ru: %s: Нет входного файла, который связан с логическим блоком %d.

source: %s: No input file.
ja_jp: %s: 入力ファイルがありません。
ru_ru: %s: Нет входного файла.

source: %s: No more memory.
ja_jp: %s: これ以上メモリがありません。
ru_ru: %s: Не осталось доступной памяти.

source: %s: No such file %s.
ja_jp: %s: ファイル %s がありません。

source: %s: Options ignored.
ja_jp: %s: オプションを無視しました。
ru_ru: %s: Опции проигнорированы.

source: %s: Specified format cannot include any '\n'
ja_jp: %s: 指定されたフォーマットは他を含むことができません '\n'
ru_ru: %s: Задаваемый формат не может включать любые '\n'

source: %s: The file %s is not opened in scilab.
ja_jp: %s: ファイル %s はScilabで開いていません。

source: %s: Too many directives in scanf.
ja_jp: %s: scanfの多すぎる指令です。
ru_ru: %s: Слишком много указаний в scanf.

source: %s: Too many files opened!
ja_jp: %s: 開いているファイルの数が多すぎます.

source: %s: Warning : only extend the limit for the number of scilab's files opened simultaneously.
ja_jp: %s: 警告 : scilabの同時に開かれたファイル数のために単に限界を広げて下さい。
ru_ru: %s: Внимание : увеличен только предел количества одновременно открытых в Scilab файлов.

source: %s: Warning: Directory '%s' already exists.
ja_jp: %s: 警告: ディレクトリ '%s' は既にあります。
ru_ru: %s: Внимание: Каталог '%s' уже существует.

source: %s: Warning: Specified maximum number of files (%d) > Absolute maximum number of files allowed (%d).
ja_jp: %s: 警告: ファイル(%d)の指定された最大数 > 考慮した絶対ファイルの最大数(%d)。
ru_ru: %s: Внимание: Заданный максимум количества файлов (%d) больше абсолютного максимума файлов (%d).

source: %s: Wrong file descriptor: %d.
ja_jp: %s: 誤っているファイル記述子: %d
ru_ru: %s: Неверный дескриптор файла: %d.

source: %s: Wrong file mode: READ only.
ja_jp: %s: ファイルモードが不正: 読み取り専用
ru_ru: %s: Неверный режим файла: READ only.

source: %s: Wrong number of input argument(s).
ja_jp: %s: 入力引数の数が違います。
ru_ru: %s: Неверное количество входных аргументов.

source: %s: Wrong number of input arguments: %d expected.
ja_jp: %s: 入力引数の数が違います: %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d.

source: %s: Wrong number of input arguments: At least %d expected.
ja_jp: %s: 入力引数の数が違います: すくなくとも %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось как минимум %d.

source: %s: Wrong number of output argument(s).
ja_jp: %s: 入力引数の数が違います。
ru_ru: %s: Неверное количество выходных аргументов.

source: %s: Wrong number of output arguments: %d expected.
ja_jp: %s: 入力引数の数が違います: %d を想定します。

source: %s: Wrong size for input argument #%d ('%s'): Non-empty string expected.
ja_jp: %s: 入力引数 #%d ('%s') で不正なサイズ: 空でない文字を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d ('%s'): Строка не должна быть пустой.

source: %s: Wrong size for input argument #%d: A 1-by-n or m-by-1 array expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 1-by-n または m-by-1 配列 を想定します。
ru_ru: %s: Неверный размер входного аргумента №%d: Ожидался массив 1 x n или m x 1.

source: %s: Wrong size for input argument #%d: A String expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 文字を想定します。

source: %s: Wrong size for input argument #%d: A boolean expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ブーリアンを想定します。

source: %s: Wrong size for input argument #%d: A file descriptor expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ファイル記述子を想定します。

source: %s: Wrong size for input argument #%d: A filename expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ファイル名を想定します。

source: %s: Wrong size for input argument #%d: A integer expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 整数を想定します。

source: %s: Wrong size for input argument #%d: A m-by-1 array expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: m-by-1 配列 を想定します。

source: %s: Wrong size for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 文字を想定します。

source: %s: Wrong size for input argument #%d: Integer expected.
ja_jp: %s: 入力引数 #%d の大きさが間違っています: 整数を指定してください.

source: %s: Wrong size for input argument #%d: Must be less than %d characters.
ja_jp: %s: 入力引数 #%d で不正なサイズ: %d 文字以下でなくてはなりません。

source: %s: Wrong size for input argument #%d: Non-empty string expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 空でない文字を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась непустая строка.

source: %s: Wrong size for input argument #%d: Scalar expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: スカラーを想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалось число.

source: %s: Wrong size for input argument #%d: String or logical unit expected.
ja_jp: %s: 入力引数 #%d の大きさが間違っています: 文字列または論理値を指定してください.

source: %s: Wrong size for input argument: Scalar expected.
ja_jp: %s: 入力引数で不正なサイズ: スカラーを想定します。
ru_ru: %s: Неверный размер входного аргумента: Ожидался скаляр.

source: %s: Wrong type for input argument #%d: A String expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字を想定します。

source: %s: Wrong type for input argument #%d: A boolean expected.
ja_jp: %s: 入力引数 #%d で不正な型: ブーリアンを想定します。

source: %s: Wrong type for input argument #%d: A file descriptor expected.
ja_jp: %s: 入力引数 #%d で不正な型: ファイル記述子を想定します。

source: %s: Wrong type for input argument #%d: A filename or file descriptor expected.
ja_jp: %s: 入力引数 #%d で不正な型: ファイル名あるいはファイル記述子を想定します。

source: %s: Wrong type for input argument #%d: A integer expected.
ja_jp: %s: 入力引数 #%d で不正な型: 整数を想定します。

source: %s: Wrong type for input argument #%d: A integer or string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 整数、または、文字を想定します。

source: %s: Wrong type for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка.

source: %s: Wrong type for input argument #%d: A string.
ja_jp: %s: 入力引数 #%d で不正な型: 文字です。

source: %s: Wrong type for input argument #%d: Integer expected.
ja_jp: %s: 入力引数 #%d の型が間違っています: 整数を指定してください.

source: %s: Wrong type for input argument #%d: Matrix of floating point numbers expected.
ja_jp: %s: 入力引数 #%d で不正な型: 浮動小数点数の行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась матрица чисел с плавающей точкой.

source: %s: Wrong type for input argument #%d: Real values expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実値を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидались вещественные значения.

source: %s: Wrong type for input argument #%d: String array expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字配列を想定します。

source: %s: Wrong type for input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка.

source: %s: Wrong type for input argument #%d: String or logical unit expected.
ja_jp: %s: 入力引数 #%d の型が間違っています: 文字列または論理値を指定してください.

source: %s: Wrong type for input argument: A string expected.
ja_jp: %s: 入力引数で不正な型: 文字を想定します。
ru_ru: %s: Неверный тип входного аргумента: Ожидалась строка.

source: %s: Wrong type for input argument: Matrix expected.
ja_jp: %s: 入力引数で不正な型: 行列を想定します。
ru_ru: %s: Неверный тип входного аргумента: Ожидалась матрица.

source: %s: Wrong type for input argument: String expected.
ja_jp: %s: 入力引数で不正な型: 文字を想定します。
ru_ru: %s: Неверный тип входного аргумента: Ожидалась строка.

source: %s: Wrong type for input arguments: Strings expected.
ja_jp: %s: 入力引数で不正な型: 文字列を想定します。
ru_ru: %s: Неверный тип входных аргументов: Ожидались строки.

source: %s: Wrong value for input argument #%d (%s): '%s' or '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d (%s) で不正な値: '%s' または '%s' また '%s' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d (%s): Ожидалось '%s', '%s' или '%s'.

source: %s: Wrong value for input argument #%d ('%s'): Format not recognized.
ja_jp: %s: 入力引数 #%d ('%s') で不正な値: フォーマットは認められませんでした。
ru_ru: %s: Неверное значение входного аргумента #%d ('%s'): Формат не распознан.

source: %s: Wrong value for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な値です。

source: %s: Wrong value for input argument #%d: '%s' is an invalid path.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' は無効な pathです。
ru_ru: %s: Неверное значение входного аргумента #%d: '%s' не является корректным путём.

source: %s: Wrong value for input argument #%d: '%s' or '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' または '%s' また '%s' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось '%s', '%s' или '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s' または '%s' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось '%s', '%s' или '%s'.

source: %s: Wrong value for input argument #%d: ''w'' or ''u'' string expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''w'' または ''u'' 文字を想定します。

source: %s: Wrong value for input argument #%d: A valid file descriptor expected.
ja_jp: %s: 入力引数 #%d で不正な値: 適切なファイル記述子を想定します。

source: %s: Wrong value for input argument #%d: A valid filename or directory expected.
ja_jp: %s: 入力引数 #%d で不正な値: 適切なファイル名、または、ディレクトリ を想定します。

source: %s: Wrong value for input argument #%d: A valid format expected.
ja_jp: %s: 入力引数 #%d の値が間違っています: 正しい形式で指定してください.

source: %s: Wrong value for input argument #%d: Format not recognized.
ja_jp: %s: 入力引数 #%d で不正な値: フォーマットは認められませんでした。
ru_ru: %s: Неверное значение входного аргумента #%d: Формат не распознан.

source: %s: Wrong value for input argument #%d: Must be ''%s''.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' でなくてはなりません。
ru_ru: %s: Неверное значение входного аргумента #%d: Должно быть ''%s''.

source: %s: Wrong value for input argument: no empty string expected.
ja_jp: %s: 入力引数で不正な値: 空でない文字を想定します。

source: %s: Wrong value(s) for input argument(s).
ja_jp: %s: 入力引数で不正な値です。

source: %s: Wrong variable type (%s) found in ''%s''. File may be wrong or corrupted.
ja_jp: %s: ''%s'' で不正な変数型(%s)を見つけました、ファイルは、誤っているか無効です。
ru_ru: %s: Неверный тип переменной (%s) обнаружен в ''%s''. Файл может быть ошибочным или повреждённым.

source: %s: end of input reached before final conversion.
ja_jp: %s: 最終のコンバージョンの前に入力の終わりに達しました。

source: %s: error.
ja_jp: %s: エラー

source: %s: format is of 0 length.
ja_jp: %s: フォーマットは長さ 0 です。
ru_ru: %s: формат из нулевой длины.

source: %s: invalid filename %s.
ja_jp: %s: ファイル名が無効です %s

source: %s: invalid filename.
ja_jp: %s: ファイル名が不正です。

source: %s: invalid status.
ja_jp: %s: 無効なステータス。

source: %s: unknown format %s.
ja_jp: %s: 未知のフォーマット %s
ru_ru: %s: неизвестный формат %s.

source: Bad conversion.
ja_jp: 悪い変換です。
ru_ru: Плохое преобразование.

source: Can't get current directory.
ja_jp: 現在のディレクトリを得ることができません。

source: Can't go to directory %s.
ja_jp: ディレクトリ %s に行けません。

source: Can't go to directory %s: %s
ja_jp: ディレクトリ %s に移動できません: %s

source: Invalid buffer.
ja_jp: 無効なバッファです。

source: No input file
ja_jp: 入力ファイルがありません
ru_ru: Нет входного файла

source: Not enough entries.
ja_jp: 入力が不足しています。
ru_ru: Не достаточно элементов.

source: Unknown error.
ja_jp: 不明のエラーです。

source: Warning: Could not open directory %s: %s
ja_jp: 警告: ディレクトリ %s を開けません: %s

source: Warning: Could not remove directory %s: %s
ja_jp: 警告: ディレクトリ %s を抹消できません: %s
ru_ru: Внимание: Не возможно удалить каталог %s: %s

source: Warning: Could not remove file %s: %s
ja_jp: 警告: ファイル %s を抹消できません: %s
ru_ru: Внимание: Не возможно удалить файл %s: %s

source: Warning: Error while opening %s: %s
ja_jp: 警告: %s を開いている最中にエラー: %s
ru_ru: Внимание: Ошибка при открытии %s: %s

source: Warning: file '%s' already opened in Scilab.
ja_jp: 警告: ファイル '%s' は既に Scilabで開かれています。
ru_ru: Внимание: файл '%s' уже открыт в Scilab.

source: unclosed [ directive.
ja_jp: 閉じられません [ 指令
ru_ru: незакрытое указание '['.

source: %s: Wrong value for input argument #%d: %s expected.
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось %s.

source: %s: Wrong number of input arguments.
ru_ru: %s: Неверное количество входных аргументов.

source: %s: Source directory %s does not exist or is unreadable.
ru_ru: %s: Исходный каталог %s не существует или недоступен для чтения.

source: %s: Source file %s does not exist or unable to access.
ru_ru: %s: Исходный файл %s не существует или недоступен.

source: %s: Destination directory %s does not exist or is unreadable.
ru_ru: %s: Каталог назначения %s не существует или недоступен для чтения.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' or ''%s'' expected.
ru_ru: %s: Неверное значение входного аргумента №%d: Ожидалось ''%s'', ''%s'' или ''%s''.

source: %s: Wrong size for input argument: A string expected.
ru_ru: %s: Неверный тип входного аргумента: Ожидалась строка.

source: %s: Wrong size for input argument: Must be less than %d characters.
ru_ru: %s: Неверный размер входного аргумента: Должно быть не более %d символов.

source: %s: Wrong number of input arguments: Must be > 0.
ru_ru: %s: Неверное количество входных аргументов: Должно быть больше нуля.

source: %s: Wrong number of input arguments: at most %d expected.
ru_ru: %s: Неверное количество входных аргументов: ожидалось не более %d.

source: %s: Wrong number of input arguments: data doesn't fit with format.
ru_ru: %s: Неверное количество входных аргументов: данные не соответствуют формату.

source: %s: Wrong value of input argument %d: data doesn't fit with format.
ru_ru: %s: Неверное значение входного аргумента №%d: данные не подходят под формат.

source: %s: Not enough arguments.
ru_ru: %s: Недостаточно аргументов.

source: Buffer too small.
ru_ru: Буфер слишком мал.

source: %s: Bad conversion 'l' or 'h' flag mixed with 's' directive.
ru_ru: %s: Плохое преобразование: флаг 'l' или 'h' совмещён с указанием 's'.

source: %s: Bad conversion 'l' or 'h' flag mixed with 'c' directive.
ru_ru: %s: Плохое преобразование: флаг 'l' или 'h' совмещён с указанием 'c'.

source: 'o' format not allowed.
ru_ru: Недопустимый формат 'o'.
