Repository: scilab/scilab
Catalog: scilab/modules/linear_algebra/locales_macros/*.po
Languages: fr_fr

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s : Arguments d''entrée n°%d et n°%d incompatibles : Même dimension attendue.

source: %s: SVD and QR not implemented in sparse.
fr_fr: %s: SVD et QR ne sont pas implémentés pour sparse.

source: %s: This feature has not been implemented.
fr_fr: %s : Cette fonction n''a pas encore été implémentée.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d attendus.

source: %s: Wrong size for input argument #%d: A column vector expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un vecteur colonne attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un scalaire attendu.

source: %s: Wrong size for input argument #%d: A square matrix expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Une matrice carrée attendue.

source: %s: Wrong size for input argument #%d: Symmetric expected
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Symétrique attendue

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Doit être dans l''ensemble {%s}.

source: %s: Wrong value for input argument #%d: Non-negative integer expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Entier non négatif attendu.

source: %s: Wrong value for input argument #%d: Not semi-definite positive
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Non semi-définie positive

source: %s: Wrong value for input argument #%d: Requested rank is greater than matrix dimension.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Le rang demandé est plus grand que la dimension de la matrice.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
fr_fr: %s : Mauvaise valeurs pour l''argument d''entrée n°%d : Un entier non-négatif attendu.

source: %s: Wrong values for input argument #%d: Non-negative scalar expected.
fr_fr: %s: Mauvaise valeurs pour l''argument d''entrée n° %d: Scalaire non négatif attendu.
