Repository: scilab/scilab
Catalog: scilab/modules/special_functions/locales/*/special_functions.po
Languages: fr_fr, pt_br

source: %s: Wrong type for input argument #%d: Real expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Réel attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Experava-se um número real.

source: %s: Wrong type for input argument #%d or #%d: No complex input argument expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d ou n° %d: Pas d'argument d'entrée complexe attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d ou #%d: Não era esperado nenhum argumento de entrada complexo.

source: %s: Wrong value for input arguments: Must be > %d.
fr_fr: %s: Mauvaise valeur pour les arguments d'entrée: Doit être > %d.
pt_br: %s: Valor errado para os argumentos de entrada: Deve ser > %d.

source: %s: Wrong type for first input argument.
fr_fr: %s: Mauvais type pour le premier argument en entrée.
pt_br: %s: Valor errado para o primeiro argumento de entrada.

source: %s: Wrong type for input argument #%d.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Only one of arg1 and arg2 may be a vector.
fr_fr: %s: Seulement un de arg1 et arg2 doit être un vecteur.
pt_br: %s: Apenas um de arg1 e arg2 deve ser um vetor.

source: %s: Wrong type for input argument #%d: Real matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice réelle attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de números reais.

source: %s: Wrong value for input argument #%d: Matrix with elements in (%d,%d) expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Matrice avec des éléments dans (%d,%d) attendue.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se matriz com elementos em (%d,%d).

source: %s: overflow or underflow of an extended range number
fr_fr: %s: débordement d'un nombre à précision étendu
pt_br: %s: overflow ou underflow de um número de intervalo estendido

source: %s: error number %d
fr_fr: %s: numéro d'erreur %d
pt_br: %s: erro número %d
