Repository: scilab/scilab
Catalog: scilab/modules/randlib/locales/*/randlib.po
Languages: fr_fr, pt_br

source: Random
fr_fr: Aléatoire
pt_br: Randômico

source: %s: Wrong number of input argument: %d expected with option '%s'.
fr_fr: %s: Mauvais nombre d'argument d'entrée: %d attendu(s) avec l'option '%s'.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se %d com a opção '%s'.

source: %s: Wrong number of output argument: %d expected the option '%s'.
fr_fr: %s: Mauvais nombre d'argument de sortie: %d attendu(s) avec l'option '%s'.
pt_br: %s: Número errado de argumentos de saída: Esperava-se %d com a opção '%s'.

source: The %s option affects only the clcg4 generator
fr_fr: L'option %s affecte seulement le générateur clcg4
pt_br: A opção %s afeta apenas o gerador clcg4

source: %s: Wrong number of input arguments: %d expected with option '%s'.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendu(s) avec l'option '%s'.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se %d com a opção '%s'.

source: %s: Wrong type for second input argument: Scalar expected.
fr_fr: %s: Mauvais type pour le second argument d'entrée: Scalaire attendu.
pt_br: %s: Tipo errado para o segundo argumento de entrada: Esperava-se um escalar.

source: %s: Wrong type for third input argument: Scalar expected.
fr_fr: %s : Troisième argument d'entrée de mauvais type : scalaire attendu.
pt_br: %s: Tipo errado para o terceiro argumento de entrada: Esperava-se um escalar.

source: %s: Wrong type for fourth input argument: Scalar expected.
fr_fr: %s: Mauvais type pour le quatrième argument d'entrée: Scalaire attendu.
pt_br: %s: Tipo errado para o quarto argumento de entrada: Esperava-se um escalar.

source: %s: Wrong type for fifth input argument: Scalar expected.
fr_fr: %s: Mauvais type pour le cinquième argument d'entrée: Scalaire attendu.
pt_br: %s: Tipo errado para o quinto argumento de entrada: Esperava-se um escalar.

source: %s: Wrong number of input arguments: %d expected for '%s' with the %s generator.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendus pour '%s' avec le générateur %s.
pt_br: %s: Tipo errado para argumentos de entrada: Esperava-se %d para '%s' com o gerador %s.

source: %s: Wrong values for input argument: Vector of %d or %d values for %s expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: Un vecteur de %d ou %d valeurs pour %s attendu.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se um vetor de %d ou %d valores para %s.

source: %s: Wrong size for second input argument: %dx%d expected.
fr_fr: %s: Mauvaise dimension pour le second argument d'entrée: %dx%d attendu.
pt_br: %s: Valor errado para o segundo argumento de entrada: Esperava-se %dx%d.

source: %s: Wrong number of input arguments: %d or %d expected for '%s' option with the %s generator.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d ou %d attendus pour l'option '%s' avec le générateur %s.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se %d o %d para a opção '%s' com o gerador %s.

source: %s: Wrong number of input arguments: expected %d for '%s' option with the %s or %s generator.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendus pour l'option '%s' avec le générateur %s ou %s.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se %d para a opção '%s' com o gerador %s ou %s.

source: %s: Wrong number of input arguments: %d expected for '%s' option with the %s generator.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendus pour l'option '%s' avec le générateur %s.
pt_br: %s: Número errado para os argumentos de entrada: Esperava-se %d para a opção '%s' com o gerador %s.

source: %s: Wrong number of output argument: %d expected with option '%s'.
fr_fr: %s: Mauvais nombre d'argument de sortie: %d attendus avec l'option '%s'.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se %d com a opção '%s'.

source: %s: The %s option affects only the %s generator
fr_fr: %s: L'option %s affecte seulement le générateur %s
pt_br: %s: A opção %s afeta apenas o gerador %s

source: %s: Wrong value for second input argument: %d, %d or %d expected.
fr_fr: %s: Mauvaise valeur pour le second argument d'entrée: %d, %d ou %d attendus.
pt_br: %s: Valor errado para o segundo argumento de entrada: Esperava-se %d, %d ou %d.

source: The %s option affects only the %s generator
fr_fr: L'option %s affecte seulement le générateur %s
pt_br: A opção %s afeta apenas o gerador %s

source: %s: Wrong value for second input argument: Must be between %d and %d.
fr_fr: %s: Mauvaise valeur du second argument d'entrée: Doit être entre %d et %d.
pt_br: %s: Valor errado para o segundo argumento de entrada: Deve estar entre %d e %d.

source: %s: Wrong value for second input argument: Must be > %d.
fr_fr: %s:Mauvaise valeur pour le second argument en entrée: Doit être > %d.
pt_br: %s: Valor errado para o segundo argumento de entrada: Deve ser > %d.

source: This information concerns only the clcg4 generator
fr_fr: Cette information concerne seulement le générateur clcg4
pt_br: Esta informação concerne apenas ao gerador clcg4

source: %s: Wrong value for second input argument: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: %s: Mauvaise valeur pour le second argument d'entrée: '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.
pt_br: %s: Valor errado para o segundo argumento de entrada: Esperava-se '%s', '%s', '%s', '%s', '%s' ou '%s'.

source: %s Wrong value for first input argument %s.
fr_fr: %s Mauvaise valeur pour le premier argument d'entrée %s.
pt_br: %s Valor errado para o primeiro argumento de entrada %s.

source: %s: Wrong type for first input argument: Scalar expected.
fr_fr: %s : Premier argument d'entrée de mauvais type : scalaire attendu.
pt_br: %s: Tipo errado para o primeiro argumento de entrada: Esperava-se um escalar.

source: Missing A and B for beta law
fr_fr: A et B manquants pour la loi beta
pt_br: Faltando A e B para a lei beta

source: %s: Wrong size for input argument: Scalar expected for %s.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée: Un scalaire attendu pour %s.
pt_br: %s: Tamanho errado para o argumento de entrada: Esperava-se um escalar para %s.

source: Rand(...,'bet',..): A or B < %f
fr_fr: Rand(...,'bet',..): A ou B < %f
pt_br: Rand(...,'bet',..): A ou B < %f

source: Missing Dfn and Dfd for F law
fr_fr: Dfn et Dfd manquants pour la loi F
pt_br: Faltando Dfn e Dfd para a lei F

source: Degrees of freedom nonpositive
fr_fr: Degrés de liberté non positif
pt_br: Graus de liberdade não-positivos

source: %s: Wrong value for first input argument: Must be the number of random deviate.
fr_fr: %s: Mauvaise valeur pour le premier argument d'entrée: Doit être le nombre de déviation aléatoire.

source: Missing N and P for MULtinomial law
fr_fr: N et P manquants pour la loi MULtinomiale
pt_br: Faltando N e P para a lei MULtinomial

source: %s: Wrong size for input argument: Column vector expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée: Vecteur colonne attendu.
pt_br: %s: Tamanho errado para o argumento de entrada: Esperava-se um vetor coluna.

source: Ncat <= 1
fr_fr: N < 0

source: Sum of P(i) > 1
fr_fr: Somme de P(i) > 1
pt_br: Soma de P(i) > 1

source: Missing shape and scale for Gamma law
fr_fr: shape et scale manquants pour la loi Gamma
pt_br: Faltando forma e escala para a lei Gamma

source: grand(..'gam',A,R) : A <= 0.0 or R <= 0.0
fr_fr: grand(..'gam',A,R) : A <= 0.0 ou R <= 0.0
pt_br: grand(..'gam',A,R) : A <= 0.0 ou R <= 0.0

source: Missing Av and Sd for Normal law
fr_fr: Av et Sd manquants pour la loi Normale
pt_br: Faltando Av e Sd para a lei Normal

source: Missing Low and High for Uniform Real law
fr_fr: Low et High manquants pour la loi réelle Uniforme
pt_br: Faltando Low e High para a lei Uniforme Real

source: %s: Wrong type for input argument: Scalar expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Scalaire attendu.
pt_br: %s: Tipo errado para argumento de entrada: Esperava-se um escalar.

source: Missing Low and High for Uniform int law
fr_fr: Low et High manquants pour la loi uniforme entière
pt_br: Faltando Low e High para a lei Uniforme inteira

source: a and b must integers with (b-a+1) <= 2147483561
fr_fr: a et b doivent être entiers avec (b-a+1) <= 2147483561
pt_br: a e b devem ser inteiros com (b-a+1) <= 2147483561

source: %s: Wrong value for input argument: Number of random simulation expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: Nombre de simulations aléatoires attendu.
pt_br: %s: Valor errado para o argumento de entrada: Esperava-se número de simulação randômica.

source: Missing vect for random permutation
fr_fr: vect manquant pour la permutation aléatoire
pt_br: Faltando vect para permutação randômica

source: %s: Wrong type for input argument: Column vector expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Vecteur colonne attendu.
pt_br: %s: Tipo errado para argumento de entrada: Esperava-se um vetor-coluna.

source: Missing N and P for Negative Binomial law
fr_fr: N et P manquants pour la loi Binomiale négative
pt_br: Faltando N e P para a lei Binomial Negativa

source: P is not in [0,1]
fr_fr: P n'est pas dans [0,1]
pt_br: P não está em [0,1]

source: Missing N and P for Binomial law
fr_fr: N et P manquants pour la loi Binomiale
pt_br: Faltando N e P para a lei Binomial

source: %s: Wrong value for first input argument: Must be the number of random simulation.
fr_fr: %s: Mauvaise valeur pour le premier argument d'entrée: Doit être le nombre de simulations aléatoires.
pt_br: %s: Valor errado para o primeiro argumento de entrada: Deve ser o número de simulação randômica

source: Missing Mean and Cov for Multivariate Normal law
fr_fr: Mean et Cov manquants pour la loi Normale Multivariée
pt_br: Faltando Mean e Cov para a lei Multivariante Normal

source: %s: Wrong type for input argument: Square matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Matrice carrée attendue.
pt_br: %s: Tipo errado de argumento de entrada: Esperava-se uma matriz quadrada.

source: %s: Wrong type for input arguments: Mean and Cov have incompatible dimensions
fr_fr: %s: Mauvais type pour les arguments d'entrée: Mean et Cov ont des dimensions incompatibles
pt_br: %s: Tipos errados para argumentos de entrada: Mean e Cov possuem dimensões incompatíveis

source: %s: Wrong size for input arguments: Mean and Cov are of null size.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée: Mean et Cov sont de taille nulle.
pt_br: %s: Tamanho errado para os argumentos de entrada: Mean e Cov possuem tamanhos nulos.

source: %s: Missing P matrix and X0 for Markov chain
fr_fr: %s: La matrice P et X0 sont manquants pour la chaîne de Markov
pt_br: %s: Faltando a matriz P e X0 para a cadeia de Markov

source: %s: Wrong second input argument: Square matrix or row vector expected.
fr_fr: %s: Mauvais second argument d'entrée: Matrice carrée ou un vecteur ligne attendu.
pt_br: %s: Segundo argumento de entrada errado: Esperava-se uma matriz quadrada ou um vetor-linha.

source: X0 is empty
fr_fr: X0 est vide
pt_br: X0 é vazia

source: %s: X0(%d) must be in the range [1,%d]
fr_fr: %s: X0(%d) doit être dans la plage [1,%d]
pt_br: %s: X0(%d) deve estar no intervalo [1,%d]

source: Sum of P(%d,1:%d)=%f ~= 1
fr_fr: Somme de P(%d,1:%d)=%f ~= 1
pt_br: Soma de P(%d,1:%d)=%f ~= 1

source: %s: Wrong number of input argument.
fr_fr: %s: Mauvais nombre d'argument d'entrée.
pt_br: %s: Quantidade errada de argumentos de entrada.

source: Missing Df and Xnonc for non-central chi-square law
fr_fr: Df et Xnonc manquants pour la loi du chi carré non centrée
pt_br: Faltando Df e Xnonc para a lei do Chi-quadrado não-central

source: DF < 1 or XNONC < 0
fr_fr: DF < 1 ou XNONC < 0
pt_br: DF < 1 ou XNONC < 0

source: Missing Dfn, Dfd and Xnonc for non-central F law
fr_fr: Dfn, Dfd et Xnonc manquants pour la loi F non centrée
pt_br: Faltando Dfn, Dfd e Xnonc para a lei F não-central

source: DF < 1.0 or DF <= 0.0 or Xnonc < 0.0
fr_fr: DF < 1.0 ou DF <= 0.0 ou Xnonc < 0.0
pt_br: DF < 1.0 ou DF <= 0.0 ou Xnonc < 0.0

source: Missing Df for chi-square law
fr_fr: Df manquant pour la loi du chi carré
pt_br: Faltando Df para a lei do Chi-quadrado

source: Missing Av for Poisson law
fr_fr: Av manquant pour la loi de Poisson
pt_br: Faltando Av para a lei de Poisson

source: Missing p for Geometric law
fr_fr: p manquant pour la loi Géométrique
pt_br: Faltando p para a lei Geométrica

source: %s: Wrong value for input argument: Must be between '%s' and %d.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: Doit être entre '%s' et %d.
pt_br: %s: Valor errado para o argumento de entrada: Deve estar entre '%s' e %d.

source: Missing Av for exponential law
fr_fr: Av manquant pour la loi Exponentielle
pt_br: Faltando Av para a lei exponencial

source: %s: Wrong value for input argument %s.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée %s.
pt_br: %s: Valor errado para o argumento de entrada %s.

source: Bad seeds for clcg2, must be integers with s1 in [1, 2147483562] and s2 in [1, 2147483398]
fr_fr: Mauvaises souches pour clcg2, doit être des entiers avec s1 dans [1, 2147483562] et s2 dans [1, 2147483398]
pt_br: Seeds ruins para clcg2, devem ser inteiros com s1 em [1, 2147483562] e s2 em [1, 2147483398]

source: bad seeds for clcg4, must be integers with s1 in [1, 2147483646] s2 in [1, 2147483542] s3 in [1, 2147483422] s4 in [1, 2147483322]
fr_fr: mauvaises souches pour clcg4, doit être des entiers avec s1 dans [1, 2147483646] s2 in [1, 2147483542] s3 in [1, 2147483422] s4 in [1, 2147483322]
pt_br: seeds ruins para clcg4, devem ser inteiros com s1 em [1, 2147483646] s2 em [1, 2147483542] s3 em [1, 2147483422] s4 em [1, 2147483322]

source: => be aware that you have may lost synchronization between the virtual gen %d and the others ! use grand("setall", s1, s2, s3, s4) if you want recover it.
fr_fr: => soyez conscient que la synchronisation a pu être perdue entre le le gen virtuel %d et les autres ! utilisez grand("setall", s1, s2, s3, s4) si vous voulez retrouver la synchronisation.
pt_br: => tenha em mente que você pode ter perdido a última sincronização entre o gerador virtual %d e os outros ! use grand("setall", s1, s2, s3, s4) para recuperá-la.

source: Bad seed for fsultra, must be integers in [0, 2^32-1]
fr_fr: Mauvaise souche pour fsultra, doit être un entier dans l'interval [0, 2^32-1]
pt_br: Seed ruim para fsultra, os inteiros devem estar em [0, 2^32-1]

source: The first component of the fsultra state, must be an int in [0, %d]
fr_fr: La première composante de l'état fsultra doit être un entier dans l'intervalle [0, %d]
pt_br: O primeiro componente do estado fsultra, deve ser um inteiro em [0, %d]

source: The second component of the fsultra state, must be 0 or 1
fr_fr: La seconde composante de l'état fsultra doit être 0 ou 1
pt_br: O segundo componente do estado fsultra, deve ser 0 ou 1

source: The third component of the fsultra state, must be an int in [1, 2^32-1]
fr_fr: La troisième composante de l'état fsultra doit être un entier dans l'intervalle [1, 2^32-1]
pt_br: O terceiro componente do estado fsultra, deve ser um inteiro em [1, 2^32-1]

source: Bad seeds for kiss, must be integers in [0,2^32-1]
fr_fr: Mauvaises souches pourr kiss, doit être des entiers compris dans l'interval [0,2^32-1]
pt_br: Seeds ruins para kiss, devem ser inteiros em [0,2^32-1]

source: Bad seed for mt, must be an int in [0, 2^32-1]
fr_fr: Mauvaise souche pour mt, doit être un entier dans l'intervalle [0, 2^32-1]
pt_br: Seed ruim para mt, deve ser um inteiro em [0, 2^32-1]

source: The first component of the mt state mt, must be an int in [1, 624]
fr_fr: La première composante de l'état mt, doit être un entier dans l'intervalle [1, 624]
pt_br: O primeiro componente do estado mt, deve ser um inteiro em [1, 624]

source: Bad seed for urand, must be an int in [0, 2147483647]
fr_fr: Mauvaise souche pour urand, doit être un entier dans l'intervalle [0, 2147483647]
pt_br: Seed ruim para urand, deve ser um inteiro em [0, 2147483647]

source: Scilab randlib interface not installed.
fr_fr: L'interface Scilab randlib n'est pas installée.
pt_br: A interface Scilab randlib não está instalada.
