Repository: scilab/scilab
Catalog: scilab/modules/core/locales_macros/*.po
Languages: fr_fr

source: loading initial environment
fr_fr: Chargement de l''environnement de travail

source: by
fr_fr: par

source: %s called at line %s of %s
fr_fr: %s appelé à la ligne %s de %s

source: %s called at line %s of %s instruction.
fr_fr: %s appelé à la ligne %s de l''instruction %s.

source: %s called at line %s of macro %s
fr_fr: %s appellé à la ligne %s de la macro %s

source: %s called under %s
fr_fr: %s appelé sous %s

source: %s: %s is a uneditable hard coded function.
fr_fr: %s : %s est une fonction non éditable.

source: %s: File doesn''t exist: %s
fr_fr: %s : Le fichier n''existe pas : %s

source: %s: No perl command specified.
fr_fr: %s : Commande perl non fournie.

source: %s: Please check: %s.
fr_fr: %s : Merci de vérifier : %s.

source: %s: Requires scilab editor.
fr_fr: %s: Nécessite l''éditeur Scilab.

source: %s: System error: Command executed: %s
fr_fr: %s : Erreur système : Commande exécutée : %s.

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n''existe pas.

source: %s: Unable to find Perl file: %s
fr_fr: %s : Impossible de trouver le fichier Perl : %s

source: %s: Unable to find Perl in ''%s''
fr_fr: %s : Impossible de trouver Perl dans ''%s''

source: %s: Unable to find Perl.
fr_fr: %s : Impossible de trouver Perl.

source: %s: Wrong input argument #%d: Path to a scilab script file expected.
fr_fr: %s : Mauvais argument d''entrée n°%d : Un chemin vers un script Scilab attendu.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : Au moins %d attendus.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d attendus.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre d''arguments d''entrée incorrect : %d au moins sont attendus.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l''argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: Strings expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée %d : Chaîne attendue.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: Defined variable expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Une variable définie attendue.

source: &Control
fr_fr: &Contrôle

source: &Edit
fr_fr: &Edition

source: &File
fr_fr: &Fichier

source: &Preferences
fr_fr: &Préférences

source: &Toolboxes
fr_fr: Boites à ou&tils

source: Bytes
fr_fr: Octets

source: Checking: %s
fr_fr: Vérification : %s

source: Name
fr_fr: Nom

source: Size
fr_fr: Taille

source: Startup execution:
fr_fr: Initialisation :

source: User variables are:
fr_fr: Vos variables sont :

source: Using %s elements ouf of %s
fr_fr: Utilise %s éléments sur %s
