Repository: scilab/scilab
Catalog: scilab/modules/spreadsheet/locales/*/spreadsheet.po
Languages: fr_fr

source: %s: Wrong input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s: Mauvais argument d'entrée n° %d: ''%s'' ou ''%s'' attendu.

source: The file %s does not exist.
fr_fr: Le fichier %s n'existe pas.

source: %s: File %s is not an ole2 file.
fr_fr: %s: Le fichier %s n'est pas un fichier ole2.

source: %s: Cannot open file %s.
fr_fr: %s: Ne peut pas ouvrir le fichier %s.

source: %s: There is no xls stream in the ole2 file %s.
fr_fr: %s: Il n'y a pas de flux xls dans le fichier ole2 %s.

source: %s: Not an ole2 file.
fr_fr: %s: Ce n'est pas un fichier ole2.

source: %s: The file has no Workbook directory.
fr_fr: %s : Le fichier n'a pas de répertoire Workbook.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.

source: %s: Incorrect or corrupted file.
fr_fr: %s: Fichier incorrect ou corrompu.

source: %s: Only BIFF8 file format is handled.
fr_fr: %s: Uniquement le format de fichier BIFF8 est géré.

source: %s: Wrong type for input argument #%d: Scalar expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un scalaire attendu.

source: %s: Failed to read expected data, may be invalid xls file.
fr_fr: %s: Echec de lecture des données attendues, le fichier xls est peut être invalide.

source: %s: End of file.
fr_fr: %s: Fin de fichier.

source: LOGGER_set_logfile: ERROR - Cannot open logfile '%s' (%s)
fr_fr: LOGGER_set_logfile: ERREUR - Ne peux pas ouvrir le fichier de log '%s' (%s)

source: LOGGER_set_logfile: ERROR - Cannot open logfile '%s' (%s)
fr_fr: LOGGER_set_logfile: ERREUR - Ne peux pas ouvrir le fichier de log '%s' (%s)

source: %s:%d:OLE_set_debug: Debug level set to %d
fr_fr: %s:%d:OLE_set_debug: Le niveau de débuggage est réglé sur %d

source: %s:%d:OLE_get_block:ERROR: Block buffer is NULL
fr_fr: %s:%d:OLE_get_block:ERROR: Le block buffer est NULL

source: %s:%d:OLE_get_block:ERROR: Cannot allocate %d bytes for OLE block
fr_fr: %s:%d:OLE_get_block:ERROR: Ne peut pas allouer %d bytes pour le block OLE

source: %s:%d:OLE_get_block:ERROR: Seek failure (block=%d:%d)
fr_fr: %s:%d:OLE_get_block:ERROR: Echec de Seek (block=%d:%d)

source: %s:%d:Mismatch in bytes read. Requested %d, got %d
fr_fr: %s:%d: Décalage dans les bytes lus. Requis %d, obtenus %d

source: %s:%d:OLE_get_block:ERROR: OLE file is closed
fr_fr: %s:%d:OLE_get_block:ERREUR: Le fichier OLE est fermé

source: %s:%d:OLE_load_FAT:ERROR: Unable to allocate %d bytes
fr_fr: %s:%d:OLE_load_FAT:ERREUR: Ne peux pas allouer %d bytes

source: %s:%d:OLE_load_FAT:ERROR: Not able to load block, import sector = 0x%x, fat position = 0x%x
fr_fr: %s:%d:OLE_load_FAT:ERREUR: Ne peux pas charger le block, secteur importé = 0x%x, position fat = 0x%x

source: %s:%d:OLE_load_FAT:ERROR: FAT memory boundary limit exceeded %p >= %p
fr_fr: %s:%d:OLE_load_FAT:ERROR: La limite de mémoire FAT dépassée %p >= %p

source: %s:%d:OLE_load_FAT:ERROR: sector request was negative (%d)
fr_fr: %s:%d:OLE_load_FAT:ERREUR: le secteur demandé était négatif (%d)

source: %s:%d:OLE_get_miniblock:ERROR: Failed to allocate enough memory for miniChain
fr_fr: %s:%d:OLE_get_miniblock:ERREUR: Ne peux pas allouer suffisamment de mémoire pour miniChain

source: %s:%d:OLE_load_chain:ERROR: Load-chain went over memory boundary
fr_fr: %s:%d:OLE_load_chain:ERREUR: La chaîne de cargement a dépassé la limite de mémoire

source: %s:%d:OLE_open_file:ERROR: Cannot locate file '%s' for opening (%s)
fr_fr: %s:%d:OLE_open_file:ERROR: Ne peux pas localiser le fichier '%s' pour ouvrir (%s)

source: %s:%d:OLE_open_file:ERROR:Cannot open %s for reading (%s)
fr_fr: %s:%d:OLE_open_file:ERREUR: Ne peux pas ouvrir %s en lecture (%s)

source: %s:%d:OLE_open_directory:ERROR: %s
fr_fr: %s:%d:OLE_open_directory:ERREUR: %s

source: %s:%d:OLE_store_stream:ERROR: Cannot compose full filename string from '%s' and '%s'
fr_fr: %s:%d:OLE_store_stream:ERREUR: Ne peux pas recomposer le nom de fichier complet à partir de '%s' et '%s'

source: %s:%d:OLE_store_stream:ERROR: Cannot open %s for writing (%s)
fr_fr: %s:%d:OLE_store_stream:ERREUR: Ne peux pas ouvrir %s en écriture (%s)

source: %s:%d:OLE_store_stream:WARNING: Only wrote %d of %d bytes to file %s
fr_fr: %s:%d:OLE_store_stream: ATTENTION: Ai uniquement écrit %d de %d bytes dans le fichier %s

source: %s:%d:OLEUNWRAP_save_stream:ERROR: Unable to create filename string from '%s' and '%s'
fr_fr: %s:%d:OLEUNWRAP_save_stream:ERREUR: Ne peux pas créer la chaîne de caractères du nom de fichier à partir de '%s' et '%s'

source: %s:%d:OLEUNWRAP_save_stream:WARNING: Only wrote %d of %d bytes to file %s
fr_fr: %s:%d:OLEUNWRAP_save_stream: ATTENTION: Ai écrit uniquement %d de %d bytes dans le fichier %s

source: %s:%d:OLEUNWRAP_save_stream:ERROR: Unable to open %s for writing (%s)
fr_fr: %s:%d:OLEUNWRAP_save_stream:ERREUR: Ne peux pas ouvrir %s en écriture (%s)

source: %s:%d:OLEUNWRAP_decode_attachment:DEBUG: Attachment %s:%s:%s size = %d
fr_fr: %s:%d:OLEUNWRAP_decode_attachment:DEBUG: Attachement %s:%s:%s taille = %d

source: %s:%d:OLEUNWRAP_decode_attachment:DEBUG: Calling reporter for the filename
fr_fr: %s:%d:OLEUNWRAP_decode_attachment:DEBUG: Contacter l'auteur du bug pour le nom du fichier

source: Unable to decode stream with element string '%s'
fr_fr: Ne peux pas décoder le flux avec la chaîne de caractères élément '%s'

source: %s:%d:PLD_strreplace:ERROR: Cannot allocate %d bytes of memory to perform replacement operation
fr_fr: %s:%d:PLD_strreplace:ERREUR: Ne peux pas allouer %d bytes de mémoire pour effectuer l'opération de remplacement

source: %s:%d:PLD_strreplace_general: Allocated memory ran out while replacing '%s' with '%s'
fr_fr: %s:%d:PLD_strreplace_general: La mémoire allouée est épuisé pendant le remplacement de '%s' par '%s'

source: Cannot interpret option "%s" %s
fr_fr: Ne peux pas interpréter l'option "%s" %s

source: Decoding filename=%s
fr_fr: Décode le nom de fichier=%s

source: ripOLE requires an input file to decode.
fr_fr: ripOLE nécessite un fichier a décoder en entrée.

source: ripOLE: Cannot allocate memory for OLE object.
fr_fr: ripOLE: Ne peux pas allouer la mémoire pour l'objet OLE.

source: Cannot locate input file '%s'
fr_fr: Ne peux pas localiser le fichier d'entrée '%s'

source: File '%s' is not OLE2 format
fr_fr: Le fichier '%s' n'est pas au format OLE2

source: OLE input file '%s' is insane
fr_fr: Le fichier d'entré OLE '%s' est délirant

source: ripOLE: decoding of %s resulted in error %d
fr_fr: ripOLE: le décodage de %s s'est terminé par une erreur %d

source: ripOLE: decoding of %s resulted in error %d.
fr_fr: ripOLE: le décodage de %s s'est terminé par une erreur %d.

source: Scilab spreadsheet module not installed.
fr_fr: Le module scilab spreadsheet n'est pas installé.
