Repository: scilab/scilab
Catalog: scilab/modules/scicos/locales/*/scicos.po
Languages: it_it, pt_br, ru_ru

source: %s.mo cannot be compiled
it_it: %s.mo non può essere compilato
pt_br: %s.mo não pode ser compilado
ru_ru: %s.mo не может быть скомпилирован

source: %s.mo compilation forced
it_it: è stata forzata la compilazione %s.mo
pt_br: Compilação de %s.mo forçada
ru_ru: %s.mo компилируется принудительно

source: %s.mo must be recompiled
it_it: %s.mo deve essere ricompilato
pt_br: %s.mo deve ser recompilado
ru_ru: %s.mo должен быть перекомпилирован

source: %s: An error occurred during the compilation of the Modelica block.
it_it: %s: Si è verificato un errore durante la compilazione del blocco di Modelica
pt_br: %s: Ocorreu um erro durante a compilação do bloco Modelica.
ru_ru: %s: Произошла ошибка во время компиляции блока Modelica.

source: %s: Cannot find any MO files in the following location: %s.
it_it: %s: Non è possibile trovare alcun file MO nella posizione seguente: %s.
pt_br: %s: Não se consegue achar arquivos MO na seguinte localização: %s.
ru_ru: %s: Невозможно найти какие-либо MO файлы в следующем местоположении: %s.

source: %s: Diagram does not compile in pass %d.
it_it: %s: Il diagramma non compila nel passo %d.
pt_br: %s: O diagrama não compila na passagem %d.
ru_ru: %s: Диаграмма не скомпилирована в %d проход(а).

source: %s: Error : the following command line failed to execute: %s.
it_it: %s: Errore: la seguente linea di comando non è stata eseguita: %s.
pt_br: %s: Erro: a seguinte linha de comando não pôde ser executada: %s.
ru_ru: %s: Ошибка: не удалось выполнить следующую командную строку: %s.

source: %s: Error: A scifunc block has not been defined.
it_it: %s: Errore: un blocco scifunc non è stato definito.
pt_br: %s: Erro: Um bloco scifunc não foi definido.
ru_ru: %s: Ошибка: Блок scifunc не определён.

source: %s: Error: Modelica compiler (MODELICAC) is unavailable.
it_it: %s: Errore: il compilatore Modelica (MODELICAC) non è disponibile.
pt_br: %s: Erro: O compilador Modelica (MODELICAC) não está disponível.
ru_ru: %s: Ошибка: Компилятор Modelica (MODELICAC) недоступен.

source: %s: Input ports are not numbered properly.
it_it: %s: Le porte di ingresso non sono numerate adeguatamente.
pt_br: %s: As portas de entrada não estão numeradas apropriadamente.
ru_ru: %s: Порты ввода не пронумерованы правильно.

source: %s: Output ports are not numbered properly.
it_it: %s: Le porte di uscita non sono numerate adeguatamente.
pt_br: %s: As portas de saída não estão numeradas apropriadamente.
ru_ru: %s: Порты вывода не пронумерованы правильно.

source: %s: Wrong number of input arguments. Must be between %d and %d.
it_it: %s: Il numero degli argomenti in ingresso è sbagliato. Deve essere tra %d e %d.
pt_br: %s: Quantidade incorreta de argumentos de entrada: deve estar entre %d e %d.
ru_ru: %s: Неверный число входных аргументов. Должно быть между %d и %d.

source: %s: Wrong number of input arguments: %d expected.
it_it: %s: Il numero degli argomenti in ingresso è sbagliato: era atteso %d.
pt_br: %s: Quantidade incorreta de argumentos de entrada: esperava-se %d.
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d.

source: %s: Wrong number of output arguments: %d expected.
it_it: %s: Il numero degli argomenti in uscita è sbagliato: era atteso %d.
pt_br: %s: Quantidade incorreta de argumentos de saída: esperava-se %d.
ru_ru: %s: Неверное количество выходных аргументов: Ожидалось %d.

source: %s: Wrong size for input argument #%d: Single integer expected.
it_it: %s: L'argomento in ingresso #%d ha una dimensione sbagliata: era atteso un singolo intero.
pt_br: %s: Tamanho incorreto para o argumento de entrada #%d: esperava-se um único número inteiro.
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась одиночная строка.

source: %s: Wrong size for input argument #%d: Single string expected.
it_it: %s: L'argomento in ingresso #%d ha una dimensione sbagliata: era attesa una singola stringa.
pt_br: %s: Tamanho incorreto para o argumento de entrada #%d: esperava-se um único texto.
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась одиночная строка.

source: %s: Wrong size for input arguments #%d and #%d.
it_it: %s: Gli argomenti in ingresso #%d e #%d hanno una dimensione sbagliata.
pt_br: %s: Tamanho incorreto para os argumentos de entrada #%d e #%d.
ru_ru: %s: Неверный размер входных аргументов #%d и #%d.

source: %s: Wrong type for input argument #%d: Integer expected.
it_it: %s: L'argomento in ingresso #%d è di tipo sbagliato: era atteso un intero.
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: esperava-se um número inteiro.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось целое число.

source: %s: Wrong type for input argument #%d: String expected.
it_it: %s: L'argomento in ingresso #%d è di tipo sbagliato: era attesa una stringa.
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: esperava-se um texto.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка.

source: &Edit
it_it: &Modifica
pt_br: &Editar
ru_ru: &Правка

source: &File
pt_br: &Arquivo
ru_ru: &Файл

source: &Tools
it_it: &Strumenti
pt_br: &Ferramentas
ru_ru: &Сервис

source: ''scicos'' is no more available, please use ''xcos'' instead.
it_it: "scicos" non è più disponibile, usare "xcos" invece.
pt_br: "scicos" não está mais disponível. Por favor, use "xcos" no lugar.

source: A compatible C compiler required.
it_it: È richiesto un compilatore C compatibile.
pt_br: É necessário um compilador C compatível.

source: Only one block can be selected in current window for this operation.
it_it: Può essere selezionato solo un blocco nella finestra attuale per questa operazione
pt_br: Apenas um bloco pode ser selecionado na janela atual para esta operação.
ru_ru: Только один блок может быть выбран в текущем окне для этой операции.

source: Problem while building library %s
it_it: C'è stato un problema durante la creazione della libreria %s
pt_br: Problema na construção da biblioteca %s
ru_ru: Проблема при компоновке библиотеки %s

source: Sorry compiling problem
it_it: Ci sono problemi di compilazione
pt_br: Desculpe, problema de compilação

source: The current icon depends on block parameter
it_it: La icona attuale dipende dal parametro del blocco
pt_br: O ícone atual depende de um parâmetro do bloco.
ru_ru: Текущая иконка зависит от параметров блока

source: %s: Diagram does not compile in pass %d. '),
ru_ru: %s: Диаграмма не скомпилирована в %d проход(а). '),

source: %s: Error: Modelica compiler (MODELICAC) is unavailable.
ru_ru: %s: Ошибка: Компилятор Modelica (MODELICAC) недоступен.
