Repository: scilab/scilab
Catalog: scilab/modules/helptools/locales/*.po
Languages: fr_fr

source: Processing file %s.xml
fr_fr: Traitement du fichier %s.xml

source: Building master documents:
fr_fr: Construit les documents maîtres:

source: Building the Scilab manual master document for %s.
fr_fr: Construit le manuel de documentation principal Scilab pour %s.

source: Building the manual file [%s] in %s.
fr_fr: En cours de construction du manuel [%s] dans %s.

source: Building the manual file [%s].
fr_fr: En cours de construction du manuel [%s].

source: Building the master document:
fr_fr: Construit le document maître:

source: %s: %s file hasn''t been moved in the %s directory.
fr_fr: %s : le fichier %s n''a pas été déplacé dans le répertoire %s.

source: %s: %s has not been generated.
fr_fr: %s : %s n'a pas été généré.

source: %s: Cannot open file %s.
fr_fr: %s : Ne peut pas ouvrir le fichier %s.

source: %s: Could find or create the working directory %s.
fr_fr: %s : Ne peut pas trouver ou créer le répertoire de travail %s.

source: %s: Directory %s does not exist or read access denied.
fr_fr: %s : Le répertoire %s n'existe pas ou l'accès à ce répertoire n'est pas autorisé.

source: %s: Error while building documentation: %s.
fr_fr: %s : Erreur pendant la construction de la documentation: %s.

source: %s: Execution Java stack %s.
fr_fr: %s: Pile d'exécution Java %s.

source: %s: Execution Java stack: %s.
fr_fr: %s: Exécution de la pile Java: %s.

source: %s: File skipped %s.
fr_fr: %s: Fichier non géré %s.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s : Arguments d'entrée n°%d et n°%d incompatibles : Même dimension attendue.

source: %s: Please check %s, number of modules is invalid.
fr_fr: %s : Veuillez vérifier %s, le nombre de modules est invalide.

source: %s: Processing file: %s
fr_fr: %s : Traitement du fichier: %s

source: %s: Processing file: %s to %s
fr_fr: %s : Traitement du fichier : de %s à %s

source: %s: Reading from directory %s
fr_fr: %s : Lecture depuis le répertoire %s

source: %s: The 2 mlist must not have any field in common .
fr_fr: %s: Les 2 mlist ne doivent pas avoir de champ en commun.

source: %s: The CHAPTER file is not well formated at line %d
fr_fr: %s: Le fichier CHAPTER n'est pas bien formaté à la ligne %d

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n'existe pas.

source: %s: The help browser is disabled in %s mode.
fr_fr: %s : Le navigateur d'aide n'est pas accessible dans le mode %s.

source: %s: The last_successful_build file is not well formated at line %d
fr_fr: %s: Le fichier last_successful_build n'est pas bien formaté à la ligne %d

source: %s: This function is only supported on Windows platforms.
fr_fr: %s : Cette fonction n'est utilisable que sur les plateformes Windows.

source: %s: Wrong number of input argument(s): At most %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : Au plus %d attendus.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendus.

source: %s: Wrong number of input argument: %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument en entrée: %d à %d attendu.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un entier attendu.

source: %s: Wrong size for input argument #%d: Single string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d : Une simple chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n° %d : Un booléen attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un entier attendu.

source: %s: Wrong type for input argument #%d: Single string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Table de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: matrix oriented typed list expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: mlist attendu.

source: %s: Wrong value for input argument #%d: A string that end with .last_successful_build expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Une chaîne de caractères terminant par .last_successful_build attendue.

source: %s: Wrong value for input argument #%d: A string that end with CHAPTER expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Une chaîne de caractères finissant par CHAPTER attendue.

source: %s: Wrong value for input argument #%d: A valid existing directory is expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un répertoire existant valide attendu.

source: %s: Wrong value for input argument #%d: A valid existing file is expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un fichier existant valide attendu.

source: %s: Wrong value for input argument #%d: An existing directory expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un répertoire existant attendu.

source: %s: help file(.jar) is not installed.
fr_fr: %s : le fichier d'aide (.jar) n'est pas installé

source: %s: hhc.exe not found.
fr_fr: %s: hhc.exe non trouvé.

source: %s: no file generate.
fr_fr: %s: pas de fichier généré.

source: %s: processed %i files.
fr_fr: %s : %i fichiers traités.

source: -- Deleting help files --
fr_fr: -- Suppression des fichiers d'aide --

source: Building the scilab manual file [
fr_fr: Construit le fichier du manuel Scilab [

source: Help chapter
fr_fr: Chapitre d'aide

source: Scilab '%s' module disabled in -nogui or -nwni mode.
fr_fr: Le module Scilab '%s' est désactivé en mode -nogui ou -nwni.

source: Scilab '%s' module not installed.
fr_fr: Le module '%s' de Scilab n'est pas installé.

source: Warning %s does not follow the dtd
fr_fr: Attention %s ne respecte pas la dtd
