Repository: scilab/scilab
Catalog: scilab/modules/graphics/locales_macros/*.po
Languages: fr_fr

source: %s : Invalid entity %s
fr_fr: %s : Entité %s invalide

source: %s: Error : unable to evaluate input function ''%s''.
fr_fr: %s : Erreur : impossible d''évaluer la fonction d''entrée ''%s''.

source: %s: Error : unable to evaluate input function.
fr_fr: %s : Erreur : impossible d''évaluer la fonction d''entrée.

source: %s: Input argument #%d must be a handle on a axes.
fr_fr: %s: L''argument d''entrée n° %d doit être un handle vers un axe.

source: %s: Input argument #%d must be real.
fr_fr: %s : L''argument d''entrée n°%d doit être réel.

source: %s: Legend does not fit with the current context. Skipped
fr_fr: %s: La légende ne correspond pas au contexte courant. On passe

source: %s: No ''%s'' handle found.
fr_fr: %s: Aucun identificateur de ''%s'' trouvé.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : %d attendu.

source: %s: Wrong number of input argument(s): %d or %d expected.
fr_fr: %s: Mauvais nombre d''argument(s) d''entrée: %d ou %d attendu.

source: %s: Wrong number of input argument(s): %d or %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) d''entrée : %d ou %d attendu.

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) d''entrée : %d à %d attendus.

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) d''entrée : %d à %d attendu.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : Au moins %d attendus.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendus.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d attendus.

source: %s: Wrong number of input arguments: %d or %d to %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d ou %d à %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d à %d attendus.

source: %s: Wrong size for input argument #%d: A %d-by-%d or %d-by-%d matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une matrice de taille %d-par-%d ou %d-par-%d attendue.

source: %s: Wrong size for input argument #%d: A Real expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un réel attendu.

source: %s: Wrong size for input argument #%d: A matrix of size greater than %d-by-%d expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une matrice de taille supérieure à %d-par-%d attendue.

source: %s: Wrong size for input argument #%d: A real expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n° %d : Un réel attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un scalaire attendu.

source: %s: Wrong size for input argument #%d: A single string expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n° #%d : Une simple chaîne de caractères est attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A vector expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un vecteur attendu.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un entier attendu.

source: %s: Wrong size for input argument %d: An ''Axes'' handle expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un handle de type ''Axes'' attendu.

source: %s: Wrong size for input argument ''%s'': A matrix of size greater than %d-by-%d expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée ''%s'': Une matrice de taille supérieure à %d-par-%d attendue.

source: %s: Wrong size for input argument ''%s'': A non empty matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée ''%s'': Une matrice non vide attendue.

source: %s: Wrong size for input argument ''%s'': A vector expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée ''%s'': Un vecteur attendu.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Incompatible dimensions.
fr_fr: %s: Mauvaise dimension pour les arguments d''entrée ''%s'' et ''%s'': Dimensions incompatibles.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Matrices of same size expected.
fr_fr: %s: Mauvaise dimension pour les arguments d''entrée ''%s'' et ''%s'': Des matrices de même taille attendues.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Same size expected.
fr_fr: %s: Mauvaise dimension pour les arguments d''entrée ''%s'' et ''%s'': Même dimension attendue.

source: %s: Wrong size for input arguments ''%s'': A vector of size %d expected.
fr_fr: %s: Mauvaise dimension pour les arguments d''entrée ''%s'': Un vecteur de taille %d attendu.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d.

source: %s: Wrong type for input argument #%d: %s data structure expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : structure de données de type %s attendue.

source: %s: Wrong type for input argument #%d: A Real expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un réel attendu.

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un réel est attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: A vector expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un vecteur est attendu.

source: %s: Wrong type for input argument #%d: A vector of ''Figure'' handle expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un vecteur de handle de type ''Figure'' attendu.

source: %s: Wrong type for input argument #%d: An ''Axes'' handle expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Un handle de type ''Axes'' attendu.

source: %s: Wrong type for input argument #%d: Graphic handle expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Un handle vers un graphique attendu.

source: %s: Wrong type for input argument #%d: Real array or graphic handle array expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Un tableau de réels ou un handle vers un graphique attendu.

source: %s: Wrong type for input argument #%d: Scalar expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Table de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: function expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Une fonction attendue.

source: %s: Wrong type for input argument %d: An ''Axes'' handle expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un handle de type ''Axes'' attendu.

source: %s: Wrong type for input argument ''%s'': A Real matrix expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée ''%s'': Une matrice réelle attendue.

source: %s: Wrong type for input argument.
fr_fr: %s : Mauvais type pour l''argument d''entrée.

source: %s: Wrong value for input argument #%d: ''clear'' or ''reset'' expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : ''clear'' ou ''reset'' attendu.

source: %s: Wrong value for input argument #%d: A %d digits integer with digits greater than %d expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Un entier de taille %d décimales (avec plus de %d décimales) attendu.

source: %s: Wrong value for input argument #%d: An integer greater or equal than %d expected.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Un entier égal ou plus grand que %d attendu.

source: %s: Wrong value for input argument #%d: Must be in the interval [%s, %s].
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n° %d : Doit être dans l''intervalle [%s, %s].

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s : Mauvaise valeur pour l''argument d''entrée n°%d : Doit être dans l''ensemble {%s}.

source: %s: Wrong values for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''%s'' attendue.

source: %s: handle no more valid ignored.
fr_fr: %s : handle plus valide ignoré.

source: %s: too many input arguments
fr_fr: %s : trop d''arguments d''entrée

source: &Edit
fr_fr: &Edition

source: &File
fr_fr: &Fichier

source: &Tools
fr_fr: &Outils

source: Autumn
fr_fr: Automne

source: Bone
fr_fr: Os

source: Cancel
fr_fr: Annuler

source: Color number
fr_fr: Numéro de la couleur

source: Common X axis
fr_fr: Axe X commun

source: Copper
fr_fr: Cuivre

source: Customize your complex function
fr_fr: Customisez votre fonction complexe

source: Data tips cannot be attached to this curve, the user_data field is already used
fr_fr: Les étiquettes de données ne peuvent être liées à cette courbe. le champ user_data est déjà utilisé

source: Delete all datatips
fr_fr: Effacer toutes les étiquettes de données

source: Delete all datatips for the selected curve
fr_fr: Effacer toutes les étiquettes de données pour la courbe sélectionnée

source: Delete last datatip
fr_fr: Effacer la dernière étiquette de donnée

source: Delete nearest datatip
fr_fr: Effacer l''étiquette de donnée la plus proche

source: Disable interpolation
fr_fr: Désactiver l''interpolation

source: Edit the curve tip display function
fr_fr: Editer la fonction d''affichage du datatip de la courbe

source: Enable interpolation
fr_fr: Activer l''interpolation

source: Error %d at line %d of the function: ''%s''
fr_fr: Erreur %d à la ligne %d de la fonction : ''%s''

source: Graphics
fr_fr: Graphiques

source: Graphics with 2 different Y-scales
fr_fr: Graphiques avec 2 échelles Y différentes

source: Gray
fr_fr: Gris

source: HSV
fr_fr: TSV

source: Hot
fr_fr: Chaud

source: Left click on a curve to create a datatip, right opens
fr_fr: Clique gauche sur une courbe pour créer un datatip, clique droit ouvre

source: Left click on a curve to create a datatip, right opens contextual menu
fr_fr: Cliquer sur une courbe pour créer une étiquette de donnée, cliquer avec le bouton droit ouvre un menu contextuel

source: Left click on a graphic entity to open its property editor
fr_fr: Clique gauche sur une entité graphique pour ouvrir son éditeur de propriétés

source: Misc
fr_fr: Divers

source: Multiple datatips mode
fr_fr: Mode d''étiquettes de données multiples

source: Name
fr_fr: Nom

source: Ocean
fr_fr: Océan

source: Pink
fr_fr: Rose

source: Plot with 3 different Y scales at shared X
fr_fr: Graphique avec 3 échelles Y différentes et une échelle X partagée

source: Rainbow
fr_fr: Arc-en-ciel

source: Redraw all datatips
fr_fr: Redessiner toutes les étiquettes de données

source: Scale n1
fr_fr: Echelle n° 1

source: Select tip orientation
fr_fr: Sélectionner l''orientation de l''étiquette

source: Spring
fr_fr: Printemps

source: Summer
fr_fr: Été

source: Tcl/Tk interface not installed.
fr_fr: Interface Tcl/Tk pas installée.

source: The selected file cannot be executed
fr_fr: Le fichier sélectionné ne peut pas être exécuté

source: The selected file defines more than one function
fr_fr: Le fichier sélectionné définit plus d''une fonction

source: The selected function must have 1 output parameter (str)
fr_fr: La fonction sélectionnée doit avoir 1 paramètre de sortie (str)

source: The selected function must have 3 input parameters (curve,pt,index)
fr_fr: La fonction sélectionnée doit avoir 3 paramètres d''entrée (curve,pt,index)

source: Unique datatip mode
fr_fr: Mode d''étiquette de donnée unique

source: White
fr_fr: Blanc

source: Winter
fr_fr: Hiver

source: automatic
fr_fr: automatique

source: lower left
fr_fr: en bas à gauche

source: lower right
fr_fr: en bas à droite

source: select the curve tip display function
fr_fr: sélectionner la fonction d''affichage d''étiquette de courbe

source: upper left
fr_fr: en haut à gauche

source: upper right
fr_fr: en haut à droite
