Repository: scilab/scilab
Catalog: scilab/modules/fftw/locales/*/fftw.po
Languages: fr_fr, pt_br

source: FFTW Library %s not found.
fr_fr: Bibliothèque FFTW %s non trouvé.
pt_br: A biblioteca %s de FFTW não foi encontrada.

source: FFTW Library not found.
fr_fr: Bibliothèque FFTW non trouvée.
pt_br: A biblioteca de FFTW não foi encontrada.

source: %s: Wrong number of input arguments: %d not expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d pas attendu.
pt_br: %s: Número errado de argumentos de entrada: não esperava por %d.

source: %s: Wrong type for input argument #%d: A Real or Complex expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel ou complexe attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um número real ou complexo.

source: %s: Wrong values for input argument #%d.
fr_fr: %s : Mauvaises valeurs pour l'argument d'entrée n°%d.
pt_br: %s: Valores errados para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: N-dimensionnal array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : une table de dimension N attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de N dimensões.

source: %s: Wrong size for input argument #%d.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: int matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : matrice d'entiers attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: esperava uma matriz de inteiros.

source: %s: Incompatible input arguments '#%d and '#%d': Same sizes expected.
fr_fr: %s : Arguments d'entrée n°%d et n°%d incompatibles : Mêmes tailles attendues.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se os mesmos tamanhos.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
pt_br: %s: Memória esgotada.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
fr_fr: %s : Mauvaise valeurs pour l'argument d'entrée n°%d : Un entier non-négatif attendu.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se números inteiros não negativos.

source: %s: Wrong values for input argument #%d: FFTW flag expected.
fr_fr: %s : Mauvaise valeurs pour l'argument d'entrée n°%d : Drapeaux FFTW attendus.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um sinalizador de FFTW.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um texto.

source: %s: An error occurred: %s
fr_fr: %s : Une erreur s'est produite : %s
pt_br: %s: Um erro ocorreu: %s

source: FFTW can't read wisdom.
fr_fr: FFTW ne peut pas lire la transformation pré-calculée (wisdom).
pt_br: FFTW não consegue ler o wisdom.

source: Scilab FFTW module not installed.
fr_fr: Module scilab FFTW non installé.
pt_br: O módulo FFTW do Scilab não está instalado.
