Repository: scilab/scilab
Catalog: scilab/modules/pvm/locales/*.po
Languages: ca_es

source: %s: An error occurred: %s
ca_es: %s: Hi ha hagut un error: %s

source: %s: Error while creating processes: %s.
ca_es: %s: Error en crear el procés: %s.

source: %s: No more memory.
ca_es: %s: No hi ha més memòria.

source: %s: No such file or directory.
ca_es: %s: No existeix el fitxer o directori.

source: %s: Unknown or not yet implemented type.
ca_es: %s: Aquest tipus és desconegut o encara no s'ha implementat.

source: %s: Wrong first input argument: '%s' or '%s' expected.
ca_es: %s: El primer argument d'entrada és incorrecte: Ha de ser '%s' o '%s'.

source: %s: workspace (stacksize) is too small.
ca_es: %s: l'espai de treball (stacksize) és massa petit.

source: (group,instance) already exists
ca_es: Ja existeix aquest (grup, instància)

source: Already doing operation
ca_es: Ja s'està fent l'operació

source: Already in group
ca_es: Ja està al grup

source: Bad message id
ca_es: Identificador de missatge incorrecte

source: Bad parameter
ca_es: Paràmetre incorrecte

source: Barrier count mismatch
ca_es: Error en el recompte de barreres

source: Can not decode received msg
ca_es: No s'ha pogut desxifrar el missatge rebut

source: Can not get memory
ca_es: No s'ha pogut obtenir més memòria

source: Daemon pvmd is not responding
ca_es: El dimoni pvmd no respon

source: Error MALLOC in pvm_error
ca_es: Error de MALLOC a pvm_error

source: Error pvm_reduce: Not scalar type
ca_es: Error al pvm_reduce: El tipus no és escalar

source: Error pvm_reduce: Unknown reduction operation %s
ca_es: Error pvm_reduce: Operació de reducció %s desconeguda

source: Failed to exec new slave pvmd
ca_es: No s'ha pogut executar un nou pvmd esclau

source: Function not implemented
ca_es: Aquesta funció no està implementada

source: Host already configured (Duplicate host)
ca_es: Ja s'ha configurat l'equip (Equip duplicat)

source: Host failed
ca_es: Error a l'equip

source: No current buffer
ca_es: No hi ha cap memòria intermèdia actual

source: No group with that name
ca_es: No hi ha cap grup amb aquest nom

source: No parent task
ca_es: No hi ha cap tasca pare

source: No such (group,instance)
ca_es: No existeix aquest (grup, instància)

source: No such executable
ca_es: No existeix aquest executable

source: No such host
ca_es: No existeix aquest equip

source: No such instance in group
ca_es: No hi ha aquesta instància al grup

source: No such task
ca_es: No existeix aquesta tasca

source: Not in group
ca_es: No està al grup

source: Null group name is illegal
ca_es: No es pot posar un nom de grup buit

source: OK
ca_es: D'acord

source: Out of resources
ca_es: Sense recursos

source: PVM exists
ca_es: El PVM existeix

source: PVM not found
ca_es: No s'ha trobat el PVM

source: PVM parallel Toolbox
ca_es: Barra d'eines paral·lela de PVM

source: Pvmd system error
ca_es: Error de sistema al Pvmd

source: Pvmd-pvmd protocol mismatch
ca_es: Error de protocol Pvmd-pvmd

source: Read past end of buffer
ca_es: S'ha llegit més enllà del final de la memòria intermèdia

source: Scilab PVM module not installed.
ca_es: El mòdul PVM del Scilab no està instal·lat.

source: The configuration file %s is used.
ca_es: S'està utilitzant el fitxer de configuració %s.

source: The standard configuration file $SCI%s will be used. With SCI=%s SCI will have to be set on remote hosts in order to spawn scilab
ca_es: S'utilitzarà el fitxer estàndard de configuració $SCI%s. Amb SCI=%s S'haurà de definir SCI en els equips remots per poder executar el Scilab

source: The standard configuration file $SCI%s%s needs the environment variables %s, %s, %s to be set. PVM can not be started.
ca_es: El fitxer estàndard de configuració $SCI%s%s necessita les variables d'entorn %s, %s, %s. No es pot arrancar el PVM.

source: Unknown Error
ca_es: Error desconegut

source: Warning: PVM_ROOT is not set.
ca_es: Avís: No s'ha definit el PVM_ROOT.

source: Warning: PVM_ROOT is set to %s
ca_es: Avís: PVM_ROOT s'ha definit com a %s

source: Warning: The standard configuration file $SCI%s was not found. We supposed that PVM and scilab are in standard place on your net (Cf. man pvmd3)
ca_es: Avís: No s'ha trobat el fitxer estàndard de configuració $SCI%s. Se suposa que el PVM i el Scilab estàn en la ubicació estàndard a la vostra xarxa (Cf. man pvmd3)

source: but there exists no configuration file:
ca_es: però no existeix cap fitxer de configuració:
