Repository: scilab/scilab
Catalog: scilab/modules/linear_algebra/locales/*/linear_algebra.po
Languages: ja_jp, ru_ru

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
ja_jp: %s: 入力引数 #%d と #%d で互換性がありません: サイズが一致する必要があります。
ru_ru: %s: Несовместимые аргументы #%d и #%d: Они должны иметь одинаковые размеры.

source: %s: Non convergence in QR steps.
ja_jp: %s: QR反復が収束しません。
ru_ru: %s: Нет сходимости в шагах QR.

source: %s: SVD and QR not implemented in sparse.
ja_jp: %s: 疎行列向きのSVDとQRは実装されていません。
ru_ru: %s: SVD и QR не реализованы в 'sparse' (модуле работы с разреженными матрицами).

source: %s: This feature has not been implemented.
ja_jp: %s: この機能は実装されていません。
ru_ru: %s: Эта функциональная возможность ещё не реализована.

source: %s: Wrong number of input argument(s): %d expected.
ja_jp: %s: 入力引数の数が違います: %d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось %d.

source: %s: Wrong number of input arguments: %d or %d expected.
ja_jp: %s: 入力引数で不正な数: %d または %d を想定します。

source: %s: Wrong size for input argument #%d: A column vector expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 列ベクトルを想定します。
ru_ru: %s: Неверный размер аргумента #%d: Ожидался вектор-столбец.

source: %s: Wrong size for input argument #%d: A scalar expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: スカラーを想定します。
ru_ru: %s: Неверный размер аргумента #%d: Ожидался скаляр.

source: %s: Wrong size for input argument #%d: A square matrix expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 正方行列を想定します。
ru_ru: %s: Неверный размер аргумента #%d: Ожидалась квадратная матрица.

source: %s: Wrong size for input argument #%d: Symmetric expected
ja_jp: %s: 入力引数 #%d で不正なサイズ: 対称を想定します。
ru_ru: %s: Неверный размер аргумента #%d: Ожидался симметричный

source: %s: Wrong type for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な型です。
ru_ru: %s: Неверный тип аргумента #%d.

source: %s: Wrong type for input argument #%d: Real matrix expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実行列を想定します。
ru_ru: %s: Неверный тип аргумента #%d: Ожидалась матрица вещественных чисел.

source: %s: Wrong type for input argument #%d: Real or Complex matrix expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実、または、複素行列.を想定します。
ru_ru: %s: Неверный тип аргумента #%d: Ожидалась действительная или комплексная матрица.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
ja_jp: %s: 入力引数 #%d で不正な値: set {%s} しなければなりません。
ru_ru: %s: Неверное значение аргумента #%d: Должно быть из множества {%s}.

source: %s: Wrong value for input argument #%d: Non-negative integer expected.
ja_jp: %s: 入力引数 #%d で不正な値: 負数でない整数を想定します。
ru_ru: %s: Неверное значение аргумента #%d: Ожидалось неотрицательное целое.

source: %s: Wrong value for input argument #%d: Not semi-definite positive
ja_jp: %s: 入力引数 #%d で不正な値: 明確な半正定値ではありません
ru_ru: %s: Неверное значение аргумента #%d: Не полуопределённое положительное

source: %s: Wrong value for input argument #%d: Requested rank is greater than matrix dimension.
ja_jp: %s: 入力引数 #%d で不正な値: 要求された列は、行列次元よりも大きいです。
ru_ru: %s: Неверное значение аргумента #%d: Запрошенный ранг больше размерности матрицы.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
ja_jp: %s: 入力引数 #%d で不正な値: 負数でない整数を想定します。
ru_ru: %s: Неверные значения аргумента #%d: Ожидались неотрицательные целые числа.

source: %s: Wrong values for input argument #%d: Non-negative scalar expected.
ja_jp: %s: 入力引数 #%d で不正な値: 負数でないスカラーを想定します。
ru_ru: %s: Неверные значения аргумента #%d: Ожидался неотрицательный скаляр.
