Repository: scilab/scilab
Catalog: scilab/modules/mexlib/locales/*.po
Languages: fr_fr

source: mexPutFull failed
fr_fr: Échec de mexPutFull

source: No more memory available: increase stacksize
fr_fr: Plus de mémoire disponible : augmentez stacksize

source: Routine mxIsSingle not implemented.
fr_fr: La fonction mxIsSingle n'est pas implémentée.

source: Variable is not logical.
fr_fr: La variable n'est pas de type logical.

source: No more memory available: increase stacksize.
fr_fr: Plus de mémoire disponible : augmentez stacksize.

source: Warning:
fr_fr: Avertissement :

source: mexCallSCILAB: invalid pointer passed to called function.
fr_fr: mexCallSCILAB : Pointeur invalide demandé à la fonction appelée.

source: mexCallSCILAB: evaluation failed.
fr_fr: mexCallSCILAB : Échec de l'évaluation.

source: GetElementSize error.
fr_fr: Erreur GetElementSize.

source: Function mexPutArray is obsolete, use mexPutVariable!
fr_fr: La fonction mexPutArray est obsolète, utilisez mexPutVariable à la place !

source: Routine mxSetName not implemented !
fr_fr: La fonction mxSetName n'est pas implémentée !

source: Routine mxSetData not implemented.
fr_fr: La fonction mxSetData n'est pas implémentée.

source: Last warning
fr_fr: Dernier avertissement

source: Warning
fr_fr: Attention

source: %s: mxSetPr overwriting destination by %i bytes.
fr_fr: %s : mxSetPr écrasement de la destination de %i octets.

source: %s: mxSetPi overwriting destination by %i bytes.
fr_fr: %s : mxSetPi écrasement de la destination de %i octets.

source: Routine mxGetName not implemented.
fr_fr: La fonction mxGetName n'est pas implémentée.

source: Routine mxSetDimensions not implemented.
fr_fr: La fonction mxSetDimensions n'est pas implémentée.

source: Invalid string matrix (at most one column!)
fr_fr: Matrice de chaîne de caractères invalide (au moins une colonne est nécessaire)

source: Column length of string matrix must agree!
fr_fr: La longueur des colonnes de la matrice de chaîne de caractères doit correspondre !

source: Use mtlb_sparse(sparse( ))!
fr_fr: Utilisez mtlb_sparse(sparse( ))!

source: Invalid input
fr_fr: Entrée invalide

source: No more memory
fr_fr: Plus de mémoire disponible
