Repository: scilab/scilab
Catalog: scilab/modules/string/locales_macros/*.po
Languages: fr_fr

source: %s: Given expression has no value.
fr_fr: %s: L''expression donnée n''a pas de valeur.

source: %s: This feature has not been implemented: %s.
fr_fr: %s : Cette fonctionnalité n''a pas été implémentée : %s.

source: %s: This feature has not been implemented: Variable translation of type %s.
fr_fr: %s : Cette fonctionnalité n''a pas encore été implémentée : Traduction d''une variable du type %s.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendus.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d attendu.

source: %s: Wrong size for input argument #%d: A character or vector of characters expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Un caractères ou un vecteur de caractères attendu.

source: %s: Wrong size for input argument #%d: A character string expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée n°%d : Un entier attendu.

source: %s: Wrong type for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: ''%s'' attendu.

source: %s: Wrong type for input argument #%d: A string array expected.
fr_fr: %s : Mauvais type d''argument d''entrée #%d : Un tableau de chaînes de caractères est attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée n°%d : Un entier attendu.

source: %s: Wrong type for input argument #%d: Real or Complex matrix, Matrix of character strings or list expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Matrice réelle ou complexe, matrice de chaîne de caractères ou list attendue.

source: %s: Wrong type for input argument: String expected.
fr_fr: %s : Mauvais type pour l''argument d''entrée : Chaîne de caractère attendue.

source: %s: Wrong value for input argument #%d: %s, %s or %s expected.
fr_fr: %s: valeur erronée pour l''argument de saisie %d: %s, %s ou %s attendu.

source: %s: Wrong values for input argument #%d: An non-negative integer expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Un entier non-négatif attendu.
