Repository: scilab/scilab
Catalog: scilab/modules/graphic_export/locales/*.po
Languages: de_de, fr_fr

source: %s: %s must be called before any action.
de_de: %s: %s muß vor jedem Vorgang aufgerufen werden.
fr_fr: %s : %s doit être appelée avant tout autre action.

source: %s: EMF format only available under Microsoft Windows OS.
de_de: %s: EMF Format nur unter MS Windows Betriebssystemen verfügbar.
fr_fr: %s : Le format EMF est seulement disponible sous Microsoft Windows OS.

source: %s: GL2PS error during export.
de_de: %s: GL2PS Fehler während des Exportierens.
fr_fr: %s : Une erreur GL2PS est survenue pendant l'export.

source: %s: OpenGL error during export.
de_de: %s: Fehler von OpenGL während des Exportierens.
fr_fr: %s : Une erreur OpenGL est survenue pendant l'export.

source: %s: Unable to create export file, figure is too big.
de_de: %s: Fehler beim Erzeugen der Exportdatei, da Bild zu groß ist.
fr_fr: %s : Impossible de créer le fichier d'export, la figure est de taille trop importante.

source: %s: Unable to create export file, invalid file.
de_de: %s: Fehler beim Erzeugen der Exportdatei, da Datei ungültig ist.
fr_fr: %s : Impossible de créer le fichier d'export, fichier invalide.

source: %s: Unable to create export file, permission denied.
de_de: %s: kann keine Datei zum Exportieren erzeugen, Vorgang abgelehnt.
fr_fr: %s : Incapable de créer un fichier d'export, permission refusée.

source: %s: Unable to execute pstoedit.
de_de: %s: kann pstoedit nicht ausführen.
fr_fr: %s : Incapable d'exécuter pstoedit.

source: %s: Unable to find pstoedit.
de_de: %s: Kann pstoedit nicht finden.
fr_fr: %s : Impossible de trouver pstoedit.

source: %s: Unable to locate pstoedit. Please install pstoedit or add it to the PATH to be able to use this feature.
de_de: %s: kann pstoedit nicht lokalisieren. Installieren Sie pstoedit oder fügen Sie dies zu PFAD hinzu, um diese Funktionalität zu verwenden.
fr_fr: %s : Impossible de localiser pstoedit. Installer pstoedit ou l'ajouter au PATH pour être capable d'utiliser cette fonctionnalité.

source: %s: Wrong number of input argument: String expected with ''%s'', ''%s'', ''%s'' or ''%s'' drivers.
de_de: %s: falsche Anzahl an Eingangsargumenten: Zeichenkette mit ''%s'', ''%s'', ''%s'' oder '%s' Treibern erwartet.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : Chaîne de caractères attendue avec les drivers ''%s'', ''%s'', ''%s'' ou ''%s''.

source: %s: Wrong number of input arguments: %d to %d expected.
de_de: %s: Falsche Anzahl an Eingangsargumenten: %d zu %d erwartet.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong number of input arguments: Function has no input argument with ''%s'' or ''%s'' drivers.
de_de: %s: falsche Anzahl an Eingangsargumenten: Funktion hat keine Eingangsargumente mit ''%s'' oder ''%s'' Treibern.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : La fonction n'a pas d'argument d'entrée avec les drivers ''%s'' ou ''%s''.

source: %s: Wrong size for input argument #%d: A graphic handle expected.
de_de: %s: Falsche Größe für Eingangsargument #%d: Grafische Handhabung erwartet.
fr_fr: %s : Taille incorrecte de l'argument d'entrée #%d : handle graphique attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
de_de: %s: Falsche Größe für Eingangsargument #%d: Skalar erwartet.
fr_fr: %s : Taille incorrecte de l'argument d'entrée #%d : Scalaire attendu.

source: %s: Wrong size for input argument #%d: Single character string expected.
de_de: %s: Falsche Größe für Eingangsargument #%d: Einzelne Zeichenfolge erwartet.
fr_fr: %s : Taille incorrecte de l'argument d'entrée #%d : Un seul caractère attendu.

source: %s: Wrong type for input argument #%d: A real between 0 and 1 expected.
de_de: %s: Falscher Typ für Eingangsargument #%d: Kommazahl zwischen 0 und 1 erwartet.
fr_fr: %s : Type incorrect de l'argument d'entrée #%d : réel compris entre 0 et 1 attendu.

source: %s: Wrong type for input argument #%d: An integer or a handle expected.
fr_fr: %s : Type incorrect de l'argument d'entrée #%d : Entier ou handle attendu.

source: %s: Wrong type for input argument #%d: Integer expected.
de_de: %s: falscher Typ für Eingangsargument #%d: Integer erwartet.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Entier attendu.

source: %s: Wrong type for input argument #%d: Single character string expected.
de_de: %s: falscher Typ für Eingangsargument #%d: ein einzelnes Zeichen erwartet.
fr_fr: %s : Mauvais type pour le paramètre en entrée #%d : Un simple caractère attendu.

source: %s: Wrong type for input argument #%d: String expected.
de_de: %s: falscher Typ für Eingangsargument #%d: Variable erwartet.
fr_fr: %s : Mauvais type pour l'argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
de_de: %s: falscher Wert für Eingangsargument #%d: '%s' oder '%s' erwartet.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
de_de: %s: falscher Wert für Eingangsargument #%d: ''%s'' oder ''%s'' erwartet.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' or ''%s'' expected.
de_de: %s: falscher Wert für Eingangsargument #%d: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' oder ''%s'' erwartet.
fr_fr: %s : Mauvaise valeur pour le paramètre d'entrée #%d : ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' ou ''%s'' attendue.

source: Please install Ghostscript 32 bits to export an .FIG file.
de_de: Bitte installieren Sie Ghostscript 32 Bits um eine .FIG Datei zu exportieren.
fr_fr: Merci d'installer Ghostscript 32 bits pour pouvoir exporter au format .FIG.

source: Scilab Graphic export module not installed.
de_de: Grafischer Exportmodus von Scilab nicht installiert.
fr_fr: Le module d'export graphique de Scilab n'est pas installé.

source: Scilab error
de_de: Scilab Fehler
fr_fr: Erreur Scilab

source: Scilab graphic module disabled -nogui or -nwni mode.
de_de: Grafisches Modul von Scilab deaktiviert: -nogui oder -nwni Modus.
fr_fr: Le module graphique de Scilab est désactivé en mode -nogui ou -nwni.

source: error
de_de: Fehler
fr_fr: erreur
