Repository: scilab/scilab
Catalog: scilab/modules/umfpack/locales_macros/*.po
Languages: fr_fr

source: approximate (lM,vM) with the iterative power method
fr_fr: approxime (lM,vM) avec la méthode des puissances itérées

source: approximate (lm,vm) with the inverse iterative power method
fr_fr: approxime (lm,vm) avec la méthode inverse des puissances itérées

source: CLICK TO CONTINUE
fr_fr: CLIQUEZ POUR CONTINUER

source: don''t reached after %d iterations (got only %e)
fr_fr: n''est pas atteinte après %d itérations (ai obtenu uniquement %e)

source: then re enter scisptdemo()
fr_fr: ensuite re-saisissez scisptdemo()

source: then click on OK
fr_fr: ensuite cliquez sur OK

source: For this demo the current stack size is not enough
fr_fr: Pour cette démo la taille courante de la pile n''est pas suffisante.

source: Warning : for lM convergence at rtol = %e
fr_fr: Attention : pour la convergence lM à rtol = %e

source: Warning : for lm convergence at rtol = %e
fr_fr: Attention : pour la convergence lm à rtol = %e

source: enter the following at the scilab prompt :
fr_fr: entrez ce qui suit au prompt scilab :

source: iteration %3d : lM = %e
fr_fr: itération %3d : lM = %e

source: iteration %3d : lm = %e
fr_fr: itération %3d : lm = %e

source: %s: Invalid type and/or size and/or value for the second arg.
fr_fr: %s: Type invalide et/ou dimension et/ou valeur pour le second argument.

source: %s: No values for this matrix (only non zero pattern) : put some 1.
fr_fr: %s: Pas de valeurs pour cette matrice (uniquement des motifs non nuls) : mettez quelques 1.

source: %s: The file contains a rhs but it will not be read !
fr_fr: %s: Le fichier contient un rhs mais ne sera pas lu !

source: %s: The matrix and the LU factors have not the same dimension !
fr_fr: %s: La matrice et les facteursLU n''ont pas la même dimension !

source: %s: Wrong number of input argument(s).
fr_fr: %s : Mauvais nombre d''argument(s) d''entrée.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d''argument(s) en entrée : Au moins %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d''arguments d''entrée : %d à %d attendus.

source: %s: Wrong size for input argument #%d: Square sparse matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une matrice creuse carrée attendue.

source: %s: Wrong type for input argument #%d: Square sparse matrix expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Une matrice creuse carrée attendue.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l''argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: sparse matrix expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: une matrice creuse attendue.

source: %s: currently don''t read unassembled (elemental) sparse matrix.
fr_fr: %s: actuellement, ne lit pas les matrices creuses non assemblées (élémentaires).

source: Choose a sparse matrix
fr_fr: Choisissez une matrice creuse

source: Click to choose a demo
fr_fr: Cliquez pour choisir une démo

source: display a speed comparison test
fr_fr: afficher un test comparatif de vitesse

source: how to use this stuff
fr_fr: comment utiliser cette chose

source: small tests for condestsp
fr_fr: petit tests pour condestsp
