Repository: scilab/scilab
Catalog: scilab/modules/optimization/locales/*/optimization.po
Languages: pl_pl

source: primal obj. dual obj. dual. gap
pl_pl: pierwotny obj. podwójny obj. podwójna. luka

source: number of of constraints (%s)'),'lmisolver',%m,%fm));
pl_pl: liczba ograniczeń (%s)'),'lmisolver',%m,%fm));

source: %s: Accuracy insufficient to satisfy convergence criterion.
pl_pl: %s: Zbyt mała dokładność by zostało spełnione kryterium zbieżności.

source: %s: Ambiguous property name %s matches several fields : %s
pl_pl: %s: Niejasna nazwa właściwości %s nazwa pasuje do wielu dziedzin : %s

source: %s: Argument 3: wrong number of columns %d expected
pl_pl: %s: Argument 3: zły numer kolumny %d oczekiwano

source: %s: Cannot allocate more memory.
pl_pl: %s: Nie można przydzielić więcej pamięci.

source: %s: Cannot check cost function when x0 is empty
pl_pl: %s: Nie można sprawdzić funkcji cost kiedy x0 jest niepodane

source: %s: Cannot evaluate cost function from costf(x0,1).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,1).

source: %s: Cannot evaluate cost function from costf(x0,2).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,2).

source: %s: Cannot evaluate cost function from costf(x0,3).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,3).

source: %s: Cannot evaluate cost function from costf(x0,4).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,4).

source: %s: Cannot evaluate cost function from costf(x0,5).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,5).

source: %s: Cannot evaluate cost function from costf(x0,6).
pl_pl: %s: Nie można ocenić funkcji cost pochodzącej od costf(x0,6).

source: %s: Empty function (use -function option).
pl_pl: %s: Funkcja pusta (urzyć -ustawień funkcji).

source: %s: Expected boolean but for variable %s at input #%d, got %s instead.
pl_pl: %s: Oczekiwano wartości logicznej dla zmiennej %s na wejściu #%d, zamiast wartości logicznej otrzymano%s

source: %s: Expected function but for variable %s at input #%d, got %s instead.
pl_pl: %s: Oczekiwano funkcji dla zmiennej %s na wejściu #%d, zamiast funkcji otrzymano%s

source: %s: Expected real variable for variable %s at input #%d, but got %s instead.
pl_pl: %s: Oczekiwano wartości typu real dla zmiennej %s na wejściu #%d, ale zamiast tej wartości otrzymano %s

source: %s: Expected string variable for variable %s at input #%d, but got %s instead.
pl_pl: %s: Oczekiwano wartości typu string dla zmiennej %s na wejściu #%d, ale zamiast wartości typu string otrzymano %s

source: %s: History disabled ; enable -storehistory option.
pl_pl: %s: Historia nieaktywna; aktywuj -funkcje zapisywania historii.

source: %s: History disabled ; turn on -storehistory option.
pl_pl: %s: Historia nieaktywna; włącz -funkcje zapisywania historii.

source: %s: Impossible to scale the vertex #%d/%d at [%s] into inequality constraints
pl_pl: %s: Nie możliwe przeskalowanie wierzchołka #%d/%d w [%s] do ograniczenia nierówności

source: %s: Initial guess [%s] is not feasible.
pl_pl: %s: Wstępne zagadnienie [%s] nie jest wykonalne.

source: %s: Initial guess not feasible.
pl_pl: %s: Wstępne zagadnienie nie jest wykonalne.

source: %s: Length of working array is too short.
pl_pl: %s: długość obszaru roboczego jest zbyt krótka.

source: %s: Log file handle non zero while starting up the logging.
pl_pl: %s: Wartość pliku handle nie jest zerowa podczas uruchomienia logowania

source: %s: Logging already started.
pl_pl: %s: Logowanie rozpoczęte.

source: %s: Logging not started.
pl_pl: %s: Logowanie nie rozpoczęte.

source: %s: Negative iteration index %d is not allowed.
pl_pl: %s: Negatywny indeks interacji %d nie jest dozwolony.

source: %s: Negative iteration index are not allowed.
pl_pl: %s: Ujemne indeksy iteracji nie są dozwolone.

source: %s: No output command is defined.
pl_pl: %s: Nie zdefiniowano polecenia wyjściowego

source: %s: Number of columns of fv is %d, which is different from 1.
pl_pl: %s: Liczba kolumn fv wynosi %d, różni się od 1.

source: %s: Number of columns of x is %d, which is different from dimension = %d.
pl_pl: %s: Liczba kolumn x wynosi %d, różni się od wymiaru = %d.

source: %s: Number of rows of fv is %d, which is different from number of vertices = %d.
pl_pl: %s: Liczba wierszy fv wynosi %d, różni się od liczby wierzchołków = %d.

source: %s: Number of rows of x is %d, which is different from number of vertices = %d.
pl_pl: %s: Liczba wierszy x wynosi %d, różni się od liczby wierzchołków = %d.

source: %s: Odd number of arguments : the first argument is expected to be a struct, but is a %s
pl_pl: %s: Nieparzysta liczba argumentów: pierwszy argument ma być strukturą, ale jest %s

source: %s: Order must be 1, 2 or 4.
pl_pl: %s: zamówienia musi być 1, 2 lub 4.

source: %s: Problem has constraints, but fixed algorithm ignores them.
pl_pl: %s: Problem ma ograniczenia, poprawiony algorytm zignoruje je.

source: %s: Problem has constraints, but variable algorithm ignores them.
pl_pl: %s: Problem ma ograniczenia, algorytm zmiennej zignoruje je.

source: %s: Problem has no constraints, but Box algorithm is designed for them.
pl_pl: %s: Problem nie ma ograniczeń, ale algorytm Box jest zaprojektowany dla nich.

source: %s: Q is not symmetric positive definite.
pl_pl: %s: Q nie jest określone jako pozytywne symetrycznie.

source: %s: Randomized bounds initial simplex is not available without bounds.
pl_pl: %s: Przypadkowe granice początku simplex nie są dostępne bez ograniczeń.

source: %s: The -withderivatives option is true but all algorithms in neldermead are derivative-free.
pl_pl: %s: Opcja -withderivatives jest prawdziwa, ale wszystkie algorytmy są w neldermead bez pochodnych.

source: %s: The boundsmax vector is expected to be a row matrix, but current shape is %d x %d
pl_pl: %s: Wektor graniczny maksymalny jest przewidywany jako rząd macierzy, ale obecny kształt jest %d x %d

source: %s: The boundsmax vector is expected to have %d columns, but current shape is %d x %d
pl_pl: %s: Oczekuje się że wektor graniczny maksymalny zawiera %d kolumny, ale obecny kształt jest %d x %d

source: %s: The boundsmin vector is expected to be a row matrix, but current shape is %d x %d
pl_pl: %s: Wektor graniczny minimalny jest przewidywany jako rząd macierzy, ale obecny kształt jest %d x %d

source: %s: The boundsmin vector is expected to have %d columns, but current shape is %d x %d
pl_pl: %s: Oczekuje się że wektor graniczny minimalny zawiera %d kolumny, ale obecny kształt jest %d x %d

source: %s: The constraints are inconsistent.
pl_pl: %s: Ograniczenia są niespójne.

source: %s: The elements of the argument #%d must be in [%d %d].
pl_pl: %s: Elementy argumentu #%d muszą być w [%d %d].

source: %s: The exclusion index vector has %d rows instead of 1.
pl_pl: %s: Wykluczony wskaźnik wektora ma %d wiersz zamiast 1.

source: %s: The gradient can be applied only with a simplex made of n+1 points, but the dimension is %d and the number of vertices is %d
pl_pl: %s: Gradient może być stosowany tylko z simplex wykonanych z n+1 punktów, ale wymiar wynosi %d i liczba wierzchołków wynosi %d

source: %s: The len vector is expected to be a row matrix, but current shape is %d x %d.
pl_pl: %s: Wektor len ma być rzędu macierzy, ale obecna forma jest %d x %d.

source: %s: The len vector is expected to be a scalar, but current shape is %d x %d
pl_pl: %s: Wektor len ma być skalarny, ale obecnie jest %d x %d

source: %s: The len vector is not consistent with the x0 point. Current shape of x0 is %d x %d while current shape of len is %d x %d.
pl_pl: %s: Wektor len nie jest zgodny z punktem x0. Obecnie forma x0 jest %d x %d podczas gdy obecna forma wektora len jest %d x %d.

source: %s: The matrix %s from costf(x0,%d) has %d columns, instead of %d.
pl_pl: %s: Macierz %s z costf(x0,%d) ma %d kolumny, zamiast %d.

source: %s: The matrix %s from costf(x0,%d) has %d rows, instead of %d.
pl_pl: %s: Macierz %s z costf(x0,%d) ma %d wiersze, zamiast %d.

source: %s: The minimization problem has no solution.
pl_pl: %s: Problem minimalizacji nie został rozwiązany.

source: %s: The number of columns in the function value array is %d, while expected 1.
pl_pl: %s: Liczba kolumn w tablicy wartości funkcji jest %d, podczas gdy oczekiwana 1.

source: %s: The number of columns in x is %d, while expected %d.
pl_pl: %s: Liczba kolumn w x wynosi %d, oczekiwano %d.

source: %s: The number of rows in the function value array is %d, while expected %d.
pl_pl: %s: Liczba wierszy w tablicy wartości funkcji wynosi %d, podczas gdy oczekiwana %d.

source: %s: The number of rows in x is %d, while expected %d.
pl_pl: %s: Liczba wierszy w x wynosi %d, oczekiwano %d.

source: %s: The number of variable is zero.
pl_pl: %s: Liczba zmiennych wynosi 0.

source: %s: The number of vertices (i.e. the number of rows) is %d which is smaller than the number of columns %d (i.e. n+1).
pl_pl: %s: Liczba wierzchołków (czyli liczba wierszy) jest %d , która jest mniejsza niż liczba kolumn %d (czyli n+1).

source: %s: The numbers of columns of coords is %d but is expected to be at least %d
pl_pl: %s: Liczba kolumn z układu jest %d ale oczekiwana jest co najmniej %d

source: %s: The oriented simplex can be computed only with a simplex made of n+1 points, but the dimension is %d and the number of vertices is %d
pl_pl: %s: Zorientowany simplex można obliczyć tylko wykonując simplex z n+1 punktów, ale wymiar jest %d i liczba wierzchołków jest %d

source: %s: The value of the ''OutputFcn'' option is neither a function nor a list.
pl_pl: %s: Wartość z opcji "OutputFcn'' nie jest ani funkcją, ani listą.

source: %s: The value of the ''PlotFcns'' option is neither a function nor a list.
pl_pl: %s: Wartość z opcji ''PlotFcns'' nie jest ani funkcji, ani listą.

source: %s: The x0 vector is expected to be a column matrix, but current shape is %d x %d
pl_pl: %s: Wektor x0 ma być macierzą kolumnową, ale jego obecna forma jest %d x %d

source: %s: The x0 vector is expected to be a row matrix, but current shape is %d x %d
pl_pl: %s: Wektor x0 ma być macierzą wierszową, ale jego obecna forma jest %d x %d

source: %s: The x0 vector is expected to be a row matrix, but current shape is %d x %d.
pl_pl: %s: Wektor x0 ma być rzędu macierzy, ale jego forma jest %d x %d.

source: %s: Too many iterations (more than %d).
pl_pl: %s: Za dużo powtórzeń (więcej na %d).

source: %s: Unbounded problem!
pl_pl: %s: Nieokreślony problem!

source: %s: Unexpected maximum number of function evaluations %s.
pl_pl: %s: Nieoczekiwana liczba maksymalna z funkcji oceny %s.

source: %s: Unexpected maximum number of iterations %s.
pl_pl: %s: Nieoczekiwana maksymalna liczba powtórzeń %s.

source: %s: Unexpected negative value %s for %s option
pl_pl: %s: Nieoczekiwana wartość negatywna %s z %s opcji

source: %s: Unexpected number of input arguments : %d provided while 0 to 7 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 0 do 7.

source: %s: Unexpected number of input arguments : %d provided while 1 to 3 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 1 do 3.

source: %s: Unexpected number of input arguments : %d provided while 2 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanym warunkiem jest 2.

source: %s: Unexpected number of input arguments : %d provided while 2 or 3 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są 2 lub 3.

source: %s: Unexpected number of input arguments : %d provided while 2 to 4 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 2 do 4.

source: %s: Unexpected number of input arguments : %d provided while 2 to 5 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 2 do 5.

source: %s: Unexpected number of input arguments : %d provided while 2 to 6 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 2 do 6.

source: %s: Unexpected number of input arguments : %d provided while 6 to 7 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wejściowych : %d natomiast oczekiwanymi warunkami są od 6 do 7.

source: %s: Unexpected number of output arguments : %d provided while 3 to 5 are expected.
pl_pl: %s: Nieoczekiwana liczba argumentów wyjściowych : %d natomiast oczekiwanymi warunkami są od 3 do 5.

source: %s: Unexpected number of variables %d. Cannot draw contour plot for functions which do not have two parameters.
pl_pl: %s: Nieoczekiwane liczby zmiennych %d. Nie można wykorzystać konturu podziałki dla funkcji która nie ma dwóch parametrów.

source: %s: Unknown -method %s
pl_pl: %s: Nieznana -metoda %s

source: %s: Unknown key %s
pl_pl: %s: Nieznany klucz %s

source: %s: Unknown method %s
pl_pl: %s: Nieznana metoda %s

source: %s: Unknown restart detection %s
pl_pl: %s: Wykryto nieznany restarat %s

source: %s: Unknown restart simplex method %s
pl_pl: %s: Nieznana metoda restartu simplex %s

source: %s: Unknown simplex size method %s
pl_pl: %s: Nieznana metoda rozmiaru simplex %s

source: %s: Unknown status %s
pl_pl: %s: Nieznany status %s

source: %s: Unknown step %s
pl_pl: %s: Nieznanay krok %s

source: %s: Unknown value %s for %s option
pl_pl: %s: Nieznana wartość %s dla opcji %s

source: %s: Unknown value %s for -scalingsimplex0 option
pl_pl: %s: Nieznana wartość %s dla opcji -scalingsimplex0

source: %s: Unknown value %s for -simplex0method option
pl_pl: %s: Nieznana wartość %s dla opcji simplex0method

source: %s: Unrecognized parameter name ''%s''.
pl_pl: %s: Nie rozpoznaje parametrów nazwy ''%s''.

source: %s: Unrecognized value ''%s'' for ''Display'' option.
pl_pl: %s: Nie rozpoznaje wartości ''%s'' dla opcji ''Wyświetlanie''.

source: %s: Weighting matrix must be square.
pl_pl: %s: Wykładnik macierzy musi być kwadratowy.

source: %s: Wrong number of arguments : %d expected while %d given
pl_pl: %s: Nieprawidłowa liczba argumentów : %d oczekiwano podczas gdy %d dany

source: %s: Wrong number of input argument(s).
pl_pl: %s: Zła liczba parametru(-ów) wejściowego(-ych).

source: %s: Wrong number of input arguments: %d to %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.

source: %s: Wrong size for input argument #%d.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d.

source: %s: Wrong size for input argument #%d: A column vector expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwany wektor kolumnowy.

source: %s: Wrong size for input argument #%d: number of columns %d expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwana liczba kolumn %d.

source: %s: Wrong type for input argument #%d: A function expected.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: Oczekiwano funkcji.

source: %s: Wrong type for input argument #%d: N-dimensionnal array expected.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwana tablica N-dimensionnal.

source: %s: Wrong type for input argument #%s: external expected.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%s: oczekiwany zewnętrzny.

source: %s: x0 is not feasible.
pl_pl: %s: x0 nie jest wykonalny.

source: Error in dgels, info = %d.
pl_pl: Błąd w dgels, info = %d.

source: Error in dspev, info = %d.
pl_pl: Błąd w dspev, info = %d.

source: Error in dspgv, info = %d.
pl_pl: Błąd w dspgv, info = %d.

source: Error in dspst, info = %d.
pl_pl: Błąd w dspst, info = %d.

source: Error in dtrcon, info = %d.
pl_pl: Błąd w dtrcon, info = %d.

source: F(x)*Z has a negative eigenvalue.
pl_pl: F(x)*Z ma ujemne wartości własne.

source: L must be at least one.
pl_pl: L musi być przynajmniej jeden raz.

source: Matrices Fi, i=1,...,m are linearly dependent.
pl_pl: Matryce Fi, i=1,...,m są liniowo zależne.

source: Optimization and Simulation
pl_pl: Optymalizacja i Symulacja

source: The matrices F_i, i=1,...,m are linearly dependent (or the initial points are very badly conditioned).
pl_pl: Matryce F_i, i=1,...,m są liniowo zależne (albo początkowe punkty są bardzo źle uwarunkowane).

source: Work space is too small. Need at least %d*sizeof(double).
pl_pl: Obszar roboczy jest zbyt mały. Potrzeba go co najmniej %d* zwiększyć (dwukrotnie).

source: Z0 does not satisfy equality conditions for dual feasibility.
pl_pl: Z0 nie spełnia warunków równości dla dwóch możliwości.

source: Z0 is not positive definite.
pl_pl: Z0 nie jest określony pozytywnie.

source: blck_szs[%d] must be at least one.
pl_pl: blck_szs[%d] musi być przynajmniej jeden.

source: m must be at least one.
pl_pl: m musi być co najmniej jeden.

source: nu must be at least 1.0.
pl_pl: nu musi być co najmniej 1.0.

source: x0 is not strictly primal feasible.
pl_pl: x0 nie jest możliwie ściśle pierwotne.
