Repository: scilab/scilab
Catalog: scilab/modules/elementary_functions/locales/*/elementary_functions.po
Languages: fr_fr, ja_jp, ru_ru, zh_cn

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'', ''%s'', ''%s'', ''%s'' ou ''%s'' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'', ''%s'', ''%s'' または ''%s'' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'', ''%s'', ''%s'', ''%s'' или ''%s''.
zh_cn: %s：输入参数#%d的值错误：应该为"%s"、"%s"、"%s"、"%s"或"%s"。

source: %s: Wrong type for input argument #%d: Real, complex, int matrix or matrix of strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Réel, complexe, matrice d'entiers ou une matrice de chaînes de caractères attendus.
ja_jp: %s: 入力引数 #%d で不正な型: 実数、複素、整数行列、または、文字列の行列を想定します。
ru_ru: %s: Неверный тип аргумента №%d: Ожидалось вещественное или комплексное число или матрица строк или целых чисел.
zh_cn: %s：输入参数#%d的类型错误：应该为实数、复数、整数矩阵，或字符串矩阵。

source: %s: Wrong value for input argument #%d.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée #%d.
ja_jp: %s: 入力引数 #%d で不正な値です。
ru_ru: %s: Неверное значение аргумента №%d.
zh_cn: %s：输入参数#%d的值错误。

source: %s: Wrong type for input argument #%d: Unknown type.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Type inconnu.
ja_jp: %s: 入力引数 #%d で不正な型: 未知の型です。
ru_ru: %s: Неверный тип входного аргумента #%d: Неизвестный тип.
zh_cn: %s：输入参数#%d的类型错误：未知的类型。

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
ja_jp: %s: これ以上メモリがありません。
ru_ru: %s: Не осталось доступной памяти.
zh_cn: %s: 内存不足。

source: %s: Wrong value for input argument #%d: '%s' expected .
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' を想定します。
ru_ru: %s: Неверное значение аргумента №%d: Ожидался '%s'.
zh_cn: %s：输入参数#%d的值错误：应该为'%s'。
