Repository: scilab/scilab
Catalog: scilab/modules/elementary_functions/locales/*/elementary_functions.po
Languages: fr_fr, ja_jp, ru_ru, zh_cn

source: %s: Wrong value for input argument #%d: Unknown file extension, %s, %s, %s or %s expected
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Extension de fichier inconnue, %s, %s, %s ou %s attendue
ja_jp: %s: 入力引数 #%d で不正な値: 未知のファイル拡張子, %s, %s, %s または %s を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Неизвестное расширение файла, ожидалось %s, %s, %s или %s
zh_cn: %s：输入参数#%d的值错误：未知的文件扩展名，应该为'%s'、'%s'、'%s'或'%s'。

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : %d attendu.
ja_jp: %s: 入力引数(s)で不正な数: %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d.
zh_cn: %s：输入参数的数目错误：应该为%d。

source: %s: Wrong type for input argument #%d: Real or complex matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n°%d : Matrice réelle ou complexe attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 実数、または、複素行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась матрица вещественных или комплексных чисел.
zh_cn: %s：输入参数#%d的类型错误：应该为实数或复数矩阵。

source: %s: Wrong size for input argument #%d: A square matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une matrice carrée attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 正方行列を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась квадратная матрица.
zh_cn: %s：输入参数#%d的大小错误：应该为一个方阵。

source: %s: Wrong type for input argument #%d: Array of reals expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un tableau de réels attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 実数の配列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидался массив вещественных чисел.
zh_cn: %s：输入参数#%d的类型错误：应该为实数数组。

source: %s: Matrix is not diagonalisable.
fr_fr: %s : Matrice non diagonalisable.
ja_jp: %s: 行列は対角化可能ではありません。
ru_ru: %s: Матрица не может быть приведена к диагональному виду.
zh_cn: %s：矩阵不是对角阵。

source: %s: Wrong type for input argument #%d: Matrix of strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n°%d : Une matrice de chaînes de caractère attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列の行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась матрица строк.
zh_cn: %s：输入参数#%d的类型错误：应该为字符串矩阵。

source: %s: Wrong type for input argument #%d: integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : entier attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 整数を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось целое число.
zh_cn: %s：输入参数#%d的类型错误：应该为整 数。

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être entre %d et %d.
ja_jp: %s: 入力引数 #%d で不正な値: %d と %d の間でなくてはなりません。
ru_ru: %s: Неверное значение входного аргумента #%d: Должно быть между %d и %d.
zh_cn: %s：输入参数#%d的值错误：应该介于%d与%d之间。

source: %s: Wrong value for input argument(s): Valid base %d representations expected.
fr_fr: %s : Mauvaise valeur pour le / les argument(s) d'entrée : Une représentation valide en base %d est attendue.
ja_jp: %s: 入力引数(s)で不正な値: 適切な基礎 %d 代表を想定します。
ru_ru: %s: Неверное значение входных аргументов: Ожидалось корректное представление числа в %d-ой системе счисления.
zh_cn: %s：输入参数的值错误：应该为正确的基于%d进制的表示。

source: %s: Wrong value for input argument #%d: Matrix of strings made of zeros and ones expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Matrice de chaînes de caractères composée de zéros et uns attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 文字列の行列はひとつのゼロで作られていると想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалась матрица строк из нулей и единиц.
zh_cn: %s：输入参数#%d的值错误：应该为由0和1组成的字符串矩阵。

source: %s: Wrong size for input argument #%d: Must be less than %d characters.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Doit être inférieur à %d caractères.
ja_jp: %s: 入力引数 #%d で不正なサイズ: %d 文字以下でなくてはなりません。
ru_ru: %s: Неверный размер входного аргумента #%d: Должно быть меньше, чем %d символов.
zh_cn: %s：输入参数#%d的大小错误：必须少于%d个字符。

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel est attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 実数を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось вещественное число.
zh_cn: %s：输入参数#%d的类型错误：应该为实数。

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un entier attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 整数を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось целое число.
zh_cn: %s：输入参数#%d的类型错误：应该为一个整数。

source: %s: Wrong size for input argument #%d: A real expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d : Un réel attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 実数を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалось вещественное число.
zh_cn: %s：输入参数#%d的大小错误：应该为一个实数。

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un entier attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 整数を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалось целое число.
zh_cn: %s：输入参数#%d的大小错误：应该为一个整数。

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être entre %d et %d.
ja_jp: %s: 入力引数 #%d で不正な値: %d と %d の間でなくてはなりません。
ru_ru: %s: Неверное значение входного аргумента #%d: Должно быть между %d и %d.
zh_cn: %s：输入参数#%d的值错误：必须介于%d与%d之间。

source: %s: Wrong value for input argument #%d: Integer >= %d expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Entier >= %d attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 整数 >= %d を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось целое число >= %d.
zh_cn: %s：输入参数#%d的值错误：应该 >= %d。

source: %s: Wrong type for input arguments: Same types expected.
fr_fr: %s : Mauvais type pour les arguments d'entrée : Mêmes types attendus.
ja_jp: %s: 入力引数で不正な型: 同じ型を想定します。
ru_ru: %s: Неверный тип входных аргументов: Ожидались такие же типы.
zh_cn: %s：输入参数的类型错误，应该为同一类型。

source: %s: Wrong size for input arguments: Same size expected.
fr_fr: %s : Mauvaise taille pour les arguments d'entrée: Mêmes tailles attendues.
ja_jp: %s: 入力引数で不正なサイズ: 同じサイズを想定します。
ru_ru: %s: Неверный размер входных аргументов: Ожидались такие же размеры.
zh_cn: %s：输入参数的大小错误：应该为同样的大小。

source: %s: Wrong input argument #%d: Scalar/matrix/hypermatrix of unsigned integers expected.
fr_fr: %s : Mauvais argument d'entrée n° %d : Scalaire/Matrice/Hypermatrice d'entiers non signés attendu.
ja_jp: %s: 入力引数 #%d が不正: 符号なし整数のスカラー/行列/正方行列を想定します。
ru_ru: %s: Неверный входной аргумент #%d: Ожидался скаляр/матрица/гиперматрица целых чисел без знака.
zh_cn: %s：输入参数#%d错误：应该为无符号整数类型的标量/矩阵/超矩阵。

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : Au moins %d attendus.
ja_jp: %s: 入力引数(s)で不正な数: 最小の %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось как минимум %d.
zh_cn: %s：输入参数的数目错误：至少%d个。

source: %s: Wrong input argument #%d: An unsigned integer expected.
fr_fr: %s : Mauvais argument d'entrée n°%d : Un entier non signé attendu.
ja_jp: %s: 入力引数 #%d が不正: 符号なし整数を想定します。
ru_ru: %s: Неверный входной аргумент #%d: Ожидалось беззнаковое целое.
zh_cn: %s：输入参数#%d错误：应该为一个无符号整数。

source: %s: Wrong size for input arguments: Same sizes expected.
fr_fr: %s : Mauvaise taille pour les arguments d'entrée: Même taille attendue.
ja_jp: %s: 入力引数で不正なサイズ: 同じサイズを想定します。
ru_ru: %s: Неверный размер входных аргументов: Должны быть одинакового размера.
zh_cn: %s：输入参数的大小错误：应该为同样大小。

source: %s: Wrong type for input argument #%d: Scalar/matrix/hypermatrix of unsigned integers expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n° %d : Scalaire/Matrice/Hypermatrice d'entiers non signés attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 符号なし整数のスカラー/行列/正方行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидался скаляр/матрица/гиперматрица целых чисел без знака.
zh_cn: %s：输入参数#%d的类型错误：应该为无符号整数标量、矩阵或超矩阵。

source: %s: Wrong value for input argument #%d: 0 or 1 expected
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : 0 ou 1 attendu
ja_jp: %s: 入力引数 #%d で不正な値: 0 または 1 を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: ожидалось 0 или 1
zh_cn: %s：输入参数#%d的值错误：应该为0或1。

source: %s: Wrong type for input argument #%d: A positive real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel positif attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 明確な実数を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось положительное вещественное число.
zh_cn: %s：输入参数#%d的类型错误：应该为一个正实数。

source: %s: Wrong type for input argument #%d: Cell expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Cell attendu.
ja_jp: %s: 入力引数 #%d で不正な型: セルを想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась ячейка.
zh_cn: %s：输入参数#%d的类型错误：应该为Cell。

source: %s: Wrong type for input argument #%d: Same type expected for all cell contents
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Le même type est attendu pour le contenu de chaque cel
ja_jp: %s: 入力引数 #%d で不正な型: 全てのセル内容で同じ型を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: типы должны совпадать для содержимого всех ячеек
zh_cn: %s：输入参数#%d的类型错误：所有Cell的内容应该为同一类型。

source: %s: Wrong size for input argument #%d: Must be <= %d.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : doit être <= %d.
ja_jp: %s: 入力引数 #%d で不正なサイズ: <= %d でなくてはなりません。
ru_ru: %s: Неверный размер входного аргумента #%d: Должен быть <= %d.
zh_cn: %s：输入参数#%d的大小错误：必须小于等于%d。

source: %s: Wrong type for input argument #%d: Matrix of string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Matrice de chaînes de caractère attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列の行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась матрица строк.
zh_cn: %s：输入参数#%d的类型错误：应该为字符串矩阵。

source: %s: Wrong type for input argument #%d: Real matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une matrice réelle attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 実行列を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась матрица вещественных чисел.
zh_cn: %s：输入参数#%d的类型错误：应该为实数矩阵。

source: %s: Wrong number of input argument(s): %d or %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d ou %d attendu.
ja_jp: %s: 入力引数(s)で不正な数: %d または %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d или %d.
zh_cn: %s：输入参数的数目错误：应该为%d或%d。

source: %s: Wrong value for input argument #%d: Matrix is not diagonalisable.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : La matrice n'est pas diagonalisable.
ja_jp: %s: 入力引数 #%d で不正な値: 行列は対角可能ではありません。
ru_ru: %s: Неверное значение входного аргумента #%d: Матрица не может быть приведена к диагональному виду.
zh_cn: %s：输入参数#%d的值错误：矩阵不可对角化。

source: %s: Wrong value for input argument #%d: Scalar/vector/matrix of positive integers expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Scalaire/Vecteur/Matrice d'entiers positifs attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 明確な整数のスカラー/ベクトル/行列を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидался скаляр/матрица/вектор целых положительных чисел.
zh_cn: %s：输入参数#%d的值错误：应该为正整数为标量/向量/矩阵。

source: %s: Wrong value for input argument #%d: A positive integer expected
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un entier positif attendu
ja_jp: %s: 入力引数 #%d で不正な値: 明確な整数を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось положительное целое число
zh_cn: %s：输入参数#%d的值错误：应该为一个正整数。

source: %s: Wrong value for input argument #%d: Non-negative integer matrix expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Matrice d'entiers non-négatifs attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 負でない整数行列を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалась матрица неотрицательных чисел.
zh_cn: %s：输入参数#%d的值错误：应该为非负整数矩阵。

source: %s: Wrong value for input argument #%d: Scalar positive integer expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un scalaire entier positif attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 明確な整数スカラーを想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось целое положительное число.
zh_cn: %s：输入参数#%d的值错误：应该为正整数标量。

source: %s: Wrong value for input argument #%d: Scalar/vector/matrix/hypermatrix of positive integers expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Scalaire/Vecteur/Matrice/Hypermatrice d'entiers positifs attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 明確な整数のスカラー/ベクトル/行列/多次元配列を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидался скаляр/вектор/матрица/гиперматрица целых положительных чисел.
zh_cn: %s：输入参数#%d的值错误：应该为正整数标量/向量/矩阵/超矩阵。

source: %s: Wrong size for input argument #%d: A positive integer expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un entier positif attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 明確な整数を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалось положительное целое число.
zh_cn: %s：输入参数#%d的大小错误：应该为一个正整数。

source: %s: Wrong type for input argument #%d: A positive integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un entier positif attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 明確な整数を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось положительное целое число.
zh_cn: %s：输入参数#%d的值错误：应该为一个正整数。

source: %s: Wrong value for input argument #%d: Real matrix expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Matrice réelle attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 実行列を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалась матрица вещественных чисел.
zh_cn: %s：输入参数#%d的值错误：应该为实数矩阵。

source: %s: Wrong value for input argument #%d: Valid hexadecimal representations expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Une représentation hexadécimale attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 適切な１６進表記を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось корректное шестнадцатеричное представление.
zh_cn: %s：输入参数#%d的值错误：应该为正确的十六进制表示。

source: %s: Wrong value for imput argument #%d: syntax error in given expression
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : erreur de syntaxe dans l'expression donnée
ja_jp: %s: 入力引数 #%d で不正な値: 与えられた表現の構文エラー
ru_ru: %s: Неверное значение входного аргумента #%d: ошибка синтаксиса в выражении
zh_cn: %s：输入参数#%d的值错误：给定表达式语法错误。

source: %s: Wrong number of input arguments: Must be between %d and %d.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : Doit être entre %d et %d.
ja_jp: %s: 入力引数の不正な数: %d と %d の間でなくてはなりません。
ru_ru: %s: Неверное количество входных аргументов: Должно быть между %d и %d.
zh_cn: %s：输入参数的数目错误：必须介于%d与%d之间。

source: %s: Wrong size for input argument #%d: Vector or matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Vecteur ou matrice attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトル、または、行列を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась матрица или вектор.
zh_cn: %s：输入参数#%d的大小错误：应该为向量或标量。

source: %s: Wrong value for input argument #%d: Reals expected but some NaN found.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Des réels attendus, mais quelques NaN trouvés.
ja_jp: %s: 入力引数 #%d で不正な値: 予想された実数、しかし、いくつかのNaNが見つかりました。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидались вещественные числа, но некоторые из них в значении NaN.
zh_cn: %s：输入参数#%d的值错误：应该为实数但存在NaN值（无效值）。

source: %s: Wrong size for input arguments #%d and #%d: Same size expected.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée n°%d et n°%d : La même taille est attendue.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: 同じサイズを想定します。
ru_ru: %s: Неверный размер входных аргументов #%d и #%d: Ожидался одинаковый размер.
zh_cn: %s：输入参数#%d和#%d的大小错误：应该为同样大小。

source: %s: Wrong size for input argument #%d: Vector expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d: Vecteur attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトルを想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидался вектор.
zh_cn: %s：输入参数#%d的大小错误：应该为向量。

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou ''%s'' ou ''%s'' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' また ''%s'' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'', ''%s'' или ''%s''.
zh_cn: %s：输入参数#%d的值错误：应该为"%s"、"%s"或"%s"。

source: %s: Wrong value for input argument #%d: ''%s'' or real expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou un réel attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または、実数を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'' или вещественное число.
zh_cn: %s：输入参数#%d的值错误：应该为"%s"或实数。

source: %s: Wrong value for input argument #%d: %d,''%s'',%d or ''%s'' expected
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : %d,''%s'',%d ou ''%s'' attendue
ja_jp: %s: 入力引数 #%d で不正な値: %d,''%s'',%d または ''%s'' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось %d,''%s'',%d или ''%s''
zh_cn: %s：输入参数#%d的值错误：应该为%d、"%s"、%d或"%s"。

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d.
ja_jp: %s: 入力引数 #%d で不正な型です。
ru_ru: %s: Неверный тип входного аргумента #%d.
zh_cn: %s：输入参数#%d的类型错误。

source: %s: Wrong number of input argument(s): At most %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : Au plus %d attendus.
ja_jp: %s: 入力引数(s)で不正な数: ほとんど %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось не более %d.
zh_cn: %s：输入参数的数目错误：最多应该%d个。

source: %s: Wrong value for input argument #%d: ''%s'' expexted.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s''.
zh_cn: %s：输入参数#%d的值错误：应该为"%s"。

source: %s: Unexpected value of n: %d. Expected value is greater than %d.
fr_fr: %s : Valeur inattendue pour n : %d. La valeur attendue doit être plus grande que %d.
ja_jp: %s: n の思いがけない値: %d, 期待値は、%dよりも大きいです。
ru_ru: %s: Неожиданное значение n: %d. Ожидалось значение больше чем %d.
zh_cn: %s：n的值%d不是应该取的值。取值应该大于%d。

source: %s: Wrong size for input argument #%d: Square matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Matrice carrée attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 正方行列を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась квадратная матрица.
zh_cn: %s：输入参数#%d的大小错误：应该为方阵。

source: %s: Log of a singular matrix.
fr_fr: %s : Log d'une matrice singulière.
ja_jp: %s: 特異行列のログ
ru_ru: %s: Логарифм вырожденной матрицы.
zh_cn: %s：一个奇异矩阵的指数。

source: %s: Unable to diagonalize.
fr_fr: %s : Incapable de diagonaliser.
ja_jp: %s: 対角化することができません。
ru_ru: %s: Невозможно привести к диагональному виду.
zh_cn: %s：不能对角化。

source: %s: Wrong number of output arguments: At most %d expected.
fr_fr: %s : Mauvais nombre d'arguments en sortie : Au moins %d attendus.
ja_jp: %s: 出力引数の不正な数: ほとんど %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось не больше %d.
zh_cn: %s：输出参数的数目错误：应该至少%d个。

source: %s: Wrong number of input arguments: At most %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : Au plus %d attendus.
ja_jp: %s: 入力引数の不正な数: ほとんどの %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось не больше %d.
zh_cn: %s：输入参数的数目错误：应该至少%d个。

source: %s: Wrong number of output arguments vs. input arguments: Same number expected.
fr_fr: %s : Mauvais nombre d'arguments de sortie par rapport au nombre d'arguments d'entrée : Même nombre attendu.
ja_jp: %s: 出力引数の不正な数と入力引数: 同じ数を想定します。
ru_ru: %s: Неверное количество выходных аргументов по сравнению со входными: Ожидалось одинаковое количество.
zh_cn: %s：输出参数和输入参数的个数错误：应该数目相同。

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre d'arguments d'entrée incorrect : %d au moins sont attendus.
ja_jp: %s: 入力引数の不正な数: 最小の %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось как минимум %d.
zh_cn: %s：输入参数的数目错误：至少应该输入%d个。

source: %s: Wrong type for argument #%d: Real expected.
fr_fr: %s : Mauvais type pour l'argument #%d : Réel attendu.
ja_jp: %s: 引数 #%d のための型が不正: 実数を想定します。
ru_ru: %s: Неверный тип аргумента #%d: Ожидалось вещественное число.
zh_cn: %s：参数的类型错误#%d：应该为实数。

source: %s: Wrong argument #%d: Positive integer expected.
fr_fr: %s : Mauvais argument n°%d : Entier positif attendu.
ja_jp: %s: 引数 #%d が不正: 明確な整数を想定します。
ru_ru: %s: Неверный аргумент #%d: Ожидалось положительное целое число.
zh_cn: %s：参数#%d错误：应该为正整数。

source: %s: Wrong value for input argument #%d: Valid octal representations expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Une représentation octale valide attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 適切な８進数を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось корректное восьмеричное представление.
zh_cn: %s：输入参数#%d的值错误：应该为正确的八进制表示。

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendus.
ja_jp: %s: 入力引数の不正な数: %d を想定します。
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d.
zh_cn: %s：输入参数的数目错误：应该为%d。

source: %s: Wrong size for argument #%d: Vector expected.
fr_fr: %s : Mauvaise dimension pour l'argument n°%d : Vecteur attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトルを想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидался вектор.
zh_cn: %s：输入参数#%d的大小错误：应该为向量。

source: %s: Wrong size for input argument #%d.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。
ru_ru: %s: Неверный размер входного аргумента #%d.
zh_cn: %s：输入参数#%d的大小错误。

source: %s: Wrong size for input argument #%d: At least the size of input argument #%d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Au moins la dimension de l'argument d'entrée n°%d attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 少なくとも入力引数 #%d のサイズを想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Он должен быть не меньше размера входного аргумента #%d.
zh_cn: %s：输入参数#%d的大小错误：大小应该为输入参数#%d的大小。

source: %s: Wrong value for input argument #%d: Non-hermitian matrix.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Matrice non-Hermitienne.
ja_jp: %s: 入力引数 #%d で不正な値: 非対称行列
ru_ru: %s: Неверное значение входного аргумента #%d: Матрица не эрмитова.
zh_cn: %s：输入参数#%d的值错误：应该为非Hermite矩阵。

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou ''%s'' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' を想定します。
ru_ru: %s: Неверное значение входного аргумента #%d: Ожидалось ''%s'' или ''%s''.
zh_cn: %s：输入参数#%d的值错误：应该为"%s"或者"%s"。

source: %s: Wrong values for input arguments #%d and #%d: c(1) must be equal to r(1).
fr_fr: %s : Mauvaises valeur pour les arguments d'entrée n°%d et n° %d : c(1) doit être égal à r(1).
ja_jp: %s: 入力引数 #%d と #%d で不正な値: c(1) は、r(1) に等しくなければなりません。
ru_ru: %s: Неверны значения входных аргументов #%d и #%d: c(1) должен равняться r(1).
zh_cn: %s：输入参数#%d和#%d的值错误：c(1)必须等于r(1)。

source: %s: Wrong size for input arguments: Incompatible sizes.
fr_fr: %s : Mauvaise taille pour les arguments d'entrée : Tailles incompatibles.
ja_jp: %s: 入力引数で不正なサイズ]: 互換性がないサイズです。
ru_ru: %s: Неверный размер входных аргументов: Размеры несовместимы.
zh_cn: %s：输入参数的大小错误：大小不兼容。

source: %s: Wrong size for input argument #%d: Non-empty string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractère non vide attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 空でない文字列を想定します。
ru_ru: %s: Неверный размер входного аргумента #%d: Ожидалась непустая строка.
zh_cn: %s：输入参数#%d的大小错误：应该为非空字符串。
